#Область ОбработчикиСобытийФОрмы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаСервере
Процедура РассчитыватьНалогПриИзмененииНаСервере()
	тОбъект = РеквизитФормыВЗначение("Объект");
	тОбъект.ПересчитатьНалогВСтроках();
	ЗначениеВРеквизитФормы(тОбъект, "Объект");
	
	Объект.СуммаДокумента = Объект.Выплаты.Итог("СуммаСНалогом");
КонецПроцедуры

&НаКлиенте
Процедура РассчитыватьНалогПриИзменении(Элемент)
	РассчитыватьНалогПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПодборНаСервере(МассивДоговоров) 
	
		Для Каждого Стр из МассивДоговоров Цикл 
			СтруктураПоиска = Новый Структура;
			СтруктураПоиска.Вставить("Договор", Стр);
			
			МассивНайденных = Объект.Выплаты.НайтиСтроки(СтруктураПоиска);
			
			Если НЕ МассивНайденных.количество() Тогда 
				НоваяСтрока = Объект.Выплаты.Добавить();
				НоваяСтрока.Договор    = Стр;
				НоваяСтрока.Контрагент = Стр.Контрагент;
				НоваяСтрока.Партнер    = Стр.Партнер;
			КонецЕсли;
			
		КонецЦикла; 
		
	
КонецПроцедуры

&НаКлиенте
Процедура Подбор(Команда)

	ПараметрыФормы = Новый Структура("МножественныйВыбор",Истина);
	ПараметрыФормы.Вставить("Логс_ВидКлиентаCRM", ПредопределенноеЗначение("Перечисление.Логс_ВидыКлиентовCRM.СамозанятыйКурьер"));
	
	ОткрытьФорму("Справочник.ДоговорыКонтрагентов.ФормаВыбора", ПараметрыФормы, ЭтотОбъект,,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры 
 
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Вставить содержимое обработчика.
КонецПроцедуры     

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если Не ЗначениеЗаполнено(ВыбранноеЗначение) Тогда
		Возврат;
	КонецЕсли;
	
	Если ВыбранноеЗначение.Количество() Тогда 
		
		ПодборНаСервере(ВыбранноеЗначение);
		Модифицированность = Истина;
		
	КонецЕсли;

КонецПроцедуры



#КонецОбласти


#Область CSV_Sber
&НаКлиенте
Процедура ЭкспортCSV(Команда)
	Если Модифицированность Тогда
		Предупреждение("Для экспорта реестра необходимо записать документ");
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = "*.csv|*.csv";
	Диалог.Заголовок = НСтр("Сохранение файла");
	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаCSVЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);
КонецПроцедуры

&НаСервере
Функция СформироватьПотокиНаСервере(Реестр)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Выплаты.Контрагент.НаименованиеПолное КАК ФИО,
	               |	Выплаты.Договор.БанковскийСчетКонтрагента.НомерСчета КАК НомерСчета,
	               |	Выбор Когда Выплаты.Договор.Организация = &ОЛ Тогда Выплаты.Договор.Логс_ЗаказчикСЗ Иначе """" Конец КАК Заказчик,
	               |	Выплаты.СуммаСНалогом КАК СуммаСНалогом
	               |ИЗ
	               |	Документ.Логс_РеестрВыплатСамозанятым.Выплаты КАК Выплаты
	               |ГДЕ
	               |	Выплаты.Ссылка = &Реестр
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Заказчик,
	               |	ФИО";
	Запрос.УстановитьПараметр("Реестр", Реестр);
	Запрос.УстановитьПараметр("ОЛ", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ОрганизацияЛогсис());
	
	Заказчик = Неопределено;
	//Поток = "";
	РазделительЗначений = ";";
	РазделительСтрок = Символы.ПС;
	
	Потоки = Новый Массив;
	Индекс = -1;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Заказчик<>Выборка.Заказчик Тогда
			//Если Заказчик = Неопределено Тогда
			Заказчик = Выборка.Заказчик;
			Потоки.Добавить(Новый Структура("Заказчик, Поток",Заказчик,""));
			Индекс = Индекс+1;
			Первая = Истина;
		КонецЕсли;
		
		Если НЕ Первая Тогда
			Потоки[Индекс].Поток = Потоки[Индекс].Поток + РазделительСтрок;
		Иначе
			Первая = Ложь;
		КонецЕсли;
		
		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Выборка.НомерСчета + РазделительЗначений;
		ФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Выборка.ФИО);
		Потоки[Индекс].Поток = Потоки[Индекс].Поток + ФИО.Фамилия + РазделительЗначений + ФИО.Имя + РазделительЗначений + ФИО.Отчество + РазделительЗначений;
		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Формат(Выборка.СуммаСНалогом, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=") + РазделительЗначений;
		//++ Ким Виктор 25.07.2024
		//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-13992
		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Формат(0, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=") + РазделительЗначений;
		Потоки[Индекс].Поток = Потоки[Индекс].Поток + "87";
		//-- Ким Виктор 25.07.2024
	КонецЦикла;
	
	Возврат Потоки;
	
КонецФункции

&НаКлиенте
Процедура ВыборФайлаCSVЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
	Иначе
		Возврат;
	КонецЕсли;
	
	Потоки = СформироватьПотокиНаСервере(Объект.Ссылка);
	
	Для Каждого ДанныеПотока из Потоки Цикл
		Если ДанныеПотока.Заказчик = "" Тогда
			ИмяФайла = ПутьКФайлу;
		Иначе
			ИмяФайла = ?(СтрЗаканчиваетсяНа(ПутьКФайлу, ".csv"),
							Лев(ПутьКФайлу, СтрДлина(ПутьКФайлу)-3) ,ПутьКФайлу) 
					+"("+ДанныеПотока.Заказчик+").csv";
		КонецЕсли;
		Файл = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.ANSI);
		Файл.ЗаписатьСтроку(ДанныеПотока.Поток);
		Файл.Закрыть();
	КонецЦикла;
	
	//Предупреждение("Файл сохранен");
	ОбщегоНазначенияКлиент.СообщитьПользователю("Файл сохранен");
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ВыплатыДоговорПриИзменении(Элемент)
	ТД = Элементы.Выплаты.ТекущиеДанные;	
	ТД.Партнер = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТД.Договор, "Партнер"); 
	ТД.Контрагент = ОбщегоНазначенияУТВызовСервера.ЗначениеРеквизитаОбъекта(ТД.Договор, "Контрагент"); 
КонецПроцедуры


&НаСервере
Процедура ВыплатыРассчитыватьНалогПриИзмененииНаСервере()
	Документы.Логс_РеестрВыплатСамозанятым.ПересчитатьНалогВСтроке(Элементы.Выплаты.ТекущиеДанные);
КонецПроцедуры

&НаКлиенте
Процедура ВыплатыРассчитыватьНалогПриИзменении(Элемент)
	Строка = Элементы.Выплаты.ТекущиеДанные;
	Строка.СуммаСНалогом = ?(Строка.РассчитыватьНалог, Строка.Сумма/0.94, Строка.Сумма);

КонецПроцедуры

#Область XML_Alfa
&НаКлиенте
Процедура ЭкспортXMLАльфа(Команда)
	Если Модифицированность Тогда
		Предупреждение("Для экспорта реестра необходимо записать документ");
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = "*.xml|*.xml";
	Диалог.Заголовок = НСтр("Сохранение файла");
	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаXMLЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаXMLЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
	Иначе
		Возврат;
	КонецЕсли;
	
	Потоки = СформироватьXMLAlfaНаСервереСРазбивкойПоФИО(Объект.Ссылка);
	НомерФайла = 1;
	Для Каждого ДанныеПотока из Потоки Цикл
		Если ДанныеПотока.Заказчик = "" Тогда
			ИмяФайла = ПутьКФайлу;
		Иначе
			ИмяФайла = ?(СтрЗаканчиваетсяНа(ПутьКФайлу, ".xml"),
							Лев(ПутьКФайлу, СтрДлина(ПутьКФайлу)-4) ,ПутьКФайлу) 
					+"("+ДанныеПотока.Заказчик+").xml";
		КонецЕсли;
		
		//++ Ким Виктор 28.06.2024
		//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-13521
		//Формирование хмл на несколько файлов по сумме и фио;
		Если Потоки.Количество() > 1 Тогда 
			ИмяФайла = ?(СтрЗаканчиваетсяНа(ПутьКФайлу, ".xml"),Лев(ПутьКФайлу, СтрДлина(ПутьКФайлу)-4), ПутьКФайлу) + Строка(НомерФайла) + ".xml";
			НомерФайла = НомерФайла + 1;
		КонецЕсли;
		//-- Ким Виктор 28.06.2024
		
		Файл = Новый ЗаписьТекста(ИмяФайла, "windows-1251");
		Файл.ЗаписатьСтроку(ДанныеПотока.Поток);
		Файл.Закрыть();
	КонецЦикла;
	
	//Предупреждение("Файл сохранен");
	ОбщегоНазначенияКлиент.СообщитьПользователю("Файл сохранен");
	
КонецПроцедуры  

&НаКлиенте
Процедура ВыборФайлаXMLЗавершение_старая(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
	Иначе
		Возврат;
	КонецЕсли;
	
	Потоки = СформироватьXMLAlfaНаСервере(Объект.Ссылка);
	Для Каждого ДанныеПотока из Потоки Цикл
		Если ДанныеПотока.Заказчик = "" Тогда
			ИмяФайла = ПутьКФайлу;
		Иначе
			ИмяФайла = ?(СтрЗаканчиваетсяНа(ПутьКФайлу, ".xml"),
							Лев(ПутьКФайлу, СтрДлина(ПутьКФайлу)-4) ,ПутьКФайлу) 
					+"("+ДанныеПотока.Заказчик+").xml";
		КонецЕсли;
		
		Файл = Новый ЗаписьТекста(ИмяФайла, "windows-1251");
		Файл.ЗаписатьСтроку(ДанныеПотока.Поток);
		Файл.Закрыть();
	КонецЦикла;
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Файл сохранен");
	
КонецПроцедуры   

//++ Ким Виктор 27.06.2024
//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-13521
//Формирование хмл на несколько файлов по сумме и фио;
&НаСервере
Функция СформироватьXMLAlfaНаСервереСРазбивкойПоФИО(Реестр)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Логс_РеестрВыплатСамозанятым.Дата КАК Дата,
	               |	Логс_РеестрВыплатСамозанятым.Организация.Наименование КАК НаименованиеОрганизации,
	               |	Логс_РеестрВыплатСамозанятым.Организация.ИНН КАК ИНН,
	               |	isnull(Логс_РеестрВыплатСамозанятым.БанковскийСчет.НомерСчета, """") КАК НомерСчета,
	               |	isnull(Логс_РеестрВыплатСамозанятым.БанковскийСчет.БИКБанка, """") КАК БИК,
	               |	Логс_РеестрВыплатСамозанятым.БанковскийСчет.Логс_НомерДоговора КАК НомерДоговора
	               |ИЗ
	               |	Документ.Логс_РеестрВыплатСамозанятым КАК Логс_РеестрВыплатСамозанятым
	               |ГДЕ
	               |	Логс_РеестрВыплатСамозанятым.Ссылка = &Реестр";     
	Запрос.УстановитьПараметр("Реестр", Реестр);
	
	ВыборкаРеестр = Запрос.Выполнить().Выбрать();  
	Если НЕ ВыборкаРеестр.Следующий() Тогда
		Возврат "";
	КонецЕсли;  
	
	ДатаФормирования 		 = Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd"); 	
	НомерДоговора 	 		 = ВыборкаРеестр.НомерДоговора;
	НаименованиеОрганизации  = ВыборкаРеестр.НаименованиеОрганизации; 	
	ИНН 				     = ВыборкаРеестр.ИНН;
	РасчетныйСчетОрганизации = ВыборкаРеестр.НомерСчета;
	БИК						 = ВыборкаРеестр.БИК;
	ИдПервичногоДокумента	 = Строка(Реестр.УникальныйИдентификатор());
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Выплаты.НомерСтроки КАК НомерСтроки,
	               |	Выплаты.Контрагент.НаименованиеПолное КАК ФИО,
	               |	Выплаты.Договор.БанковскийСчетКонтрагента.НомерСчета КАК НомерСчета,
	               |	Выплаты.СуммаСНалогом КАК СуммаСНалогом,
	               |	Выбор Когда Выплаты.Договор.Организация = &ОЛ Тогда Выплаты.Договор.Логс_ЗаказчикСЗ Иначе """" Конец КАК Заказчик,
	               |	0 КАК СуммаУдержаний,
	               |	""0000"" КАК ОтделениеБанка,
	               |	"""" КАК ФилиалОтделенияБанка
	               |ИЗ
	               |	Документ.Логс_РеестрВыплатСамозанятым.Выплаты КАК Выплаты
	               |ГДЕ
	               |	Выплаты.Ссылка = &Реестр
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	Запрос.УстановитьПараметр("ОЛ", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ОрганизацияЛогсис());

	//ВыборкаВыплаты = Запрос.Выполнить().Выбрать();  
	ТаблицаВыплаты = Запрос.Выполнить().Выгрузить();
	
	ТаблицаДублейВыплаты = ТаблицаВыплаты.Скопировать();
	ТаблицаДублейВыплаты.Очистить();
	ПервыйСотрудникДубль = Неопределено;
	
	Для Каждого Стр из ТаблицаВыплаты Цикл 
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ФИО", 			Стр.ФИО);
		СтруктураПоиска.Вставить("СуммаСНалогом", 	Стр.СуммаСНалогом);
		МассивВыплаты = ТаблицаВыплаты.НайтиСтроки(СтруктураПоиска); 
		Если ПервыйСотрудникДубль <> Стр.ФИО И МассивВыплаты.Количество() > 1 И ТаблицаДублейВыплаты.Найти(Стр.НомерСтроки, "НомерСтроки") = Неопределено Тогда 
			ПервыйСотрудникДубль = Стр.Фио;
			Для каждого Дубль Из МассивВыплаты Цикл
				Если Дубль.НомерСтроки <> Стр.НомерСтроки И ТаблицаДублейВыплаты.Найти(Дубль.НомерСтроки, "НомерСтроки") = Неопределено Тогда
					НоваяСтрока = ТаблицаДублейВыплаты.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Дубль);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ДатаФормирования", 		ДатаФормирования);
	СтруктураЗаголовка.Вставить("НомерДоговора", 			НомерДоговора);
	СтруктураЗаголовка.Вставить("НаименованиеОрганизации", 	НаименованиеОрганизации);
	СтруктураЗаголовка.Вставить("ИНН",						ИНН);
	СтруктураЗаголовка.Вставить("РасчетныйСчетОрганизации", РасчетныйСчетОрганизации);
	СтруктураЗаголовка.Вставить("БИК", 						БИК);
	СтруктураЗаголовка.Вставить("ИдПервичногоДокумента", 	ИдПервичногоДокумента);
	
	СтруктураВозврата = ПолучитьЗаписьХМЛ(СтруктураЗаголовка, ТаблицаВыплаты, ТаблицаДублейВыплаты);
	
	Потоки = Новый Массив;  
	Потоки.Добавить(Новый Структура("Заказчик, Поток", СтруктураВозврата.Заказчик,СтруктураВозврата.ПотокХМЛ));
	
	Для Каждого Стр из ТаблицаДублейВыплаты Цикл 
	
		СтруктураВозврата = ПолучитьЗаписьХМЛ(СтруктураЗаголовка, Стр);
		Потоки.Добавить(Новый Структура("Заказчик, Поток", СтруктураВозврата.Заказчик,СтруктураВозврата.ПотокХМЛ));
				
	КонецЦикла;
	
	Возврат Потоки;
         	
КонецФункции  

&НаСервере
Функция ПолучитьЗаписьХМЛ(Знач СтруктураЗаголовка, Знач ТаблицаВыплаты, ТаблицаДублей = Неопределено, ТипБанка = "Альфа")
		
	Заказчик = Неопределено;
	СуммаИтого = 0;
		
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("windows-1251");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СчетаПК");
	ЗаписьXML.ЗаписатьАтрибут("ДатаФормирования", 			СтруктураЗаголовка.ДатаФормирования);
	ЗаписьXML.ЗаписатьАтрибут("НомерДоговора", 				СтруктураЗаголовка.НомерДоговора);
	ЗаписьXML.ЗаписатьАтрибут("НаименованиеОрганизации", 	СтруктураЗаголовка.НаименованиеОрганизации);
	ЗаписьXML.ЗаписатьАтрибут("ИНН", 						СтруктураЗаголовка.ИНН);
	ЗаписьXML.ЗаписатьАтрибут("РасчетныйСчетОрганизации", 	СтруктураЗаголовка.РасчетныйСчетОрганизации);
	ЗаписьXML.ЗаписатьАтрибут("БИК", 						СтруктураЗаголовка.БИК);
	ЗаписьXML.ЗаписатьАтрибут("ИдПервичногоДокумента", 		СтруктураЗаголовка.ИдПервичногоДокумента);
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЗачислениеЗарплаты");          
	
	Если ТипЗнч(ТаблицаВыплаты) = Тип("СтрокаТаблицыЗначений") Тогда 
		СтрТаблицаВыплаты = ТаблицаВыплаты;
		ТаблицаВыплаты = Новый Массив;
		ТаблицаВыплаты.Добавить(СтрТаблицаВыплаты);
	КонецЕсли;
	
	НомерСтроки = 0;
		
	Для Каждого Стр из ТаблицаВыплаты Цикл 
		
		Если ТаблицаДублей <> Неопределено И ТаблицаДублей.Найти(Стр.НомерСтроки, "НомерСтроки") <> Неопределено Тогда 
			Продолжить;
		КонецЕсли;
		
		ВыборкаВыплаты = Стр; 
		
		Если Заказчик<>ВыборкаВыплаты.Заказчик Тогда
			Заказчик = ВыборкаВыплаты.Заказчик;
		КонецЕсли;   
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Сотрудник");
		НомерСтроки = НомерСтроки + 1;
		//ЗаписьXML.ЗаписатьАтрибут("НПП", Формат(ВыборкаВыплаты.Номерстроки, "ЧРД=.; ЧГ="));
		ЗаписьXML.ЗаписатьАтрибут("НПП", Формат(Номерстроки, "ЧРД=.; ЧГ="));

			ФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(ВыборкаВыплаты.ФИО);
			ЗаписьXML.ЗаписатьНачалоЭлемента("Фамилия");
				ЗаписьXML.ЗаписатьТекст(ФИО.Фамилия);
				ЗаписьXML.ЗаписатьКонецЭлемента();

			ЗаписьXML.ЗаписатьНачалоЭлемента("Имя");
				ЗаписьXML.ЗаписатьТекст(ФИО.Имя);
				ЗаписьXML.ЗаписатьКонецЭлемента();

			ЗаписьXML.ЗаписатьНачалоЭлемента("Отчество");
				ЗаписьXML.ЗаписатьТекст(?(ФИО.Отчество=Неопределено, "", ФИО.Отчество));
				ЗаписьXML.ЗаписатьКонецЭлемента();

			ЗаписьXML.ЗаписатьНачалоЭлемента("ОтделениеБанка");
				ЗаписьXML.ЗаписатьТекст(ВыборкаВыплаты.ОтделениеБанка);
				ЗаписьXML.ЗаписатьКонецЭлемента();

			ЗаписьXML.ЗаписатьНачалоЭлемента("ФилиалОтделенияБанка");
				ЗаписьXML.ЗаписатьТекст(ВыборкаВыплаты.ФилиалОтделенияБанка);
				ЗаписьXML.ЗаписатьКонецЭлемента();

			ЗаписьXML.ЗаписатьНачалоЭлемента("ЛицевойСчет");
				ЗаписьXML.ЗаписатьТекст(ВыборкаВыплаты.НомерСчета);
				ЗаписьXML.ЗаписатьКонецЭлемента();

			ЗаписьXML.ЗаписатьНачалоЭлемента("Сумма");
				ЗаписьXML.ЗаписатьТекст(Формат(ВыборкаВыплаты.СуммаСНалогом, "ЧРД=.; ЧГ="));
				ЗаписьXML.ЗаписатьКонецЭлемента();   
			СуммаИтого = СуммаИтого + ВыборкаВыплаты.СуммаСНалогом;

			ЗаписьXML.ЗаписатьНачалоЭлемента("ОбщаяСуммаУдержаний");
				ЗаписьXML.ЗаписатьТекст(Формат(ВыборкаВыплаты.СуммаУдержаний, "ЧРД=.; ЧГ="));
				ЗаписьXML.ЗаписатьКонецЭлемента();
		
		//++ Ким Виктор 16.05.2025
		//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-16481
		Если ТипБанка = "Сбер" Тогда 
			ЗаписьXML.ЗаписатьНачалоЭлемента("КодВалютнойОперации");
			ЗаписьXML.ЗаписатьТекст(ВыборкаВыплаты.КодВалютнойОперации);
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("НомерИндивидуальногоДоговора");
			ЗаписьXML.ЗаписатьТекст(Формат(ВыборкаВыплаты.НомерИндивидуальногоДоговора, "ЧДЦ=0; ЧГ="));
			ЗаписьXML.ЗаписатьКонецЭлемента();
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("ДатаИндивидуальногоДоговора");
			ЗаписьXML.ЗаписатьТекст(Формат(ВыборкаВыплаты.ДатаИндивидуальногоДоговора, "ДФ=dd.MM.yyyy"));
			ЗаписьXML.ЗаписатьКонецЭлемента();
		КонецЕсли;
		
		ЗаписьXML.ЗаписатьКонецЭлемента();   //СОТР 
		//-- Ким Виктор 16.05.2025
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьКонецЭлемента();   //ЗачислениеЗарплаты
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("КонтрольныеСуммы");          

		ЗаписьXML.ЗаписатьНачалоЭлемента("КоличествоЗаписей"); 
		Если ТаблицаДублей <> Неопределено Тогда 
			ЗаписьXML.ЗаписатьТекст(Формат(ТаблицаВыплаты.Количество() - ТаблицаДублей.Количество(), "ЧРД=.; ЧГ="));
		Иначе
			ЗаписьXML.ЗаписатьТекст(Формат(ТаблицаВыплаты.Количество(), "ЧРД=.; ЧГ="));
		КонецЕсли;
		
		
		ЗаписьXML.ЗаписатьКонецЭлемента();    
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаИтого");
		ЗаписьXML.ЗаписатьТекст(Формат(СуммаИтого, "ЧРД=.; ЧГ="));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();   //КонтрольныеСуммы

	ЗаписьXML.ЗаписатьКонецЭлемента();   //СчетаПК
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("Заказчик", Заказчик);
	СтруктураВозврата.Вставить("ПотокХМЛ", ЗаписьXML.Закрыть()); 
	
	Возврат СтруктураВозврата;
	
КонецФункции
//-- Ким Виктор 27.06.2024

&НаСервере
Функция СформироватьXMLAlfaНаСервере(Реестр)    
	
	ЗаписьXML = Новый ЗаписьXML;
	
	ЗаписьXML.УстановитьСтроку("windows-1251");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	///получение данных   
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Логс_РеестрВыплатСамозанятым.Дата КАК Дата,
	               |	Логс_РеестрВыплатСамозанятым.Организация.Наименование КАК НаименованиеОрганизации,
	               |	Логс_РеестрВыплатСамозанятым.Организация.ИНН КАК ИНН,
	               |	isnull(Логс_РеестрВыплатСамозанятым.БанковскийСчет.НомерСчета, """") КАК НомерСчета,
	               |	isnull(Логс_РеестрВыплатСамозанятым.БанковскийСчет.БИКБанка, """") КАК БИК,
	               |	Логс_РеестрВыплатСамозанятым.БанковскийСчет.Логс_НомерДоговора КАК НомерДоговора
	               |ИЗ
	               |	Документ.Логс_РеестрВыплатСамозанятым КАК Логс_РеестрВыплатСамозанятым
	               |ГДЕ
	               |	Логс_РеестрВыплатСамозанятым.Ссылка = &Реестр";     
	Запрос.УстановитьПараметр("Реестр", Реестр);
	
	ВыборкаРеестр = Запрос.Выполнить().Выбрать();  
	Если НЕ ВыборкаРеестр.Следующий() Тогда
		Возврат "";
	КонецЕсли;
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("СчетаПК");
	ЗаписьXML.ЗаписатьАтрибут("ДатаФормирования", Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd"));//Формат(ВыборкаРеестр.Дата, "ДФ=yyyy-MM-dd"));
	ЗаписьXML.ЗаписатьАтрибут("НомерДоговора", ВыборкаРеестр.НомерДоговора);
	ЗаписьXML.ЗаписатьАтрибут("НаименованиеОрганизации", ВыборкаРеестр.НаименованиеОрганизации);
	ЗаписьXML.ЗаписатьАтрибут("ИНН", ВыборкаРеестр.ИНН);
	ЗаписьXML.ЗаписатьАтрибут("РасчетныйСчетОрганизации", ВыборкаРеестр.НомерСчета);
	ЗаписьXML.ЗаписатьАтрибут("БИК", ВыборкаРеестр.БИК);
	ЗаписьXML.ЗаписатьАтрибут("ИдПервичногоДокумента", Строка(Реестр.УникальныйИдентификатор()));

	////получение данных 2
	ЗаписьXML.ЗаписатьНачалоЭлемента("ЗачислениеЗарплаты");          
	Запрос.Текст = "ВЫБРАТЬ
	               |	Выплаты.НомерСтроки КАК НомерСтроки,
	               |	Выплаты.Контрагент.НаименованиеПолное КАК ФИО,
	               |	Выплаты.Договор.БанковскийСчетКонтрагента.НомерСчета КАК НомерСчета,
	               |	Выплаты.СуммаСНалогом КАК СуммаСНалогом,
	               |	Выбор Когда Выплаты.Договор.Организация = &ОЛ Тогда Выплаты.Договор.Логс_ЗаказчикСЗ Иначе """" Конец КАК Заказчик,
	               |	0 КАК СуммаУдержаний,
	               |	""0000"" КАК ОтделениеБанка,
	               |	"""" КАК ФилиалОтделенияБанка
	               |ИЗ
	               |	Документ.Логс_РеестрВыплатСамозанятым.Выплаты КАК Выплаты
	               |ГДЕ
	               |	Выплаты.Ссылка = &Реестр
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	Запрос.УстановитьПараметр("ОЛ", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ОрганизацияЛогсис());

	ВыборкаВыплаты = Запрос.Выполнить().Выбрать();  
	
	Заказчик = Неопределено;
	СуммаИтого = 0;  
	
	//цикл 
	Пока ВыборкаВыплаты.Следующий() Цикл
		Если Заказчик<>ВыборкаВыплаты.Заказчик Тогда
			Заказчик = ВыборкаВыплаты.Заказчик;
		КонецЕсли;   
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("Сотрудник");
		ЗаписьXML.ЗаписатьАтрибут("НПП", Формат(ВыборкаВыплаты.Номерстроки, "ЧРД=.; ЧГ="));

			ФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(ВыборкаВыплаты.ФИО);
			ЗаписьXML.ЗаписатьНачалоЭлемента("Фамилия");
				ЗаписьXML.ЗаписатьТекст(ФИО.Фамилия);
				ЗаписьXML.ЗаписатьКонецЭлемента();

			ЗаписьXML.ЗаписатьНачалоЭлемента("Имя");
				ЗаписьXML.ЗаписатьТекст(ФИО.Имя);
				ЗаписьXML.ЗаписатьКонецЭлемента();

			ЗаписьXML.ЗаписатьНачалоЭлемента("Отчество");
				ЗаписьXML.ЗаписатьТекст(?(ФИО.Отчество=Неопределено, "", ФИО.Отчество));
				ЗаписьXML.ЗаписатьКонецЭлемента();

			ЗаписьXML.ЗаписатьНачалоЭлемента("ОтделениеБанка");
				ЗаписьXML.ЗаписатьТекст(ВыборкаВыплаты.ОтделениеБанка);
				ЗаписьXML.ЗаписатьКонецЭлемента();

			ЗаписьXML.ЗаписатьНачалоЭлемента("ФилиалОтделенияБанка");
				ЗаписьXML.ЗаписатьТекст(ВыборкаВыплаты.ФилиалОтделенияБанка);
				ЗаписьXML.ЗаписатьКонецЭлемента();

			ЗаписьXML.ЗаписатьНачалоЭлемента("ЛицевойСчет");
				ЗаписьXML.ЗаписатьТекст(ВыборкаВыплаты.НомерСчета);
				ЗаписьXML.ЗаписатьКонецЭлемента();

			ЗаписьXML.ЗаписатьНачалоЭлемента("Сумма");
				ЗаписьXML.ЗаписатьТекст(Формат(ВыборкаВыплаты.СуммаСНалогом, "ЧРД=.; ЧГ="));
				ЗаписьXML.ЗаписатьКонецЭлемента();   
			СуммаИтого = СуммаИтого + ВыборкаВыплаты.СуммаСНалогом;

			ЗаписьXML.ЗаписатьНачалоЭлемента("ОбщаяСуммаУдержаний");
				ЗаписьXML.ЗаписатьТекст(Формат(ВыборкаВыплаты.СуммаУдержаний, "ЧРД=.; ЧГ="));
				ЗаписьXML.ЗаписатьКонецЭлемента();
		ЗаписьXML.ЗаписатьКонецЭлемента();   //СОТР 
	КонецЦикла;
	//конеццикла
	
	
	ЗаписьXML.ЗаписатьКонецЭлемента();   //ЗачислениеЗарплаты
	
	ЗаписьXML.ЗаписатьНачалоЭлемента("КонтрольныеСуммы");          

		ЗаписьXML.ЗаписатьНачалоЭлемента("КоличествоЗаписей");
		ЗаписьXML.ЗаписатьТекст(Формат(ВыборкаВыплаты.Количество(), "ЧРД=.; ЧГ="));
		ЗаписьXML.ЗаписатьКонецЭлемента();    
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("СуммаИтого");
		ЗаписьXML.ЗаписатьТекст(Формат(СуммаИтого, "ЧРД=.; ЧГ="));
		ЗаписьXML.ЗаписатьКонецЭлемента();
	
	ЗаписьXML.ЗаписатьКонецЭлемента();   //КонтрольныеСуммы

	ЗаписьXML.ЗаписатьКонецЭлемента();   //СчетаПК
	
	ПотокХМЛ = ЗаписьXML.Закрыть();
	
	Потоки = Новый Массив;  
	Потоки.Добавить(Новый Структура("Заказчик, Поток",Заказчик,ПотокХМЛ));

	Возврат Потоки;
	
КонецФункции

#КонецОбласти

//#Область CSV_Райффайзен

////Неактуальная процедура
//&НаКлиенте
//Процедура ЭкспортCSVРайффайзен(Команда)
//	
//	Если Модифицированность Тогда
//		Предупреждение("Для экспорта реестра необходимо записать документ");
//		Возврат;
//	КонецЕсли;
//	
//	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
//	Диалог.Фильтр = "*.csv|*.csv";
//	Диалог.Заголовок = НСтр("Сохранение файла");
//	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаCSVЗавершение_Райффайзен", ЭтотОбъект);
//	Диалог.Показать(ОповещениеЗавершения);
//		
//КонецПроцедуры

//&НаКлиенте
//Процедура ВыборФайлаCSVЗавершение_Райффайзен(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
//	
//	Если ВыбранныеФайлы <> Неопределено Тогда
//		ПутьКФайлу = ВыбранныеФайлы[0];
//	Иначе
//		Возврат;
//	КонецЕсли;
//	
//	Потоки = СформироватьПотокиНаСервере_Райффайзен(Объект.Ссылка);
//	
//	Для Каждого ДанныеПотока из Потоки Цикл
//		Если ДанныеПотока.Заказчик = "" Тогда
//			ИмяФайла = ПутьКФайлу;
//		Иначе
//			ИмяФайла = ?(СтрЗаканчиваетсяНа(ПутьКФайлу, ".csv"),
//							Лев(ПутьКФайлу, СтрДлина(ПутьКФайлу)-3) ,ПутьКФайлу) 
//					+"("+ДанныеПотока.Заказчик+").csv";
//		КонецЕсли;
//		Файл = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.ANSI);
//		Файл.ЗаписатьСтроку(ДанныеПотока.Поток);
//		Файл.Закрыть();
//	КонецЦикла;
//	
//	//Предупреждение("Файл сохранен");
//	ОбщегоНазначенияКлиент.СообщитьПользователю("Файл сохранен");
//	
//КонецПроцедуры  

//&НаСервере
//Функция СформироватьПотокиНаСервере_Райффайзен(Реестр)  
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	СотрудникиДополнительныеРеквизиты.Ссылка КАК Сотрудник,
//	               |	СотрудникиДополнительныеРеквизиты.Ссылка.ФизическоеЛицо.Наименование КАК Наименование,
//	               |	СотрудникиДополнительныеРеквизиты.Ссылка.ФизическоеЛицо КАК ФизическоеЛицо,
//	               |	КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Подразделение,
//	               |	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
//	               |ПОМЕСТИТЬ втКадровыеДанные
//	               |ИЗ
//	               |	Справочник.Сотрудники.ДополнительныеРеквизиты КАК СотрудникиДополнительныеРеквизиты
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, ) КАК КадроваяИсторияСотрудниковСрезПоследних
//	               |		ПО СотрудникиДополнительныеРеквизиты.Ссылка = КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
//	               |			И СотрудникиДополнительныеРеквизиты.Ссылка.ФизическоеЛицо = КадроваяИсторияСотрудниковСрезПоследних.ФизическоеЛицо
//	               |ГДЕ
//	               |	СотрудникиДополнительныеРеквизиты.Свойство = &Свойство
//	               |	И СотрудникиДополнительныеРеквизиты.Значение = &Значение
//	               |	И СотрудникиДополнительныеРеквизиты.Ссылка.Логс_Самозанятый
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	Выплаты.НомерСтроки КАК НомерСтроки,
//	               |	Выплаты.Контрагент.НаименованиеПолное КАК ФИО,
//	               |	Выплаты.Договор.БанковскийСчетКонтрагента.НомерСчета КАК НомерСчета,
//	               |	Выплаты.СуммаСНалогом КАК СуммаСНалогом,
//	               |	ВЫБОР
//	               |		КОГДА Выплаты.Договор.Организация = &ОЛ
//	               |			ТОГДА Выплаты.Договор.Логс_ЗаказчикСЗ
//	               |		ИНАЧЕ """"
//	               |	КОНЕЦ КАК Заказчик,
//	               |	0 КАК СуммаУдержаний,
//	               |	втКадровыеДанные.ФизическоеЛицо.Фамилия КАК Фамилия,
//	               |	втКадровыеДанные.ФизическоеЛицо.Имя КАК Имя,
//	               |	втКадровыеДанные.ФизическоеЛицо.Отчество КАК Отчество,
//	               |	втКадровыеДанные.Подразделение КАК Подразделение,
//	               |	втКадровыеДанные.Должность КАК Должность,
//	               |	втКадровыеДанные.ФизическоеЛицо.ДатаРождения КАК ДатаРождения,
//	               |	Выплаты.Договор.БанковскийСчетКонтрагента.БИКБанка КАК БИКБанка,
//	               |	втКадровыеДанные.Сотрудник.Код КАК ТабельныйНомер
//	               |ИЗ
//	               |	Документ.Логс_РеестрВыплатСамозанятым.Выплаты КАК Выплаты
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ втКадровыеДанные КАК втКадровыеДанные
//	               |		ПО Выплаты.Партнер.Наименование = втКадровыеДанные.Наименование
//	               |ГДЕ
//	               |	Выплаты.Ссылка = &Реестр
//	               |	И Выплаты.Договор.БанковскийСчет.Банк = &Банк
//	               |
//	               |УПОРЯДОЧИТЬ ПО
//	               |	НомерСтроки";
//	Запрос.УстановитьПараметр("ОЛ", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ОрганизацияЛогсис());
//	//Обмен с CRM (Сотрудники) (ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения)
//	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьСсылку(Новый УникальныйИдентификатор("dbf78901-85ca-11e9-80b9-000c29f360b4")));
//	Запрос.УстановитьПараметр("Значение", Истина);                                                                                
//	//Подставим банк из констант
//	Запрос.УстановитьПараметр("Банк",Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ПолучитьЗначениеКонстантыЛогс("БанкРайффайзен"));
//	Запрос.УстановитьПараметр("Реестр", Реестр);

//	Выборка = Запрос.Выполнить().Выбрать();
//		
//	Заказчик = Неопределено;
//	//Поток = "";
//	РазделительЗначений = ";";
//	РазделительСтрок = Символы.ПС;
//	
//	Потоки = Новый Массив;
//	Индекс = -1;  
//	НомерСтрока = 0;
//	
//	Пока Выборка.Следующий() Цикл
//		
//		Если Заказчик<>Выборка.Заказчик Тогда
//			//Если Заказчик = Неопределено Тогда
//			Заказчик = Выборка.Заказчик;
//			Потоки.Добавить(Новый Структура("Заказчик, Поток",Заказчик,""));
//			Индекс = Индекс+1;
//			Первая = Истина;
//			Потоки[Индекс].Поток = Потоки[Индекс].Поток + СоздатьЗаголовкиCSV(РазделительЗначений) + РазделительСтрок;
//			
//		КонецЕсли;
//		
//		Если НЕ Первая Тогда
//			Потоки[Индекс].Поток = Потоки[Индекс].Поток + РазделительСтрок;
//		Иначе
//			Первая = Ложь;
//		КонецЕсли;
//		
//		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Выборка.ТабельныйНомер + РазделительЗначений;
//		
//		//ФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Выборка.ФИО);
//		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Выборка.Фамилия + РазделительЗначений + Выборка.Имя + РазделительЗначений + Выборка.Отчество + РазделительЗначений;
//		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy") + РазделительЗначений;
//		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Выборка.Должность + РазделительЗначений + Выборка.Подразделение + РазделительЗначений;
//		
//		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Выборка.НомерСчета + РазделительЗначений;
//		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Выборка.БикБанка + РазделительЗначений;
//		
//		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Формат(Выборка.СуммаСНалогом, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=") + РазделительЗначений;
//		
//		//Номер карты
//		Потоки[Индекс].Поток = Потоки[Индекс].Поток + "" + РазделительЗначений; 
//				
//		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Формат(0, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=") + РазделительЗначений;
//		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Формат(0, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=") + РазделительЗначений;
//		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Формат(0, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=");
//						
//	КонецЦикла;
//	
//	Возврат Потоки;
//    
//КонецФункции     


//#Область Формат_CSV_РайффайзенБанк

////Таб. №	
////Фамилия	
////Имя	
////Отчество	
////Дата рождения	
////Должность	
////Подразделение	
////Счет получателя	
////БИК	
////Сумма средств к зачислению на счет получателя	
////Номер карты	
////% конвертации в USD	
////% конвертации в EUR	
////Удержанная сумма в RUB  

//#КонецОбласти
//&НаСервере
//Функция СоздатьЗаголовкиCSV(разделитель)
//    
//    Массив = Новый Массив;
//	Массив.Добавить("Таб. №");
//	Массив.Добавить("Фамилия");
//	Массив.Добавить("Имя");
//	Массив.Добавить("Отчество");
//	Массив.Добавить("Дата рождения");
//	Массив.Добавить("Должность");
//	Массив.Добавить("Подразделение");
//	Массив.Добавить("Счет получателя");
//	Массив.Добавить("БИК");
//	Массив.Добавить("Сумма средств к зачислению на счет получателя");
//	Массив.Добавить("Номер карты");
//	Массив.Добавить("% конвертации в USD");
//	Массив.Добавить("% конвертации в EUR");
//	Массив.Добавить("Удержанная сумма в RUB");
//	
//    стрКолонки = "";
//    Для каждого колонка Из Массив Цикл
//        
//        Если СтрДлина(стрКолонки)>0 Тогда
//            стрКолонки = стрКолонки + разделитель;
//        КонецЕсли;    
//        
//        стрКолонки = стрКолонки + колонка;
//        
//    КонецЦикла; 
//    
//    Возврат стрКолонки;
//    
//КонецФункции

//	
//#КонецОбласти

#Область ВыгрузитьПоAPI_РайффайзенБанк

&НаСервере
Процедура ВыгрузитьВРайффайзенБанкНаСервере()
	ПроверкаОтправки = Логс_ИнтеграцияРайффайзен.ПроверкаОтправки(Объект.Ссылка);
	Если НЕ ПроверкаОтправки Тогда 
		Если Объект.Выплаты.Количество() = 1 Тогда 
			Логс_ИнтеграцияРайффайзен.ОтправитьДанныеПоАПИРайффайзенОдиночнаяВыплата(Объект.Ссылка);
		Иначе
			//Логс_ИнтеграцияРайффайзен.ОтправитьДанныеПоАПИРайффайзенПакетом(Объект.Ссылка);
		КонецЕсли; 
		
	иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Повторная отправка данных запрещена!"); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьВРайффайзенБанк(Команда)
	Если Модифицированность Тогда 
		Записать();
	КонецЕсли;
	
	ВыгрузитьВРайффайзенБанкНаСервере();
КонецПроцедуры

#КонецОбласти

#Область РазделитьДокументПоЭкселю
//++ Ким Виктор 24.10.2024
//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-14756

&НаКлиенте
Процедура РазделитьПоЭкселю(Команда)
	
	Если Модифицированность Тогда
		Предупреждение("Для разделения реестра необходимо записать документ");
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Фильтр = "Excel файлы(*.xls;*.xlsx)|*.xls;*.xlsx";
	Диалог.Заголовок = НСтр("Открытие файла");
	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаXLSЗаверешение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);
		
КонецПроцедуры 

&НаКлиенте
Процедура ВыборФайлаXLSЗаверешение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
	Иначе
		Возврат;
	КонецЕсли;   
	
	Оповещение = Новый ОписаниеОповещения("ЗагрузитьЗавершение", ЭтотОбъект);
	НачатьПомещениеФайла(Оповещение,, ПутьКФайлу, Ложь); 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗавершение(Результат, Адрес, ПомещаемыйФайл, ДополнительныеПараметры) Экспорт
	
	ЗагрузитьИзЭксельНаСервере(Адрес, ПомещаемыйФайл);	
	ЭтаФорма.Прочитать();
	//ЭтаФорма.ОбновитьОтображениеДанных(); 
			
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьИзЭксельНаСервере(Адрес, ИмяФайла)  
		
	ДвоичныеДанные = ПолучитьИЗВременногоХранилища(Адрес);
	Расширение = ОбщегоНазначенияКлиентСервер.РасширениеБезТочки(ОбщегоНазначенияКлиентСервер.ПолучитьРасширениеИмениФайла(ИмяФайла));
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла(Расширение);
	ДвоичныеДанные.Записать(ИмяВременногоФайла);
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.Прочитать(ИмяВременногоФайла, СпособЧтенияЗначенийТабличногоДокумента.Текст); 
	
	УдалитьФайлы(ИмяВременногоФайла);
	
	Построитель = Новый ПостроительОтчета;
	Построитель.ИсточникДанных = Новый ОписаниеИсточникаДанных(ТабличныйДокумент.Область(15, 2, ТабличныйДокумент.ВысотаТаблицы, ТабличныйДокумент.ШиринаТаблицы));
	Построитель.Выполнить();
	РезультатЧтения = Построитель.Результат.Выгрузить();
		
	ТаблицаОшибочных = СоответсвиеФИОКонтрагенту(РезультатЧтения);
		
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ТаблицаВыплаты = ДокОбъект.Выплаты;
	МассивУдаляемых = Новый Массив;
	КоличествоСтрокДО =  ТаблицаВыплаты.Количество();
	СуммаДо = Объект.СуммаДокумента;
	
	ТаблицаКопия = ТаблицаВыплаты.Выгрузить();
	ТаблицаКопия.Очистить();
	
	ЕстьИзменения = Ложь;
	
	Для Каждого Стр из ТаблицаОшибочных Цикл 
		
		СтрукутраПоиска = Новый Структура;
		СтрукутраПоиска.Вставить("НомерСтроки", Число(Стр.НомерСтроки));
		СтрукутраПоиска.Вставить("Партнер", стр.Партнер); 
		СтрукутраПоиска.Вставить("Контрагент", стр.Контрагент);
		МассивНайденных  = ТаблицаВыплаты.НайтиСтроки(СтрукутраПоиска);
		
		Для Каждого Элем из МассивНайденных Цикл 
			
			Если ТаблицаКопия.Найти(Число(Стр.НомерСтроки), "НомерСтроки") = Неопределено 
				И Элем.НомерСтроки = Число(Стр.НомерСтроки) Тогда
				НоваяСтрока = ТаблицаКопия.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Элем); 
				
				Если МассивУдаляемых.Найти(Элем) = Неопределено Тогда 
					МассивУдаляемых.Добавить(Элем);
				КонецЕсли;	
			КонецЕсли;
		КонецЦикла;
				
	КонецЦикла;
	
	СоздатьДокументРеестрНаОсновеОшибочных(ТаблицаКопия);
	
	Для Каждого Найденный Из МассивУдаляемых Цикл
		
		Если Не ЕстьИзменения  Тогда 
			ЕстьИзменения = Истина;
		КонецЕсли;
	
		ТаблицаВыплаты.Удалить(Найденный);
	КонецЦикла;
	
	//СуммаПосле = Объект.СуммаДокумента;
	//КоличествоСтрокПосле = ТаблицаВыплаты.Количество();	
	
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");   
	Объект.Комментарий = "Количество строк до: " + КоличествоСтрокДО + ". " + "Сумма до: " + СуммаДо;
	ЭтаФорма.Записать();     
		
КонецПроцедуры

&НаСервере
Процедура СоздатьДокументРеестрНаОсновеОшибочных(ТаблицаКопия)
	
	РеестрНовый = Документы.Логс_РеестрВыплатСамозанятым.СоздатьДокумент();
	ЗаполнитьЗначенияСвойств(РеестрНовый, Объект,, "Выплаты, Проведен, Номер, СуммаДокумента");
	Для Каждого Стр из ТаблицаКопия Цикл 
		НоваяСтрока = РеестрНовый.Выплаты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Стр);
	КонецЦикла;
	РеестрНовый.Комментарий = "Создан на основании: " + Объект.Ссылка;
	//РеестрНовый.ПересчитатьНалогВСтроках();
	РеестрНовый.Записать(РежимЗаписиДокумента.Проведение); 
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Создан документ " + РеестрНовый);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоответсвиеФИОКонтрагенту(ТаблицаИзЭкселя)
	
	Запрос = Новый Запрос;
	Запрос.Текст =  ( "ВЫБРАТЬ
	                  |	ТаблицаИзЭкселя.ФИОРаботника КАК ФИОРаботника,
	                  |	ТаблицаИзЭкселя.__ КАК НомерСтроки,
	                  |	ТаблицаИзЭкселя.Сумма_Перевода КАК СуммаПеревода,
	                  |	ТаблицаИзЭкселя._ТекущегоСчетаВРублях_ВИностаннойВалюте КАК _ТекущегоСчетаВРублях_ВИностаннойВалюте,
	                  |	ТаблицаИзЭкселя.ЧекФНС КАК ЧекФНС
	                  |ПОМЕСТИТЬ ТаблицаЭкселя
	                  |ИЗ
	                  |	&ТаблицаИзЭкселя КАК ТаблицаИзЭкселя
	                  |;
	                  |
	                  |////////////////////////////////////////////////////////////////////////////////
	                  |ВЫБРАТЬ
	                  |	ТаблицаЭкселя.ФИОРаботника КАК ФИОРаботника,
	                  |	ТаблицаЭкселя.НомерСтроки КАК НомерСтроки,
	                  |	ТаблицаЭкселя.СуммаПеревода КАК СуммаПеревода,
	                  |	ТаблицаЭкселя._ТекущегоСчетаВРублях_ВИностаннойВалюте КАК _ТекущегоСчетаВРублях_ВИностаннойВалюте,
	                  |	ТаблицаЭкселя.ЧекФНС КАК ЧекФНС,
	                  |	Контрагенты.Ссылка КАК Контрагент,
	                  |	Контрагенты.Партнер КАК Партнер
	                  |ИЗ
	                  |	ТаблицаЭкселя КАК ТаблицаЭкселя
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	                  |		ПО ТаблицаЭкселя.ФИОРаботника = Контрагенты.Наименование
	                  |ГДЕ
	                  |	ТаблицаЭкселя.ЧекФНС = ""ОШИБКА""" ) ;
	Запрос.УстановитьПараметр("ТаблицаИзЭкселя", ТаблицаИзЭкселя);
	Возврат Запрос.Выполнить().Выгрузить();
 
КонецФункции  

#КонецОбласти
//-- Ким Виктор 24.10.2024

//++ Ким Виктор 02.11.2024
//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-14868
#Область ВыгрузкаТинькофф
&НаСервере
Функция ЭкспортXLSXТинькоффНаСервере(Реестр)
	
	Запрос = новый Запрос;
	Запрос.Текст =  ("ВЫБРАТЬ
	                 |	МИНИМУМ(Логс_РеестрВыплатСамозанятымВыплаты.НомерСтроки) КАК НомерСтроки,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Контрагент.НаименованиеПолное КАК ФИО,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Договор.БанковскийСчетКонтрагента.НомерСчета КАК НомерСчета,
	                 |	СУММА(Логс_РеестрВыплатСамозанятымВыплаты.СуммаСНалогом) КАК Сумма,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Договор.БанковскийСчетКонтрагента.Банк КАК БанкКонтрагента
	                 |ИЗ
	                 |	Документ.Логс_РеестрВыплатСамозанятым.Выплаты КАК Логс_РеестрВыплатСамозанятымВыплаты
	                 |ГДЕ
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка = &Ссылка
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Договор.БанковскийСчетКонтрагента.НомерСчета,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Контрагент.НаименованиеПолное,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Договор.БанковскийСчетКонтрагента.Банк
	                 |
	                 |УПОРЯДОЧИТЬ ПО
	                 |	НомерСтроки") ;
	Запрос.УстановитьПараметр("Ссылка", Реестр);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабДок = Новый ТабличныйДокумент;
	ОбъектДокумент =  РеквизитФормыВЗначение("Объект"); 
	Макет = ОбъектДокумент.ПолучитьМакет("МакетВыгрузкиТинькофф");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ТабДок.Вывести(ОбластьЗаголовок);
	Номерстроки = 0;
	Пока Выборка.Следующий() Цикл 
		НомерСтроки = Номерстроки + 1;
		СтруктураПотока = ПолучитьСтруктуруПотока();
		ФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Выборка.ФИО);
		ЗаполнитьЗначенияСвойств(СтруктураПотока, Выборка);
		ЗаполнитьЗначенияСвойств(СтруктураПотока, ФИО, "Фамилия, Имя, Отчество");
		СтруктураПотока.НомерСтроки = НомерСтроки;
		СтруктураПотока.НазначениеПлатежа = "Выплата за выполненные работы по реестру: " + Реестр.Номер + " от " + Формат(Реестр.Дата, "ДФ=dd.MM.yyyy");
						
		ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
		ОбластьСтрока.Параметры.Заполнить(СтруктураПотока);
		ТабДок.Вывести(ОбластьСтрока);
		      	
	КонецЦикла;
	
	Возврат ТабДок;

КонецФункции        

&НаКлиенте
Процедура ЭкспортXLSXТинькофф(Команда)
	
	Если Модифицированность Тогда
		Предупреждение("Для экспорта реестра необходимо записать документ");
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр			= "Документ Excel (*.xlsx)|*.xlsx";
	Диалог.Расширение		= "xlsx";
	Диалог.Заголовок = НСтр("Сохранение файла");
	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаXLSXЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);

КонецПроцедуры   

&НаКлиенте
Процедура ВыборФайлаXLSXЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
	Иначе
		Возврат;
	КонецЕсли;
	
	ТабДок = ЭкспортXLSXТинькоффНаСервере(Объект.Ссылка);
	ТабДок.Записать(ПутьКФайлу,ТипФайлаТабличногоДокумента.XLSX);
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Файл сохранен");
	
КонецПроцедуры  

&НаСервере
Функция ПолучитьСтруктуруПотока()
	
	СтруктураПотока = Новый Структура;
	СтруктураПотока.Вставить("НомерСтроки");
	СтруктураПотока.Вставить("Фамилия");
	СтруктураПотока.Вставить("Имя");
	СтруктураПотока.Вставить("Отчество");
	СтруктураПотока.Вставить("НомерСчета");
	СтруктураПотока.Вставить("Сумма");
	СтруктураПотока.Вставить("НазначениеПлатежа");
	СтруктураПотока.Вставить("КодВидаДохода", 1);
	СтруктураПотока.Вставить("БикБанка", "044525974");
	
	Возврат СтруктураПотока;
	
КонецФункции

	
#КонецОбласти

#Область CSV_Райффайзен

&НаКлиенте
Процедура ЭкспортCSVРайффайзен(Команда)
	
	Если Модифицированность Тогда
		Предупреждение("Для экспорта реестра необходимо записать документ");
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = "*.csv|*.csv";
	Диалог.Заголовок = НСтр("Сохранение файла");
	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаCSVЗавершение_Райффайзен", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);
		
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаCSVЗавершение_Райффайзен(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
	Иначе
		Возврат;
	КонецЕсли;
	
	Потоки = СформироватьПотокиНаСервере_Райффайзен(Объект.Ссылка);
	
	Для Каждого ДанныеПотока из Потоки Цикл
		Если ДанныеПотока.Заказчик = "" Тогда
			ИмяФайла = ПутьКФайлу;
		Иначе
			ИмяФайла = ?(СтрЗаканчиваетсяНа(ПутьКФайлу, ".csv"),
							Лев(ПутьКФайлу, СтрДлина(ПутьКФайлу)-3) ,ПутьКФайлу) 
					+"("+ДанныеПотока.Заказчик+").csv";
		КонецЕсли;
		Файл = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.ANSI);
		Файл.ЗаписатьСтроку(ДанныеПотока.Поток);
		Файл.Закрыть();
	КонецЦикла;
	
	//Предупреждение("Файл сохранен");
	ОбщегоНазначенияКлиент.СообщитьПользователю("Файл сохранен");
	
КонецПроцедуры  

&НаСервере
Функция СформироватьПотокиНаСервере_Райффайзен(Реестр)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СотрудникиДополнительныеРеквизиты.Ссылка КАК Сотрудник,
	               |	СотрудникиДополнительныеРеквизиты.Ссылка.ФизическоеЛицо.Наименование КАК Наименование,
	               |	СотрудникиДополнительныеРеквизиты.Ссылка.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	КадроваяИсторияСотрудниковСрезПоследних.Подразделение КАК Подразделение,
	               |	КадроваяИсторияСотрудниковСрезПоследних.Должность КАК Должность
	               |ПОМЕСТИТЬ втКадровыеДанные
	               |ИЗ
	               |	Справочник.Сотрудники.ДополнительныеРеквизиты КАК СотрудникиДополнительныеРеквизиты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадроваяИсторияСотрудников.СрезПоследних(, ) КАК КадроваяИсторияСотрудниковСрезПоследних
	               |		ПО СотрудникиДополнительныеРеквизиты.Ссылка = КадроваяИсторияСотрудниковСрезПоследних.Сотрудник
	               |			И СотрудникиДополнительныеРеквизиты.Ссылка.ФизическоеЛицо = КадроваяИсторияСотрудниковСрезПоследних.ФизическоеЛицо
	               |ГДЕ
	               |	СотрудникиДополнительныеРеквизиты.Свойство = &Свойство
	               |	И СотрудникиДополнительныеРеквизиты.Значение = &Значение
	               |	И СотрудникиДополнительныеРеквизиты.Ссылка.Логс_Самозанятый
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Выплаты.НомерСтроки КАК НомерСтроки,
	               |	Выплаты.Контрагент.НаименованиеПолное КАК ФИО,
	               |	Выплаты.Договор.БанковскийСчетКонтрагента.НомерСчета КАК НомерСчета,
	               |	Выплаты.СуммаСНалогом КАК СуммаСНалогом,
	               |	ВЫБОР
	               |		КОГДА Выплаты.Договор.Организация = &ОЛ
	               |			ТОГДА Выплаты.Договор.Логс_ЗаказчикСЗ
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК Заказчик,
	               |	0 КАК СуммаУдержаний,
	               |	втКадровыеДанные.ФизическоеЛицо.Фамилия КАК Фамилия,
	               |	втКадровыеДанные.ФизическоеЛицо.Имя КАК Имя,
	               |	втКадровыеДанные.ФизическоеЛицо.Отчество КАК Отчество,
	               |	втКадровыеДанные.Подразделение КАК Подразделение,
	               |	втКадровыеДанные.Должность КАК Должность,
	               |	втКадровыеДанные.ФизическоеЛицо.ДатаРождения КАК ДатаРождения,
	               |	Выплаты.Договор.БанковскийСчетКонтрагента.БИКБанка КАК БИКБанка,
	               |	втКадровыеДанные.Сотрудник.Код КАК ТабельныйНомер
	               |ИЗ
	               |	Документ.Логс_РеестрВыплатСамозанятым.Выплаты КАК Выплаты
	               |		ЛЕВОЕ СОЕДИНЕНИЕ втКадровыеДанные КАК втКадровыеДанные
	               |		ПО Выплаты.Партнер.Наименование = втКадровыеДанные.Наименование
	               |ГДЕ
	               |	Выплаты.Ссылка = &Реестр
	               |	И Выплаты.Договор.БанковскийСчет.Банк = &Банк
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	НомерСтроки";
	Запрос.УстановитьПараметр("ОЛ", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ОрганизацияЛогсис());
	//Обмен с CRM (Сотрудники) (ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения)
	Запрос.УстановитьПараметр("Свойство", ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьСсылку(Новый УникальныйИдентификатор("dbf78901-85ca-11e9-80b9-000c29f360b4")));
	Запрос.УстановитьПараметр("Значение", Истина);                                                                                
	//Подставим банк из констант
	Запрос.УстановитьПараметр("Банк",Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ПолучитьЗначениеКонстантыЛогс("БанкРайффайзен"));
	Запрос.УстановитьПараметр("Реестр", Реестр);

	Выборка = Запрос.Выполнить().Выбрать();
		
	Заказчик = Неопределено;
	//Поток = "";
	РазделительЗначений = ";";
	РазделительСтрок = Символы.ПС;
	
	Потоки = Новый Массив;
	Индекс = -1;  
	НомерСтрока = 0;
	
	Пока Выборка.Следующий() Цикл
		
		Если Заказчик<>Выборка.Заказчик Тогда
			//Если Заказчик = Неопределено Тогда
			Заказчик = Выборка.Заказчик;
			Потоки.Добавить(Новый Структура("Заказчик, Поток",Заказчик,""));
			Индекс = Индекс+1;
			Первая = Истина;
			Потоки[Индекс].Поток = Потоки[Индекс].Поток + СоздатьЗаголовкиCSV(РазделительЗначений) + РазделительСтрок;
			
		КонецЕсли;
		
		Если НЕ Первая Тогда
			Потоки[Индекс].Поток = Потоки[Индекс].Поток + РазделительСтрок;
		Иначе
			Первая = Ложь;
		КонецЕсли;
		
		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Выборка.ТабельныйНомер + РазделительЗначений;
		
		//ФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Выборка.ФИО);
		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Выборка.Фамилия + РазделительЗначений + Выборка.Имя + РазделительЗначений + Выборка.Отчество + РазделительЗначений;
		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Формат(Выборка.ДатаРождения, "ДФ=dd.MM.yyyy") + РазделительЗначений;
		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Выборка.Должность + РазделительЗначений + Выборка.Подразделение + РазделительЗначений;
		
		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Выборка.НомерСчета + РазделительЗначений;
		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Выборка.БикБанка + РазделительЗначений;
		
		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Формат(Выборка.СуммаСНалогом, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=") + РазделительЗначений;
		
		//Номер карты
		Потоки[Индекс].Поток = Потоки[Индекс].Поток + "" + РазделительЗначений; 
				
		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Формат(0, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=") + РазделительЗначений;
		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Формат(0, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=") + РазделительЗначений;
		Потоки[Индекс].Поток = Потоки[Индекс].Поток + Формат(0, "ЧДЦ=2; ЧРД=.; ЧН=0.00; ЧГ=");
						
	КонецЦикла;
	
	Возврат Потоки;
    
КонецФункции     


#Область Формат_CSV_РайффайзенБанк

//Таб. №	
//Фамилия	
//Имя	
//Отчество	
//Дата рождения	
//Должность	
//Подразделение	
//Счет получателя	
//БИК	
//Сумма средств к зачислению на счет получателя	
//Номер карты	
//% конвертации в USD	
//% конвертации в EUR	
//Удержанная сумма в RUB  

#КонецОбласти
&НаСервере
Функция СоздатьЗаголовкиCSV(разделитель)
    
    Массив = Новый Массив;
	Массив.Добавить("Таб. №");
	Массив.Добавить("Фамилия");
	Массив.Добавить("Имя");
	Массив.Добавить("Отчество");
	Массив.Добавить("Дата рождения");
	Массив.Добавить("Должность");
	Массив.Добавить("Подразделение");
	Массив.Добавить("Счет получателя");
	Массив.Добавить("БИК");
	Массив.Добавить("Сумма средств к зачислению на счет получателя");
	Массив.Добавить("Номер карты");
	Массив.Добавить("% конвертации в USD");
	Массив.Добавить("% конвертации в EUR");
	Массив.Добавить("Удержанная сумма в RUB");
	
    стрКолонки = "";
    Для каждого колонка Из Массив Цикл
        
        Если СтрДлина(стрКолонки)>0 Тогда
            стрКолонки = стрКолонки + разделитель;
        КонецЕсли;    
        
        стрКолонки = стрКолонки + колонка;
        
    КонецЦикла; 
    
    Возврат стрКолонки;
    
КонецФункции

&НаСервере
Функция СформироватьXMLСберБанк(Реестр)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Логс_РеестрВыплатСамозанятым.Дата КАК Дата,
	               |	Логс_РеестрВыплатСамозанятым.Организация.Наименование КАК НаименованиеОрганизации,
	               |	Логс_РеестрВыплатСамозанятым.Организация.ИНН КАК ИНН,
	               |	isnull(Логс_РеестрВыплатСамозанятым.БанковскийСчет.НомерСчета, """") КАК НомерСчета,
	               |	isnull(Логс_РеестрВыплатСамозанятым.БанковскийСчет.БИКБанка, """") КАК БИК,
	               |	Логс_РеестрВыплатСамозанятым.БанковскийСчет.Логс_НомерДоговора КАК НомерДоговора
	               |ИЗ
	               |	Документ.Логс_РеестрВыплатСамозанятым КАК Логс_РеестрВыплатСамозанятым
	               |ГДЕ
	               |	Логс_РеестрВыплатСамозанятым.Ссылка = &Реестр";     
	Запрос.УстановитьПараметр("Реестр", Реестр);
	
	ВыборкаРеестр = Запрос.Выполнить().Выбрать();  
	Если НЕ ВыборкаРеестр.Следующий() Тогда
		Возврат "";
	КонецЕсли;  
	
	ДатаФормирования 		 = Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd"); 	
	НомерДоговора 	 		 = ВыборкаРеестр.НомерДоговора;
	НаименованиеОрганизации  = ВыборкаРеестр.НаименованиеОрганизации; 	
	ИНН 				     = ВыборкаРеестр.ИНН;
	РасчетныйСчетОрганизации = ВыборкаРеестр.НомерСчета;
	БИК						 = ВыборкаРеестр.БИК;
	ИдПервичногоДокумента	 = Строка(Реестр.УникальныйИдентификатор());
	
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Выплаты.Контрагент.НаименованиеПолное КАК ФИО,
	               |	Выплаты.Договор.БанковскийСчетКонтрагента.НомерСчета КАК НомерСчета,
	               |	СУММА(Выплаты.СуммаСНалогом) КАК СуммаСНалогом,
	               |	ВЫБОР
	               |		КОГДА Выплаты.Договор.Организация = &ОЛ
	               |			ТОГДА Выплаты.Договор.Логс_ЗаказчикСЗ
	               |		ИНАЧЕ """"
	               |	КОНЕЦ КАК Заказчик,
	               |	0 КАК СуммаУдержаний,
	               |	""0000"" КАК ОтделениеБанка,
	               |	"""" КАК ФилиалОтделенияБанка,
	               |	Выплаты.Договор.Номер КАК НомерИндивидуальногоДоговора,
	               |	Выплаты.Договор.Дата КАК ДатаИндивидуальногоДоговора,
	               |	""21200"" КАК КодВалютнойОперации,
	               |	МИНИМУМ(Выплаты.НомерСтроки) КАК НомерСтроки
	               |ИЗ
	               |	Документ.Логс_РеестрВыплатСамозанятым.Выплаты КАК Выплаты
	               |ГДЕ
	               |	Выплаты.Ссылка = &Реестр
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Выплаты.Договор.Дата,
	               |	Выплаты.Контрагент.НаименованиеПолное,
	               |	Выплаты.Договор.БанковскийСчетКонтрагента.НомерСчета,
	               |	ВЫБОР
	               |		КОГДА Выплаты.Договор.Организация = &ОЛ
	               |			ТОГДА Выплаты.Договор.Логс_ЗаказчикСЗ
	               |		ИНАЧЕ """"
	               |	КОНЕЦ,
	               |	Выплаты.Договор.Номер";
	Запрос.УстановитьПараметр("ОЛ", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ОрганизацияЛогсис());

	//ВыборкаВыплаты = Запрос.Выполнить().Выбрать();  
	ТаблицаВыплаты = Запрос.Выполнить().Выгрузить();
	
	ТаблицаДублейВыплаты = ТаблицаВыплаты.Скопировать();
	ТаблицаДублейВыплаты.Очистить();
	ПервыйСотрудникДубль = Неопределено;
	
	Для Каждого Стр из ТаблицаВыплаты Цикл 
		
		СтруктураПоиска = Новый Структура;
		СтруктураПоиска.Вставить("ФИО", 			Стр.ФИО);
		СтруктураПоиска.Вставить("СуммаСНалогом", 	Стр.СуммаСНалогом);
		МассивВыплаты = ТаблицаВыплаты.НайтиСтроки(СтруктураПоиска); 
		Если ПервыйСотрудникДубль <> Стр.ФИО И МассивВыплаты.Количество() > 1 И ТаблицаДублейВыплаты.Найти(Стр.НомерСтроки, "НомерСтроки") = Неопределено Тогда 
			ПервыйСотрудникДубль = Стр.Фио;
			Для каждого Дубль Из МассивВыплаты Цикл
				Если Дубль.НомерСтроки <> Стр.НомерСтроки И ТаблицаДублейВыплаты.Найти(Дубль.НомерСтроки, "НомерСтроки") = Неопределено Тогда
					НоваяСтрока = ТаблицаДублейВыплаты.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, Дубль);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;

	СтруктураЗаголовка = Новый Структура;
	СтруктураЗаголовка.Вставить("ДатаФормирования", 		ДатаФормирования);
	СтруктураЗаголовка.Вставить("НомерДоговора", 			НомерДоговора);
	СтруктураЗаголовка.Вставить("НаименованиеОрганизации", 	НаименованиеОрганизации);
	СтруктураЗаголовка.Вставить("ИНН",						ИНН);
	СтруктураЗаголовка.Вставить("РасчетныйСчетОрганизации", РасчетныйСчетОрганизации);
	СтруктураЗаголовка.Вставить("БИК", 						БИК);
	СтруктураЗаголовка.Вставить("ИдПервичногоДокумента", 	ИдПервичногоДокумента);
	
	СтруктураВозврата = ПолучитьЗаписьХМЛ(СтруктураЗаголовка, ТаблицаВыплаты, ТаблицаДублейВыплаты, "Сбер");
	
	Потоки = Новый Массив;  
	Потоки.Добавить(Новый Структура("Заказчик, Поток", СтруктураВозврата.Заказчик,СтруктураВозврата.ПотокХМЛ));
	
	Для Каждого Стр из ТаблицаДублейВыплаты Цикл 
	
		СтруктураВозврата = ПолучитьЗаписьХМЛ(СтруктураЗаголовка, Стр,  ,"Сбер");
		Потоки.Добавить(Новый Структура("Заказчик, Поток", СтруктураВозврата.Заказчик,СтруктураВозврата.ПотокХМЛ));
				
	КонецЦикла;
	
	Возврат Потоки;
         	
КонецФункции  

&НаКлиенте
Процедура ЭкспортXMLСберБанкНерезиденты(Команда)
	//ЭкспортXMLСберБанкНерезидентыНаСервере();
	
	Если Модифицированность Тогда
		Предупреждение("Для экспорта реестра необходимо записать документ");
		Возврат;
	КонецЕсли; 
	
	Если НЕ Объект.СамозанятыеНерезиденты Тогда  
		Предупреждение("Данный формат используется для выгрузки нерезидентов!");
		Возврат;
	КонецЕсли;
	
		
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = "*.xml|*.xml";
	Диалог.Заголовок = НСтр("Сохранение файла");
	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаXMLСберЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);
	
КонецПроцедуры  

&НаКлиенте
Процедура ВыборФайлаXMLСберЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
	Иначе
		Возврат;
	КонецЕсли;
	
	Потоки = СформироватьXMLСберБанк(Объект.Ссылка);
	НомерФайла = 1;
	Для Каждого ДанныеПотока из Потоки Цикл
		Если ДанныеПотока.Заказчик = "" Тогда
			ИмяФайла = ПутьКФайлу;
		Иначе
			ИмяФайла = ?(СтрЗаканчиваетсяНа(ПутьКФайлу, ".xml"),
							Лев(ПутьКФайлу, СтрДлина(ПутьКФайлу)-4) ,ПутьКФайлу) 
					+"("+ДанныеПотока.Заказчик+").xml";
		КонецЕсли;
		
		//++ Ким Виктор 28.06.2024
		//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-13521
		//Формирование хмл на несколько файлов по сумме и фио;
		Если Потоки.Количество() > 1 Тогда 
			ИмяФайла = ?(СтрЗаканчиваетсяНа(ПутьКФайлу, ".xml"),Лев(ПутьКФайлу, СтрДлина(ПутьКФайлу)-4), ПутьКФайлу) + Строка(НомерФайла) + ".xml";
			НомерФайла = НомерФайла + 1;
		КонецЕсли;
		//-- Ким Виктор 28.06.2024
		
		Файл = Новый ЗаписьТекста(ИмяФайла, "windows-1251");
		Файл.ЗаписатьСтроку(ДанныеПотока.Поток);
		Файл.Закрыть();
	КонецЦикла;
	
	//Предупреждение("Файл сохранен");
	ОбщегоНазначенияКлиент.СообщитьПользователю("Файл сохранен");
	
КонецПроцедуры  


	
#КонецОбласти
//-- Ким Виктор 02.11.2024 

//++ Ким Виктор 25.07.2025
//Экспорт в косноль.Про
#Область НовыйЭкспорт 

&НаСервере
Функция ПолучитьСтруктуруПотокаНовый()
	
	СтруктураПотока = Новый Структура;
	СтруктураПотока.Вставить("ИНН");
	СтруктураПотока.Вставить("Фамилия");
	СтруктураПотока.Вставить("ФИО");
	//СтруктураПотока.Вставить("Имя");
	//СтруктураПотока.Вставить("Отчество");
	//СтруктураПотока.Вставить("НомерСчета");
	//СтруктураПотока.Вставить("Отчество");
	СтруктураПотока.Вставить("Сумма");
	СтруктураПотока.Вставить("ДатаСоздания");
	СтруктураПотока.Вставить("ДатаНачала");
	СтруктураПотока.Вставить("ДатаОкончания");
	
	Возврат СтруктураПотока;
	
КонецФункции


&НаСервере
Функция ЭкспортКонсольПроНаСервере(Реестр)
	
	
	Запрос = новый Запрос;
	Запрос.Текст =  ("ВЫБРАТЬ
	                 |	МИНИМУМ(Логс_РеестрВыплатСамозанятымВыплаты.НомерСтроки) КАК НомерСтроки,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Контрагент.НаименованиеПолное КАК ФИО,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Договор.БанковскийСчетКонтрагента.НомерСчета КАК НомерСчета,
	                 |	СУММА(Логс_РеестрВыплатСамозанятымВыплаты.СуммаСНалогом) КАК Сумма,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Договор.БанковскийСчетКонтрагента.Банк КАК БанкКонтрагента,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Договор.Номер КАК ДоговорНомер,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Договор.Дата КАК ДоговорДата,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.ДатаОказанияУслуг КАК ДатаОказанияУслуг,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Контрагент.ИНН КАК ИНН
	                 |ИЗ
	                 |	Документ.Логс_РеестрВыплатСамозанятым.Выплаты КАК Логс_РеестрВыплатСамозанятымВыплаты
	                 |ГДЕ
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка = &Ссылка
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Договор.БанковскийСчетКонтрагента.НомерСчета,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Контрагент.НаименованиеПолное,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Договор.БанковскийСчетКонтрагента.Банк,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Договор.Номер,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Договор.Дата,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.ДатаОказанияУслуг,
	                 |	Логс_РеестрВыплатСамозанятымВыплаты.Контрагент.ИНН
	                 |
	                 |УПОРЯДОЧИТЬ ПО
	                 |	НомерСтроки") ;
	Запрос.УстановитьПараметр("Ссылка", Реестр);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабДок = Новый ТабличныйДокумент;
	ОбъектДокумент =  РеквизитФормыВЗначение("Объект"); 
	Макет = ОбъектДокумент.ПолучитьМакет("МакетВыгрузкиКонсольПро");
	ОбластьЗаголовок = Макет.ПолучитьОбласть("ОбластьЗаголовок");
	ТабДок.Вывести(ОбластьЗаголовок);
	Номерстроки = 0;
	Пока Выборка.Следующий() Цикл 
		НомерСтроки = Номерстроки + 1;
		СтруктураПотока = ПолучитьСтруктуруПотокаНовый();
		//ФИО = ФизическиеЛицаКлиентСервер.ЧастиИмени(Выборка.ФИО);
		ЗаполнитьЗначенияСвойств(СтруктураПотока, Выборка);
		//ЗаполнитьЗначенияСвойств(СтруктураПотока, ФИО, "Фамилия, Имя, Отчество");
		СтруктураПотока.Сумма 			= Формат(СтруктураПотока.Сумма, "ЧЦ=15; ЧДЦ=2; ЧРД=.");
		СтруктураПотока.ДатаСоздания 	= Формат(Выборка.ДатаОказанияУслуг, "ДФ=dd.MM.yyyy");
		СтруктураПотока.ДатаНачала 		= Формат(Выборка.ДатаОказанияУслуг, "ДФ=dd.MM.yyyy");
		СтруктураПотока.ДатаОкончания 	= Формат(Выборка.ДатаОказанияУслуг, "ДФ=dd.MM.yyyy");
		ОбластьСтрока = Макет.ПолучитьОбласть("ОбластьСтрока");
		ОбластьСтрока.Параметры.Заполнить(СтруктураПотока);
		ТабДок.Вывести(ОбластьСтрока);
		      	
	КонецЦикла;
	
	Возврат ТабДок;
		
КонецФункции

&НаКлиенте
Процедура ЭкспортКонсольПро(Команда)
	
	Если Модифицированность Тогда
		Предупреждение("Для экспорта реестра необходимо записать документ");
		Возврат;
	КонецЕсли; 
	    	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр = "*.xlsx|*.xlsx";
	Диалог.Заголовок = НСтр("Сохранение файла");
	ОповещениеЗавершения = Новый ОписаниеОповещения("ВыборФайлаНовыйЗавершение", ЭтотОбъект);
	Диалог.Показать(ОповещениеЗавершения);
	
КонецПроцедуры
 
&НаКлиенте
Процедура ВыборФайлаНовыйЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт

	Если ВыбранныеФайлы <> Неопределено Тогда
		ПутьКФайлу = ВыбранныеФайлы[0];
	Иначе
		Возврат;
	КонецЕсли;
	
	ТабДок = ЭкспортКонсольПроНаСервере(Объект.Ссылка);
	ТабДок.Записать(ПутьКФайлу,ТипФайлаТабличногоДокумента.XLSX);
	
	ОбщегоНазначенияКлиент.СообщитьПользователю("Файл сохранен");
	
	
КонецПроцедуры  

//++Щурихин Д.С. 16.12.2025
&НаКлиенте
Процедура ЭкспортXLSСберБанкНерезиденты(Команда)
	
	Если Модифицированность Тогда
		Предупреждение("Для экспорта реестра необходимо записать документ");
		Возврат;
	КонецЕсли;
	
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	Диалог.Фильтр			= "Документ Excel (*.xlsx)|*.xlsx";
	Диалог.Расширение		= "xlsx";
	Диалог.Заголовок 		= НСтр("Сохранение файла");
	
	Если Диалог.Выбрать() Тогда
		ПутьКФайлу = Диалог.ПолноеИмяФайла;
		ТабДок = СформироватьРеестрСбербанкНерезидентыXLSнаСервере(Объект.Ссылка);
		ТабДок.Записать(ПутьКФайлу,ТипФайлаТабличногоДокумента.XLSX);
		ОбщегоНазначенияКлиент.СообщитьПользователю("Файл сохранен");
	КонецЕсли;
	


КонецПроцедуры 

&НаСервере
Функция СформироватьРеестрСбербанкНерезидентыXLSнаСервере(Реестр)
	
	ТабДок 			= Новый ТабличныйДокумент;
	ОбъектДокумент 	= РеквизитФормыВЗначение("Объект"); 
	Макет 			= ОбъектДокумент.ПолучитьМакет("РеестрСбербанкНерезидентыXLS");
	ОбластьШапки  	= Макет.ПолучитьОбласть("Шапка");
	
	
	//Обход по группировкам
	РезультатЗапроса = ПолучитьДанныеДляДокументов(Реестр); 
	
	ВыборкаДокСсылка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДокСсылка.Следующий() Цикл

		//ТабДок.ВывестиГоризонтальныйРазделительСтраниц();		
		ТабДок.Вывести(ОбластьШапки);

		ВыборкаДетальныеЗаписи = ВыборкаДокСсылка.Выбрать(); 
		
		Сч = 1;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл   
			
			//++ Ким Виктор 02.03.2026
			//https://logit.okdesk.ru/issues/1052#! 
			
			ТабЧасть	 	= Макет.ПолучитьОбласть("ТабЧасть"); 
			
			Если СЧ = 1 Тогда 
				
				ЗаполнитьЗначенияСвойств(ТабЧасть.Параметры, ВыборкаДетальныеЗаписи); 
				
			Иначе  
				//Исключаем заполнение этих полей для  номера строки > 1
				//БИК	
				//ВидЗачисления	
				//ДатаДокумента	
				//ОрганизацияИНН	
				//ИтогСумма	
				//КодВидаВалютнойОперации	
				//КодВидаДохода	
				//КолСотрудников	
				//НаименованиеОрганизации	
				//ДоговорБанковскогоСчета	
				//НомерДокумента	
				//СчетОрганизации
				
				ЗаполнитьЗначенияСвойств(ТабЧасть.Параметры, ВыборкаДетальныеЗаписи,, "БИК, ВидЗачисления,	
				| ДатаДокумента, ОрганизацияИНН, КодВидаВалютнойОперации, КодВидаДохода, 
				| НаименованиеОрганизации,	ДоговорБанковскогоСчета, НомерДокумента, СчетОрганизации, ИтогСумма");
				
			КонецЕсли; 
			
			//-- Ким Виктор 02.03.2026
			
			//Результат = Новый Структура("Фамилия, Имя, Отчество"); 
			//ФизическиеЛицаКлиентСервер.ЧастиИмени(
			//ФизическиеЛицаКлиентСерверЛокализация.ПриОпределенииЧастейПолногоИмени(ВыборкаДетальныеЗаписи.ПартнерФИО,, Результат);    
			Результат = ФизическиеЛицаКлиентСервер.ЧастиИмени(ВыборкаДетальныеЗаписи.ПартнерФИО);
           	ТабЧасть.Параметры.Фамилия 			= Результат.Фамилия;
			ТабЧасть.Параметры.Имя				= Результат.Имя;
			ТабЧасть.Параметры.Отчество			= Результат.Отчество;
			ТабЧасть.Параметры.СуммаКВыплате 	= ВыборкаДетальныеЗаписи.ИтогСумма;   //Здесь группировка по сотруднику
			
			//++ Ким Виктор 02.03.2026
			//https://logit.okdesk.ru/issues/1052#!

			Если СЧ = 1 Тогда 
				ТабЧасть.Параметры.ИтогСумма		= ВыборкаДокСсылка.ИтогСумма;         //Здесь итоги по документы      
				ТабЧасть.Параметры.КолСотрудников 	= ВыборкаДетальныеЗаписи.Количество();//Количество сотрудников равно количеству Детальных записей 
			КонецЕсли; 
			
			//-- Ким Виктор 02.03.2026

			ТабЧасть.Параметры.НомерПП 			= Сч;
					
			ТабДок.Вывести(ТабЧасть);
			
			Сч = Сч + 1;
			
		КонецЦикла; 
		
	//НомерСтрокиНачало = ТабДок.ВысотаТаблицы + 1;
	//УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДок,НомерСтрокиНачало,ОбъектыПечати,ВыборкаДокСсылка.Ссылка); 	
		
	КонецЦикла;
		
	Возврат ТабДок;
	
КонецФункции  

&НаСервере
Функция ПолучитьДанныеДляДокументов(МассивОбъектов) 
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка.БанковскийСчет.БИКБанка КАК БИК,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка.Дата КАК ДатаДокумента,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка.Организация.ИНН КАК ОрганизацияИНН,
		|	СУММА(Логс_РеестрВыплатСамозанятымВыплаты.Сумма) КАК ИтогСумма,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка.Организация.Наименование КАК НаименованиеОрганизации,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Договор.Номер КАК НомерДоговора,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка.Номер КАК НомерДокумента,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка.БанковскийСчет.НомерСчета КАК СчетОрганизации,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Договор.Дата КАК ДатаДоговора,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка КАК Ссылка,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Партнер.Представление КАК ПартнерФИО,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Договор.БанковскийСчетКонтрагента.НомерСчета КАК СчетЗачисления,
		|	""38215845"" КАК ДоговорБанковскогоСчета,
		|	""87"" КАК ВидЗачисления,
		|	""1"" КАК КодВидаДохода,
		|	""21200"" КАК КодВидаВалютнойОперации
		|ИЗ
		|	Документ.Логс_РеестрВыплатСамозанятым.Выплаты КАК Логс_РеестрВыплатСамозанятымВыплаты
		|ГДЕ
		|	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка В(&МассивОбъектов)
		|
		|СГРУППИРОВАТЬ ПО
		|	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка.БанковскийСчет.БИКБанка,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка.Дата,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка.Организация.ИНН,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка.Организация.Наименование,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Договор.Номер,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка.Номер,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка.БанковскийСчет.НомерСчета,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Договор.Дата,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Ссылка,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Партнер.Представление,
		|	Логс_РеестрВыплатСамозанятымВыплаты.Договор.БанковскийСчетКонтрагента.НомерСчета
		|ИТОГИ
		|	СУММА(ИтогСумма)
		|ПО
		|	Ссылка КАК ДокСсылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();    //Обход результата по Группировкам
	
	Возврат РезультатЗапроса;
	
КонецФункции


#КонецОбласти
//-- Ким Виктор 25.07.2025

