#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания; 

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ (СоздаватьПКО или СоздаватьЭквайринговыеОперации) Тогда
		СоздаватьПКО = Истина;
		СоздаватьЭквайринговыеОперации = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания = ЗначениеЗаполнено(ИдентификаторЗадания);
	Если ПодключитьОбработчикОжидания Тогда
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаОжидание;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		ОтменитьВыполнениеЗадания();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборПартнерЗначениеПриИзменении(Элемент)
	
	ОтборПартнерИспользование = ЗначениеЗаполнено(ОтборПартнерЗначение);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандыФормы

&НаКлиенте
Процедура ВыбратьПериод(Команда)

	ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогПериода.Период = Новый СтандартныйПериод(НачалоПериода, КонецПериода);
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ДиалогПериода.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйПериод <> Неопределено Тогда
		НачалоПериода = ВыбранныйПериод.ДатаНачала;
		КонецПериода = ВыбранныйПериод.ДатаОкончания;
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	ОчиститьСообщения();
	
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
	
	РезультатВыполнения = СоздатьДокументыНаСервере();
	
	Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаОжидание;
		
	ИначеЕсли РезультатВыполнения.Свойство("ОтказПроверкиЗаполнения") Тогда
		
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаПараметры;
		
	Иначе
		
		ОбработатьВыполнениеЗадания();
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтменитьВыполнениеЗадания()
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 

			ОбработатьВыполнениеЗадания();
		
		Иначе
			
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
				
		КонецЕсли;
			
	Исключение
			
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаПараметры;
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьПараметрыОбработки()
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("Команда", "СоздатьДокументыПоПоступлениюДенежныхСредств");
	ПараметрыОбработки.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыОбработки.Вставить("КонецПериода", КонецПериода);
	ПараметрыОбработки.Вставить("ТолькоСоздаватьНовые", НеПерезаписыватьДокументы);
	
	Если ОтборПартнерИспользование Тогда
		ПараметрыОбработки.Вставить("Партнер", ОтборПартнерЗначение);
	КонецЕсли; 
	
	Если ОтборХабИспользование Тогда
		ПараметрыОбработки.Вставить("Хаб", ОтборХаб);
	КонецЕсли; 
	                                          
	ПараметрыОбработки.Вставить("СоздаватьПКО", СоздаватьПКО);
	ПараметрыОбработки.Вставить("СоздаватьЭквайринговыеОперации", СоздаватьЭквайринговыеОперации);
	
	Возврат ПараметрыОбработки;
	
КонецФункции 

&НаСервере
Функция СоздатьДокументыНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Новый Структура("ЗаданиеВыполнено, ОтказПроверкиЗаполнения", Истина, Истина);
	КонецЕсли; 
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
	ИдентификаторЗадания = Неопределено;
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаПараметры;
	
	ПараметрыЗагрузки = ПодготовитьПараметрыОбработки();
	
	РезультатВыполнения = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"Обработки.Логс_УУСозданиеРеглДокументов.СоздатьРеглДокументы",
		ПараметрыЗагрузки,
		"УУ Создание регламентированных документов от " + ТекущаяДатаСеанса());
		
	АдресХранилища       = РезультатВыполнения.АдресХранилища;
	ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыполнениеЗадания()
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаПараметры;
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если РезультатВыполнения.Успешно Тогда
		
		ТекстСообщения = НСтр("ru='Создание документов выполнено.'");
	
		ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
		ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
		ПараметрыВопроса.Картинка = БиблиотекаКартинок.Информация32;
		
		Оповещение = Новый ОписаниеОповещения("ОбработатьВыполнениеЗаданияЗавершение", ЭтотОбъект);
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение,
			ТекстСообщения, РежимДиалогаВопрос.ОК, ПараметрыВопроса);
		
	Иначе
		
		ТекстСообщения = НСтр("ru='Во время выполнения операции произошли ошибки.'");
		
		Если Не РезультатВыполнения.Свойство("СписокОшибок") Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС +
				НСтр("ru='Подробности см. в Журнале регистрации.'");
		Иначе
			Для каждого ОписаниеОшибки Из РезультатВыполнения.СписокОшибок Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ОписаниеОшибки.ТекстОшибки, ОписаниеОшибки.КлючДанных);
			КонецЦикла;
		КонецЕсли; 
		
		ПоказатьПредупреждение(, ТекстСообщения);
		
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьВыполнениеЗаданияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Закрыть();
	
КонецПроцедуры 

&НаКлиенте
Процедура ОтборХабПриИзменении(Элемент)
	ОтборХабИспользование = Истина;
КонецПроцедуры

#КонецОбласти 