#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура СоздатьРеглДокументы(Параметры, АдресХранилища) Экспорт
	Перем ТабличныйДокумент;
	
	УстановитьПривилегированныйРежим(Истина);
	
	СписокОшибок = Новый Массив;
	
	Выполнить("ТабличныйДокумент = " + Параметры.Команда + "(Параметры, СписокОшибок)");
	
	Результат = Новый Структура("Успешно", СписокОшибок.Количество() = 0);
	Если Не Результат.Успешно Тогда
		Результат.Вставить("СписокОшибок", СписокОшибок);
	КонецЕсли; 
	
	Если ТабличныйДокумент <> Неопределено Тогда
		Результат.Вставить("ТабличныйДокумент", ТабличныйДокумент);
	КонецЕсли; 
	
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры 

#КонецОбласти 

#Область СозданиеДокументов

Функция СоздатьЗаявкиНаРасходованиеДенежныхСредств(Параметры, СписокОшибок = Неопределено)
	Перем КэшированныеЗначения;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", КонецДня(Параметры.Период) + 1);
	Запрос.УстановитьПараметр("СрокиПеречисленияНП", Параметры.СрокиПеречисленияНП);
	Запрос.УстановитьПараметр("ДатаНачалаУчета", Дата('20200728'));
	Запрос.УстановитьПараметр("ПустаяОрганизация", Справочники.Организации.ПустаяСсылка());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок КАК СводЗаявок,
	|	Логс_ВзаиморасчетыЗаВычетомОстатки.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаНаложенногоПлатежаОстаток > 0
	|			ТОГДА Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаНаложенногоПлатежаОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Сумма,
	|	ВЫБОР
	|		КОГДА Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаКОплатеОстаток < 0
	|			ТОГДА Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаКОплатеОстаток
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаВозврата,
	|	ВЫБОР
	|		КОГДА Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаКОплатеОстаток < 0
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК ЭтоВозврат
	|ПОМЕСТИТЬ РасчетыПоНаложеннымПлатежамОстатки
	|ИЗ
	|	РегистрНакопления.Логс_ВзаиморасчетыЗаВычетом.Остатки(
	|			&Период,
	|			СводЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом)
	|				И (АналитикаУчетаПоПартнерам.Договор.Логс_СрокПеречисленияНП В (&СрокиПеречисленияНП)
	|					ИЛИ АналитикаУчетаПоПартнерам.Договор.Логс_СрокПеречисленияНПРег В (&СрокиПеречисленияНП))
	|				И СводЗаявок.Дата <= &Период
	|				И НЕ СводЗаявок.Организация.Логс_НеФормироватьРеглДокументы
	|				И СводЗаявок.ВидКлиента <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.СКС)
	|				И &ТекстОтбораПоПартнеру) КАК Логс_ВзаиморасчетыЗаВычетомОстатки
	|ГДЕ
	|	(Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаКОплатеОстаток < 0
	|			ИЛИ Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаНаложенногоПлатежаОстаток > 0)
	|	И Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок.Дата >= &ДатаНачалаУчета
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Аналитика.Организация КАК Организация,
	|	Аналитика.Партнер КАК Партнер,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор
	|ПОМЕСТИТЬ ИспользуемаяАналитика
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыПоНаложеннымПлатежам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|	ИЗ
	|		РасчетыПоНаложеннымПлатежамОстатки КАК РасчетыПоНаложеннымПлатежам
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасчетыПоНаложеннымПлатежам.АналитикаУчетаПоПартнерам
	|	
	|	ИМЕЮЩИЕ
	|		СУММА(РасчетыПоНаложеннымПлатежам.Сумма) > 0) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ВложенныйЗапрос.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ИспользуемаяАналитика.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	МАКСИМУМ(ВЫРАЗИТЬ(Логс_ВзаиморасчетыЗаВычетом.Регистратор КАК Документ.ЗаявкаНаРасходованиеДенежныхСредств).Дата) КАК Дата
	|ПОМЕСТИТЬ ПоследняяПроведеннаяЗаявка
	|ИЗ
	|	ИспользуемаяАналитика КАК ИспользуемаяАналитика
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Логс_ВзаиморасчетыЗаВычетом КАК Логс_ВзаиморасчетыЗаВычетом
	|		ПО ИспользуемаяАналитика.АналитикаУчетаПоПартнерам = Логс_ВзаиморасчетыЗаВычетом.АналитикаУчетаПоПартнерам
	|ГДЕ
	|	Логс_ВзаиморасчетыЗаВычетом.Регистратор ССЫЛКА Документ.ЗаявкаНаРасходованиеДенежныхСредств
	|	И Логс_ВзаиморасчетыЗаВычетом.Период < &Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ИспользуемаяАналитика.АналитикаУчетаПоПартнерам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоНаложеннымПлатежам.СводЗаявок КАК СводЗаявок,
	|	РасчетыПоНаложеннымПлатежам.Валюта КАК Валюта,
	|	Аналитика.Организация КАК Организация,
	|	Аналитика.Партнер КАК Партнер,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор,
	|	РасчетыПоНаложеннымПлатежам.Сумма КАК Сумма,
	|	РасчетыПоНаложеннымПлатежам.СуммаВозврата КАК СуммаВозврата,
	|	ЕСТЬNULL(ПоследняяПроведеннаяЗаявка.Дата, ДАТАВРЕМЯ(2010, 1, 1)) КАК ДатаПоследнейЗаявки,
	|	РасчетыПоНаложеннымПлатежам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыПоНаложеннымПлатежам.ЭтоВозврат КАК ЭтоВозврат
	|ПОМЕСТИТЬ РасчетыПоНаложеннымПлатежам
	|ИЗ
	|	РасчетыПоНаложеннымПлатежамОстатки КАК РасчетыПоНаложеннымПлатежам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИспользуемаяАналитика КАК Аналитика
	|		ПО РасчетыПоНаложеннымПлатежам.АналитикаУчетаПоПартнерам = Аналитика.АналитикаУчетаПоПартнерам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПоследняяПроведеннаяЗаявка КАК ПоследняяПроведеннаяЗаявка
	|		ПО РасчетыПоНаложеннымПлатежам.АналитикаУчетаПоПартнерам = ПоследняяПроведеннаяЗаявка.АналитикаУчетаПоПартнерам
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СводЗаявок,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РасчетыПоНаложеннымПлатежамОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИспользуемаяАналитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Кассы.Владелец КАК Организация,
	|	МАКСИМУМ(Кассы.Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ Кассы
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	Кассы.Владелец В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				РасчетыПоНаложеннымПлатежам.Организация
	|			ИЗ
	|				РасчетыПоНаложеннымПлатежам)
	|	И НЕ Кассы.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Кассы.Владелец
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаспределениеПоСводамЗаявок.СводЗаявок КАК СводЗаявок
	|ПОМЕСТИТЬ СуществующиеЗаявкиНаРасходованиеДС
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК РаспределениеПоСводамЗаявок
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Логс_ВзаиморасчетыЗаВычетом КАК Логс_ВзаиморасчетыЗаВычетом
	|		ПО РаспределениеПоСводамЗаявок.Ссылка = Логс_ВзаиморасчетыЗаВычетом.Регистратор
	|ГДЕ
	|	РаспределениеПоСводамЗаявок.СводЗаявок В
	|			(ВЫБРАТЬ
	|				РасчетыПоНаложеннымПлатежам.СводЗаявок
	|			ИЗ
	|				РасчетыПоНаложеннымПлатежам)
	|	И РаспределениеПоСводамЗаявок.Ссылка.Проведен
	|	И НЕ РаспределениеПоСводамЗаявок.Ссылка.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РаспределениеПоСводамЗаявок.СводЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокСводЗаявок.Дата КАК ДатаСвода,
	|	ДокСводЗаявок.Номер КАК НомерСвода,
	|	ДокСводЗаявок.ФормаОплаты КАК ФормаОплаты,
	|	РасчетыПоНаложеннымПлатежам.Организация КАК Организация,
	|	РасчетыПоНаложеннымПлатежам.Партнер КАК Партнер,
	|	РасчетыПоНаложеннымПлатежам.Контрагент КАК Контрагент,
	|	РасчетыПоНаложеннымПлатежам.Договор КАК Договор,
	|	ДоговорыКонтрагентов.НаименованиеДляПечати КАК НаименованиеДоговора,
	|	ДоговорыКонтрагентов.Логс_ВидКлиентаCRM КАК ВидКлиента,
	|	ВЫБОР
	|		КОГДА ДокСводЗаявок.РегиональныйСвод
	|			ТОГДА ДоговорыКонтрагентов.Логс_СрокПеречисленияНПРег
	|		ИНАЧЕ ДоговорыКонтрагентов.Логс_СрокПеречисленияНП
	|	КОНЕЦ КАК СрокПеречисленияНП,
	|	ВЫБОР
	|		КОГДА ДокСводЗаявок.РегиональныйСвод
	|			ТОГДА ДоговорыКонтрагентов.Логс_ПериодФормированияСводовАгентаРег
	|		ИНАЧЕ ДоговорыКонтрагентов.Логс_ПериодФормированияСводовАгента
	|	КОНЕЦ КАК ПериодФормированияОтчетов,
	|	ВЫБОР
	|		КОГДА РасчетыПоНаложеннымПлатежам.Договор.Логс_ПриоритетныйСчетОплаты = ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА Организации.Логс_ОсновнойБанковскийСчет
	|		ИНАЧЕ РасчетыПоНаложеннымПлатежам.Договор.Логс_ПриоритетныйСчетОплаты
	|	КОНЕЦ КАК БанковскийСчет,
	|	ДоговорыКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ДоговорыКонтрагентов.Подразделение КАК Подразделение,
	|	ДоговорыКонтрагентов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ДоговорыКонтрагентов.СтавкаНДС КАК СтавкаНДС,
	|	Кассы.Ссылка КАК Касса,
	|	РасчетыПоНаложеннымПлатежам.СводЗаявок КАК СводЗаявок,
	|	РасчетыПоНаложеннымПлатежам.Валюта КАК Валюта,
	|	РасчетыПоНаложеннымПлатежам.Сумма КАК Сумма,
	|	НЕ СуществующиеЗаявкиНаРасходованиеДС.СводЗаявок ЕСТЬ NULL КАК Доплата,
	|	РасчетыПоНаложеннымПлатежам.СуммаВозврата КАК СуммаВозврата,
	|	РасчетыПоНаложеннымПлатежам.ДатаПоследнейЗаявки КАК ДатаПоследнейЗаявки,
	|	РасчетыПоНаложеннымПлатежам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасчетыПоНаложеннымПлатежам.ЭтоВозврат КАК ЭтоВозврат,
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	РасчетыПоНаложеннымПлатежам КАК РасчетыПоНаложеннымПлатежам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РасчетыПоНаложеннымПлатежам.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО РасчетыПоНаложеннымПлатежам.Договор = ОбъектыРасчетов.Объект
	|		И ОбъектыРасчетов.ТипРасчетов = Значение(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО РасчетыПоНаложеннымПлатежам.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК ДокСводЗаявок
	|		ПО РасчетыПоНаложеннымПлатежам.СводЗаявок = ДокСводЗаявок.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Кассы КАК Кассы
	|		ПО РасчетыПоНаложеннымПлатежам.Организация = Кассы.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуществующиеЗаявкиНаРасходованиеДС КАК СуществующиеЗаявкиНаРасходованиеДС
	|		ПО РасчетыПоНаложеннымПлатежам.СводЗаявок = СуществующиеЗаявкиНаРасходованиеДС.СводЗаявок
	|ГДЕ
	|	(РасчетыПоНаложеннымПлатежам.Сумма <> 0
	|			ИЛИ РасчетыПоНаложеннымПлатежам.СуммаВозврата <> 0)
	|   И НЕ РасчетыПоНаложеннымПлатежам.Организация = &ПустаяОрганизация
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСвода,
	|	Сумма
	|ИТОГИ ПО
	|	АналитикаУчетаПоПартнерам,
	|	ЭтоВозврат";
	
	Если Параметры.Свойство("Партнер") Тогда
		Запрос.УстановитьПараметр("Партнер", Параметры.Партнер);
		ТекстОтбораПоПартнеру = "АналитикаУчетаПоПартнерам.Партнер = &Партнер";
	Иначе
		ТекстОтбораПоПартнеру = "ИСТИНА";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтбораПоПартнеру", ТекстОтбораПоПартнеру);
	
	ПриоритетОплаты = Справочники.ПриоритетыОплаты.ПолучитьПриоритетПоУмолчанию(Неопределено);
	ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
							
	СтруктураПересчетаСуммы = Новый Структура;
	СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ДатаДокумента = ?(НачалоДня(ТекущаяДата) = НачалоДня(Параметры.Период), ТекущаяДата, КонецДня(Параметры.Период));
	
	ВыборкаАналитикаУчетаПоПартнерам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаАналитикаУчетаПоПартнерам.Следующий() Цикл
		
		ВыборкаВозврат = ВыборкаАналитикаУчетаПоПартнерам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВозврат.Следующий() Цикл
			
			ЗаявкаНаРасходованиеДС = Неопределено;
			ПризнакДоплатПоСводам = Новый Соответствие();
			НаименованиеДоговора = "";
			ТекущаяКасса = Неопределено;
			ТекущийБанковскийСчет = Неопределено;
			
			Выборка = ВыборкаВозврат.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Если ЗаявкаНаРасходованиеДС = Неопределено Тогда
				
					ЗаявкаНаРасходованиеДС = Документы.ЗаявкаНаРасходованиеДенежныхСредств.СоздатьДокумент();
					ЗаявкаНаРасходованиеДС.Дата = ДатаДокумента;
					ЗаявкаНаРасходованиеДС.Организация = Выборка.Организация;
					ЗаявкаНаРасходованиеДС.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована;
					Если Выборка.ЭтоВозврат Тогда
						ЗаявкаНаРасходованиеДС.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту;
					Иначе
						ЗаявкаНаРасходованиеДС.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику;
					КонецЕсли;
					ЗаявкаНаРасходованиеДС.Валюта = Выборка.Валюта;
					ЗаявкаНаРасходованиеДС.ФормаОплатыНаличная = (Выборка.Организация = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ОрганизацияЛогсис());
					ЗаявкаНаРасходованиеДС.ФормаОплатыБезналичная = Не ЗаявкаНаРасходованиеДС.ФормаОплатыНаличная;
					ЗаявкаНаРасходованиеДС.БанковскийСчет = Выборка.БанковскийСчет;
					ЗаявкаНаРасходованиеДС.Касса = Выборка.Касса;
					ЗаявкаНаРасходованиеДС.Контрагент = Выборка.Контрагент;
					ЗаявкаНаРасходованиеДС.БанковскийСчетКонтрагента = Выборка.БанковскийСчетКонтрагента;
					ЗаявкаНаРасходованиеДС.Подразделение = Выборка.Подразделение;
					ЗаявкаНаРасходованиеДС.КтоЗаявил = Пользователи.ТекущийПользователь();
					ЗаявкаНаРасходованиеДС.Автор = ЗаявкаНаРасходованиеДС.КтоЗаявил;
					ЗаявкаНаРасходованиеДС.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДвиженияДенежныхСредств;
					ЗаявкаНаРасходованиеДС.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа;
					//2,5,7//ЗаявкаНаРасходованиеДС.ВариантОплаты = Перечисления.ВариантыОплатыПоставщику.ПредоплатаДоПоступления;
					ЗаявкаНаРасходованиеДС.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления;
					ЗаявкаНаРасходованиеДС.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ИнойПлатеж;
					ЗаявкаНаРасходованиеДС.ПриоритетОплаты = ПриоритетОплаты;
					
					ЗаявкаНаРасходованиеДС.ДополнительныеСвойства.Вставить("ДатаПоследнейЗаявки", Выборка.ДатаПоследнейЗаявки);
					ЗаявкаНаРасходованиеДС.ДополнительныеСвойства.Вставить("АналитикаУчетаПоПартнерам", Выборка.АналитикаУчетаПоПартнерам);
					
				КонецЕсли;
				
				НаименованиеДоговора = Выборка.НаименованиеДоговора;
				
				СтрокаРаспределения = ЗаявкаНаРасходованиеДС.Логс_РаспределениеПоСводамЗаявокНаДоставкуДвижения.Добавить();
				СтрокаРаспределения.СводЗаявок = Выборка.СводЗаявок;
				СтрокаРаспределения.ЭтоВозврат = Выборка.ЭтоВозврат;
				СтрокаРаспределения.Сумма = Выборка.Сумма;
				
				ПризнакДоплатПоСводам.Вставить(Выборка.СводЗаявок, Выборка.Доплата);
				
				
				//Правка от 13.05.2021
				//переделываем сроки:
				//3.	Вт/ПТ и Ежедневно+2 раб дня –это +2 рабочих дня от даты свода
				//		СР/ПН-+3 рабочих дня от даты свода
				
				////старая версия:
				//Если Выборка.СрокПеречисленияНП = Перечисления.Логс_СрокиПеречисленияНП.Ежедневно
				//		И Выборка.ПериодФормированияОтчетов = Перечисления.Логс_ПериодыФормированияСводовАгентов.ДваРазаВНеделю Тогда
				//		
				//	лСрокПеречисления = Перечисления.Логс_СрокиПеречисленияНП.ПлатежныйДень;
				//Иначе
				//	лСрокПеречисления = Выборка.СрокПеречисленияНП;
				//КонецЕсли;
				//Если лСрокПеречисления = Перечисления.Логс_СрокиПеречисленияНП.ПлатежныйДень или
				//		лСрокПеречисления = Перечисления.Логс_СрокиПеречисленияНП.ПлатежныйДеньСрПт Тогда
				//		ДатаПлатежа = Логс_ДатыПовтИсп.РассчитатьСдвигДаты(НачалоДня(ТекущаяДата())+24*60*60, лСрокПеречисления);
				//Иначе
				//	ДатаПлатежа = Логс_ДатыПовтИсп.РассчитатьСдвигДаты(Выборка.ДатаСвода, лСрокПеречисления);
				//КонецЕсли;
				
				////новая версия
				Если  Выборка.СрокПеречисленияНП = Перечисления.Логс_СрокиПеречисленияНП.ПлатежныйДень или
					     Выборка.СрокПеречисленияНП = Перечисления.Логс_СрокиПеречисленияНП.Ежедневно или
						 Выборка.СрокПеречисленияНП = Перечисления.Логс_СрокиПеречисленияНП.ПлатежныйДеньСрПт Тогда
						ДатаПлатежа = Логс_ДатыПовтИсп.РассчитатьСдвигДаты(Выборка.ДатаСвода,  Выборка.СрокПеречисленияНП);
				Иначе
					ДатаПлатежа = Логс_ДатыПовтИсп.РассчитатьСдвигДаты(Выборка.ДатаСвода,  Выборка.СрокПеречисленияНП);
				КонецЕсли;
				//конецправки
				
				ЗаявкаНаРасходованиеДС.ДатаПлатежа = ДатаПлатежа;
				ЗаявкаНаРасходованиеДС.ЖелательнаяДатаПлатежа = ДатаПлатежа;
				
				СтрокаПлатежа = ЗаявкаНаРасходованиеДС.РасшифровкаПлатежа.Добавить();
				СтрокаПлатежа.Партнер = Выборка.Партнер;
				СтрокаПлатежа.ОбъектРасчетов = Выборка.ОбъектРасчетов;
				Если Выборка.ЭтоВозврат Тогда
					СтрокаПлатежа.Сумма = Выборка.СуммаВозврата;
				Иначе
					СтрокаПлатежа.Сумма = Выборка.Сумма;
				КонецЕсли;
				
				ЗаявкаНаРасходованиеДС.ДатаПлатежа = Макс(ДатаПлатежа, ЗаявкаНаРасходованиеДС.ДатаПлатежа);
				
				СтрокаПлатежа.ВалютаВзаиморасчетов = Выборка.Валюта;
				СтрокаПлатежа.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДвиженияДенежныхСредств; 
				СтрокаПлатежа.Организация = Выборка.Организация;
				СтрокаПлатежа.СтавкаНДС = Выборка.СтавкаНДС;
				
				//++ Ким Виктор 10.12.2025
				//Фикс после обновления
				//ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаПлатежа, СтруктураДействий, КэшированныеЗначения);
				ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаПлатежа, СтруктураДействий, КэшированныеЗначения);
				//-- Ким Виктор 10.12.2025
				
				ТекущаяКасса = Выборка.Касса;
				ТекущийБанковскийСчет =  Выборка.БанковскийСчет;
			КонецЦикла; // Своды
			
			Если ЗаявкаНаРасходованиеДС <> Неопределено Тогда
				
				Если ЗаявкаНаРасходованиеДС.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту Тогда
					ШаблонНазначенияПлатежа = НСтр("ru='Возврат излишне перечисленных сумм по %1 по : '");
					ШаблонНазначенияПлатежаПоСводу = НСтр("ru='отчет №%1 от %2'");
					
					НазначениеПлатежа = СтрШаблон(ШаблонНазначенияПлатежа, НаименованиеДоговора);
					
					Для каждого СтрокаОстатков Из ЗаявкаНаРасходованиеДС.Логс_РаспределениеПоСводамЗаявокНаДоставкуДвижения Цикл
						НоваяСтрока = ЗаявкаНаРасходованиеДС.Логс_РаспределениеПоСводамЗаявокНаДоставку.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаОстатков);
						НазначениеПлатежа = НазначениеПлатежа + СтрШаблон(ШаблонНазначенияПлатежаПоСводу, НоваяСтрока.СводЗаявок.Номер, НоваяСтрока.СводЗаявок.Дата);
					КонецЦикла;
				Иначе
					ЗаполнитьРаспределениеНП_ПоСводам(ЗаявкаНаРасходованиеДС, ПризнакДоплатПоСводам);
				КонецЕсли; 
				
				СтрокаБанковскогоСчета = ЗаявкаНаРасходованиеДС.РаспределениеПоСчетам.Добавить();
				СтрокаБанковскогоСчета.БанковскийСчетКасса = ?(ЗаявкаНаРасходованиеДС.ФормаОплатыНаличная, ТекущаяКасса, ТекущийБанковскийСчет);
				СтрокаБанковскогоСчета.Сумма = ЗаявкаНаРасходованиеДС.Логс_РаспределениеПоСводамЗаявокНаДоставкуДвижения.Итог("Сумма");
				СтрокаБанковскогоСчета.ДатаПлатежа = ЗаявкаНаРасходованиеДС.ДатаПлатежа;
				
				ЗаявкаНаРасходованиеДС.СуммаДокумента = ЗаявкаНаРасходованиеДС.Логс_РаспределениеПоСводамЗаявокНаДоставкуДвижения.Итог("Сумма");
				
				ЗаявкаНаРасходованиеДС.УстановитьНовыйНомер();
				ЗаявкаНаРасходованиеДС.Записать(РежимЗаписиДокумента.Запись);
				
				Попытка
					ЗаявкаНаРасходованиеДС.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					ТекстСообщения = СтрШаблон(
						НСтр("ru='Произошла ошибка при записи заявки на расходование денежных средств по своду заявок на доставку № %1 от %2: %3'"),
						Выборка.НомерСвода, Формат(Выборка.ДатаСвода, "ДФ=dd.MM.yyyy"),
						КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание заявок на расходование ДС",
						УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
					БылиОшибки = Истина;
				КонецПопытки;
				
				ЗаявкаНаРасходованиеДС = Неопределено;
				
			КонецЕсли;
			
		КонецЦикла; // Возврат
	КонецЦикла;
	
КонецФункции

Процедура ЗаполнитьРаспределениеНП_ПоСводам(ЗаявкаНаРасходованиеДС, ПризнакДоплатПоСводам)
	
	АналитикаУчетаПоПартнерам = ЗаявкаНаРасходованиеДС.ДополнительныеСвойства.АналитикаУчетаПоПартнерам;
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВложенныйЗапрос.СводЗаявок КАК СводЗаявок,
	|	ВложенныйЗапрос.СуммаНаложенногоПлатежаОборотПоЗаявке + ВложенныйЗапрос.СуммаНаложенногоПлатежаОстаток КАК Сумма
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВЫБОР
	|			КОГДА Логс_ВзаиморасчетыЗаВычетом.СводЗаявок <> Логс_ВзаиморасчетыЗаВычетом.КоррСводЗаявок
	|				ТОГДА Логс_ВзаиморасчетыЗаВычетом.КоррСводЗаявок
	|			ИНАЧЕ Логс_ВзаиморасчетыЗаВычетом.СводЗаявок
	|		КОНЕЦ КАК СводЗаявок,
	|		СУММА(Логс_ВзаиморасчетыЗаВычетом.СуммаНаложенногоПлатежа * ВЫБОР
	|				КОГДА Логс_ВзаиморасчетыЗаВычетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					ТОГДА -1
	|				ИНАЧЕ 1
	|			КОНЕЦ) КАК СуммаНаложенногоПлатежаОборотПоЗаявке,
	|		0 КАК СуммаНаложенногоПлатежаОстаток
	|	ИЗ
	|		РегистрНакопления.Логс_ВзаиморасчетыЗаВычетом КАК Логс_ВзаиморасчетыЗаВычетом
	|	ГДЕ
	|		Логс_ВзаиморасчетыЗаВычетом.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
	|		И Логс_ВзаиморасчетыЗаВычетом.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Логс_ВзаиморасчетыЗаВычетом.СводЗаявок,
	|		ВЫБОР
	|			КОГДА Логс_ВзаиморасчетыЗаВычетом.СводЗаявок <> Логс_ВзаиморасчетыЗаВычетом.КоррСводЗаявок
	|				ТОГДА Логс_ВзаиморасчетыЗаВычетом.КоррСводЗаявок
	|			ИНАЧЕ Логс_ВзаиморасчетыЗаВычетом.СводЗаявок
	|		КОНЕЦ
	|	
	|	ИМЕЮЩИЕ
	|		СУММА(Логс_ВзаиморасчетыЗаВычетом.СуммаНаложенногоПлатежа * ВЫБОР
	|				КОГДА Логс_ВзаиморасчетыЗаВычетом.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
	|					ТОГДА -1
	|				ИНАЧЕ 1
	|			КОНЕЦ) <> 0
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок,
	|		0,
	|		Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаНаложенногоПлатежаОстаток
	|	ИЗ
	|		РегистрНакопления.Логс_ВзаиморасчетыЗаВычетом.Остатки(&ДатаНачала, АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам) КАК Логс_ВзаиморасчетыЗаВычетомОстатки
	|	ГДЕ
	|		Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаНаложенногоПлатежаОстаток > 0) КАК ВложенныйЗапрос
	|ГДЕ
	|	ВложенныйЗапрос.СуммаНаложенногоПлатежаОборотПоЗаявке + ВложенныйЗапрос.СуммаНаложенногоПлатежаОстаток <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВложенныйЗапрос.СводЗаявок.Дата");
	ДатаНачала = ЗаявкаНаРасходованиеДС.ДополнительныеСвойства.ДатаПоследнейЗаявки;
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала + 1);
	Запрос.УстановитьПараметр("ДатаОкончания", ЗаявкаНаРасходованиеДС.Дата);
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", АналитикаУчетаПоПартнерам);
	ТаблицаРезультат = Запрос.Выполнить().Выгрузить();
	Для каждого СтрокаРезультата Из ТаблицаРезультат Цикл
		НоваяСтрока = ЗаявкаНаРасходованиеДС.Логс_РаспределениеПоСводамЗаявокНаДоставку.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультата);
	КонецЦикла;
	
	Если АналитикаУчетаПоПартнерам.Договор.Логс_ВидКлиентаCRM = Перечисления.Логс_ВидыКлиентовCRM.Принципал Тогда
		ШаблонНазначенияПлатежа = НСтр("ru='Наложенный платеж за вычетом агентского возн-ния по %1 по:'");
	Иначе
		ШаблонНазначенияПлатежа = НСтр("ru='Наложенный платеж за вычетом субагентского возн-ния по %1 по:'");
	КонецЕсли;
	ШаблонНазначенияПлатежаПоСводу = НСтр("ru=' отчет №%1 от %2'");
	ШаблонНазначенияПлатежаПоСводуДоплата = НСтр("ru=' (доплата) отчет №%1 от %2'");
	
	НазначениеПлатежа = СтрШаблон(ШаблонНазначенияПлатежа, АналитикаУчетаПоПартнерам.Договор.НаименованиеДляПечати);
	
	МассивСводов = ОбщегоНазначенияКлиентСервер.СвернутьМассив(ТаблицаРезультат.ВыгрузитьКолонку("СводЗаявок"));
	
	Для каждого ТекущийСвод Из МассивСводов Цикл
		Отбор = Новый Структура("СводЗаявок", ТекущийСвод);
		Если ПризнакДоплатПоСводам.Получить(ТекущийСвод) <> Неопределено И ПризнакДоплатПоСводам.Получить(ТекущийСвод) Тогда
			ТекущийШаблонПоСводу = ШаблонНазначенияПлатежаПоСводуДоплата;
		ИНаче
			ТекущийШаблонПоСводу = ШаблонНазначенияПлатежаПоСводу;
		КонецЕсли;
		
		МассивСтрок = ТаблицаРезультат.НайтиСтроки(Отбор);
		Для каждого СтрокаТаблицы Из МассивСтрок Цикл
			Если СтрокаТаблицы.Сумма > 0 Тогда
				НазначениеПлатежа = НазначениеПлатежа + СтрШаблон(ТекущийШаблонПоСводу, СтрокаТаблицы.СводЗаявок.Номер, Формат(СтрокаТаблицы.СводЗаявок.Дата, "ДФ=dd.MM.yyyy"));
			Иначе
				НазначениеПлатежа = НазначениеПлатежа + СтрШаблон(НСтр("ru=', кор-ка по отчету %1 от %2'"), СтрокаТаблицы.СводЗаявок.Номер, СтрокаТаблицы.СводЗаявок.Дата);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	ЗаявкаНаРасходованиеДС.НазначениеПлатежа = НазначениеПлатежа;
	
КонецПроцедуры
 
Функция СоздатьЗаявкиНаРасходованиеДенежныхСредств20(Параметры, СписокОшибок = Неопределено)
	Перем КэшированныеЗначения;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Период", КонецДня(Параметры.Период));
	Запрос.УстановитьПараметр("СрокиПеречисленияНП", Параметры.СрокиПеречисленияНП);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Логс_ЗаявкиНаРасход100Остатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Логс_ЗаявкиНаРасход100Остатки.СводЗаявок КАК СводЗаявок,
	|	Логс_ЗаявкиНаРасход100Остатки.Валюта КАК Валюта,
	|	Логс_ЗаявкиНаРасход100Остатки.СуммаОстаток КАК Сумма
	|ПОМЕСТИТЬ РасчетыПоНаложеннымПлатежамОстатки
	|ИЗ
	|	РегистрНакопления.Логс_ЗаявкиНаРасход100.Остатки(
	|			,
	|			СводЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.Оплата100)
	|				И (АналитикаУчетаПоПартнерам.Договор.Логс_СрокПеречисленияНП В (&СрокиПеречисленияНП)
	|					ИЛИ АналитикаУчетаПоПартнерам.Договор.Логс_СрокПеречисленияНПРег В (&СрокиПеречисленияНП))
	|				И НЕ СводЗаявок.Организация.Логс_НеФормироватьРеглДокументы
	|				И СводЗаявок.Дата <= &Период
	|				И СводЗаявок.ВидКлиента <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.СКС)
	|				И &ТекстОтбораПоПартнеру) КАК Логс_ЗаявкиНаРасход100Остатки
	|ГДЕ
	|	Логс_ЗаявкиНаРасход100Остатки.СуммаОстаток <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Аналитика.Организация КАК Организация,
	|	Аналитика.Партнер КАК Партнер,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор
	|ПОМЕСТИТЬ ИспользуемаяАналитика
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыПоНаложеннымПлатежам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|	ИЗ
	|		РасчетыПоНаложеннымПлатежамОстатки КАК РасчетыПоНаложеннымПлатежам
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасчетыПоНаложеннымПлатежам.АналитикаУчетаПоПартнерам
	|	
	|	ИМЕЮЩИЕ
	|		СУММА(РасчетыПоНаложеннымПлатежам.Сумма) <> 0) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ВложенныйЗапрос.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоНаложеннымПлатежам.СводЗаявок КАК СводЗаявок,
	|	РасчетыПоНаложеннымПлатежам.Валюта КАК Валюта,
	|	Аналитика.Организация КАК Организация,
	|	Аналитика.Партнер КАК Партнер,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор,
	|	РасчетыПоНаложеннымПлатежам.Сумма КАК Сумма
	|ПОМЕСТИТЬ РасчетыПоНаложеннымПлатежам
	|ИЗ
	|	РасчетыПоНаложеннымПлатежамОстатки КАК РасчетыПоНаложеннымПлатежам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИспользуемаяАналитика КАК Аналитика
	|		ПО РасчетыПоНаложеннымПлатежам.АналитикаУчетаПоПартнерам = Аналитика.АналитикаУчетаПоПартнерам
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СводЗаявок,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РасчетыПоНаложеннымПлатежамОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИспользуемаяАналитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Кассы.Владелец КАК Организация,
	|	МАКСИМУМ(Кассы.Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ Кассы
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	Кассы.Владелец В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				РасчетыПоНаложеннымПлатежам.Организация
	|			ИЗ
	|				РасчетыПоНаложеннымПлатежам)
	|	И НЕ Кассы.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Кассы.Владелец
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РаспределениеПоСводамЗаявок.СводЗаявок КАК СводЗаявок
	|ПОМЕСТИТЬ СуществующиеЗаявкиНаРасходованиеДС
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК РаспределениеПоСводамЗаявок
	|ГДЕ
	|	РаспределениеПоСводамЗаявок.СводЗаявок В
	|			(ВЫБРАТЬ
	|				РасчетыПоНаложеннымПлатежам.СводЗаявок
	|			ИЗ
	|				РасчетыПоНаложеннымПлатежам)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	РаспределениеПоСводамЗаявок.СводЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДокСводЗаявок.Дата КАК ДатаСвода,
	|	ДокСводЗаявок.Номер КАК НомерСвода,
	|	ДокСводЗаявок.ФормаОплаты КАК ФормаОплаты,
	|	РасчетыПоНаложеннымПлатежам.Организация КАК Организация,
	|	РасчетыПоНаложеннымПлатежам.Партнер КАК Партнер,
	|	РасчетыПоНаложеннымПлатежам.Контрагент КАК Контрагент,
	|	РасчетыПоНаложеннымПлатежам.Договор КАК Договор,
	|	ДоговорыКонтрагентов.НаименованиеДляПечати КАК НаименованиеДоговора,
	|	ДоговорыКонтрагентов.Логс_ВидКлиентаCRM КАК ВидКлиента,
	|	ВЫБОР
	|		КОГДА ДокСводЗаявок.РегиональныйСвод
	|			ТОГДА ДоговорыКонтрагентов.Логс_СрокПеречисленияНПРег
	|		ИНАЧЕ ДоговорыКонтрагентов.Логс_СрокПеречисленияНП
	|	КОНЕЦ КАК СрокПеречисленияНП,
	|	ВЫБОР
	|		КОГДА ДокСводЗаявок.РегиональныйСвод
	|			ТОГДА ДоговорыКонтрагентов.Логс_ПериодФормированияСводовАгентаРег
	|		ИНАЧЕ ДоговорыКонтрагентов.Логс_ПериодФормированияСводовАгента
	|	КОНЕЦ КАК ПериодФормированияОтчетов,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.Ссылка ЕСТЬ NULL
	|				ИЛИ ДоговорыКонтрагентов.Логс_ПриоритетныйСчетОплаты = ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА Организации.Логс_ОсновнойБанковскийСчет
	|		ИНАЧЕ ДоговорыКонтрагентов.Логс_ПриоритетныйСчетОплаты
	|	КОНЕЦ КАК БанковскийСчет,
	|	ДоговорыКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ДоговорыКонтрагентов.Подразделение КАК Подразделение,
	|	ДоговорыКонтрагентов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ДоговорыКонтрагентов.СтавкаНДС КАК СтавкаНДС,
	|	Кассы.Ссылка КАК Касса,
	|	РасчетыПоНаложеннымПлатежам.СводЗаявок КАК СводЗаявок,
	|	РасчетыПоНаложеннымПлатежам.Валюта КАК Валюта,
	|	РасчетыПоНаложеннымПлатежам.Сумма КАК Сумма,
	|	НЕ СуществующиеЗаявкиНаРасходованиеДС.СводЗаявок ЕСТЬ NULL КАК Доплата
	|
	|ПОМЕСТИТЬ ВТ_ДанныеДляЗаявок
	|ИЗ
	|	РасчетыПоНаложеннымПлатежам КАК РасчетыПоНаложеннымПлатежам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РасчетыПоНаложеннымПлатежам.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО РасчетыПоНаложеннымПлатежам.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК ДокСводЗаявок
	|		ПО РасчетыПоНаложеннымПлатежам.СводЗаявок = ДокСводЗаявок.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Кассы КАК Кассы
	|		ПО РасчетыПоНаложеннымПлатежам.Организация = Кассы.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуществующиеЗаявкиНаРасходованиеДС КАК СуществующиеЗаявкиНаРасходованиеДС
	|		ПО РасчетыПоНаложеннымПлатежам.СводЗаявок = СуществующиеЗаявкиНаРасходованиеДС.СводЗаявок
	|;
	|Выбрать Различные
	|	ВТ_ДанныеДляЗаявок.ДатаСвода КАК ДатаСвода,  
	|	ДатаВремя(1,1,1,0,0,0) КАК ДатаПлатежа,  
	|	ВТ_ДанныеДляЗаявок.СрокПеречисленияНП КАК СрокПеречисленияНП  
	|Из ВТ_ДанныеДляЗаявок как ВТ_ДанныеДляЗаявок
	|"; 
	
	Если Параметры.Свойство("Партнер") Тогда
		Запрос.УстановитьПараметр("Партнер", Параметры.Партнер);
		ТекстОтбораПоПартнеру = "АналитикаУчетаПоПартнерам.Партнер = &Партнер";
	Иначе
		ТекстОтбораПоПартнеру = "ИСТИНА";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтбораПоПартнеру", ТекстОтбораПоПартнеру);
	
	ТаблицаСроковПеречисленияНП = Запрос.Выполнить().Выгрузить();
	Для Каждого Строка из ТаблицаСроковПеречисленияНП Цикл
		Строка.ДатаПлатежа = Логс_ДатыПовтИсп.РассчитатьСдвигДаты(Строка.ДатаСвода,  Строка.СрокПеречисленияНП);
	КонецЦикла;
	
	Запрос.УстановитьПараметр("СрокиПлатежей", ТаблицаСроковПеречисленияНП);
	Запрос.Текст = "
	|Выбрать 
	|	СрокиПлатежей.ДатаСвода КАК ДатаСвода,  
	|	СрокиПлатежей.ДатаПлатежа КАК ДатаПлатежа,  
	|	СрокиПлатежей.СрокПеречисленияНП КАК СрокПеречисленияНП  
	|Поместить ВТ_СрокиПлатежей
	|Из &СрокиПлатежей как СрокиПлатежей
	|;
	|ВЫБРАТЬ
	|	ВТ_ДанныеДляЗаявок.ДатаСвода КАК ДатаСвода,
	|	ВТ_ДанныеДляЗаявок.НомерСвода КАК НомерСвода,
	|	ВТ_ДанныеДляЗаявок.ФормаОплаты КАК ФормаОплаты,
	|	ВТ_ДанныеДляЗаявок.Организация КАК Организация,
	|	ВТ_ДанныеДляЗаявок.Партнер КАК Партнер,
	|	ВТ_ДанныеДляЗаявок.Контрагент КАК Контрагент,
	|	ВТ_ДанныеДляЗаявок.Договор КАК Договор,
	|	ВТ_ДанныеДляЗаявок.НаименованиеДоговора КАК НаименованиеДоговора,
	|	ВТ_ДанныеДляЗаявок.ВидКлиента КАК ВидКлиента,
	|	ВТ_ДанныеДляЗаявок.СрокПеречисленияНП КАК СрокПеречисленияНП,
	|	ВТ_ДанныеДляЗаявок.ПериодФормированияОтчетов КАК ПериодФормированияОтчетов,
	|	ВТ_ДанныеДляЗаявок.БанковскийСчет КАК БанковскийСчет,
	|	ВТ_ДанныеДляЗаявок.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ВТ_ДанныеДляЗаявок.Подразделение КАК Подразделение,
	|	ВТ_ДанныеДляЗаявок.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ВТ_ДанныеДляЗаявок.СтавкаНДС КАК СтавкаНДС,
	|	ВТ_ДанныеДляЗаявок.Касса КАК Касса,
	|	ВТ_ДанныеДляЗаявок.СводЗаявок КАК СводЗаявок,
	|	ВТ_ДанныеДляЗаявок.Валюта КАК Валюта,
	|	ВТ_ДанныеДляЗаявок.Сумма КАК Сумма,
	|	ВТ_ДанныеДляЗаявок.Доплата КАК Доплата,
	|	ВТ_СрокиПлатежей.ДатаПлатежа КАК ДатаПлатежа,  
	|	ВЫБОР
	|		КОГДА ВТ_ДанныеДляЗаявок.Договор.Логс_ГруппироватьСводыВЗаявкахНаОплату
	|			ТОГДА ВТ_СрокиПлатежей.ДатаПлатежа
	|		ИНАЧЕ ВТ_ДанныеДляЗаявок.СводЗаявок
	|	КОНЕЦ КАК СпособГруппировкиЗаявок,
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	ВТ_ДанныеДляЗаявок КАК ВТ_ДанныеДляЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СрокиПлатежей КАК ВТ_СрокиПлатежей
	|		ПО ВТ_ДанныеДляЗаявок.ДатаСвода = ВТ_СрокиПлатежей.ДатаСвода
	|		и ВТ_ДанныеДляЗаявок.СрокПеречисленияНП = ВТ_СрокиПлатежей.СрокПеречисленияНП
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО ВТ_ДанныеДляЗаявок.Договор = ОбъектыРасчетов.Объект
	|		И ОбъектыРасчетов.ТипРасчетов = Значение(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСвода,
	|	Сумма
	|ИТОГИ ПО
	|	Организация,
	|	Партнер,
	|	Контрагент, СпособГруппировкиЗаявок,
	|	Договор, 
	|	Валюта";
	
	
	ПриоритетОплаты = Справочники.ПриоритетыОплаты.ПолучитьПриоритетПоУмолчанию(Неопределено);
	ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
							
	СтруктураПересчетаСуммы = Новый Структура;
	СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ДатаДокумента = ?(НачалоДня(ТекущаяДата) = НачалоДня(Параметры.Период), ТекущаяДата, КонецДня(Параметры.Период));
	
	ВыборкаОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизации.Следующий() Цикл
		ВыборкаПартнеры = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПартнеры.Следующий() Цикл
			ВыборкаКонтрагенты = ВыборкаПартнеры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагенты.Следующий() Цикл
				ВыборкаДата = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); //СпособГруппировкиЗаявок
				Пока ВыборкаДата.Следующий() Цикл //СпособГруппировкиЗаявок  
					ВыборкаДоговоры = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаДоговоры.Следующий() Цикл
						ВыборкаВалюты = ВыборкаДоговоры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаВалюты.Следующий() Цикл
							
							ЗаявкаНаРасходованиеДС = Неопределено;
							
							Выборка = ВыборкаВалюты.Выбрать();
							Пока Выборка.Следующий() Цикл    //проходим выборку сводов, по окончанию запишем удачный документ
								
								Если ЗаявкаНаРасходованиеДС = Неопределено Тогда   //заполним новый документ (заявка на расходование ДС)
								
									ЗаявкаНаРасходованиеДС = Документы.ЗаявкаНаРасходованиеДенежныхСредств.СоздатьДокумент();
									ЗаявкаНаРасходованиеДС.Дата = ДатаДокумента;
									ЗаявкаНаРасходованиеДС.Организация = Выборка.Организация;
									ЗаявкаНаРасходованиеДС.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована;
									ЗаявкаНаРасходованиеДС.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ОплатаПоставщику;
									ЗаявкаНаРасходованиеДС.Валюта = Выборка.Валюта;
									ЗаявкаНаРасходованиеДС.ФормаОплатыНаличная = (Выборка.Организация = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ОрганизацияЛогсис());
									ЗаявкаНаРасходованиеДС.ФормаОплатыБезналичная = Не ЗаявкаНаРасходованиеДС.ФормаОплатыНаличная;
									ЗаявкаНаРасходованиеДС.БанковскийСчет = Выборка.БанковскийСчет;
									ЗаявкаНаРасходованиеДС.Касса = Выборка.Касса;
									ЗаявкаНаРасходованиеДС.Контрагент = Выборка.Контрагент;
									ЗаявкаНаРасходованиеДС.БанковскийСчетКонтрагента = Выборка.БанковскийСчетКонтрагента;
									ЗаявкаНаРасходованиеДС.Подразделение = Выборка.Подразделение;
									ЗаявкаНаРасходованиеДС.КтоЗаявил = Пользователи.ТекущийПользователь();
									ЗаявкаНаРасходованиеДС.Автор = ЗаявкаНаРасходованиеДС.КтоЗаявил;
									ЗаявкаНаРасходованиеДС.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДвиженияДенежныхСредств;
									ЗаявкаНаРасходованиеДС.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа;
									ЗаявкаНаРасходованиеДС.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления;
									ЗаявкаНаРасходованиеДС.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ИнойПлатеж;
									ЗаявкаНаРасходованиеДС.ПриоритетОплаты = ПриоритетОплаты;
									ЗаявкаНаРасходованиеДС.ДатаПлатежа = Выборка.ДатаПлатежа;
									ЗаявкаНаРасходованиеДС.ЖелательнаяДатаПлатежа = Выборка.ДатаПлатежа;
									
									Если Выборка.ФормаОплаты = Перечисления.Логс_ФормыОплатыУслугАгенту.Оплата100 Тогда
										ШаблонНазначенияПлатежа = ?(Выборка.Доплата,
											НСтр("ru='Наложенный платеж (доплата) по %1'"),
											НСтр("ru='Наложенный платеж по %1'"));
									ИначеЕсли Выборка.ВидКлиента = Перечисления.Логс_ВидыКлиентовCRM.Принципал Тогда
										ШаблонНазначенияПлатежа = ?(Выборка.Доплата,
											НСтр("ru='Наложенный платеж (доплата) за вычетом агентского возн-ния по %1'"),
											НСтр("ru='Наложенный платеж за вычетом агентского возн-ния по %1'"));
									Иначе
										ШаблонНазначенияПлатежа = ?(Выборка.Доплата,
											НСтр("ru='Наложенный платеж (доплата) за вычетом субагентского возн-ния по %1'"),
											НСтр("ru='Наложенный платеж за вычетом субагентского возн-ния по %1'"));
									КонецЕсли; 
									
									НазначениеПлатежа = СтрШаблон(ШаблонНазначенияПлатежа, Выборка.НаименованиеДоговора);
									НазначениеПлатежаКорректировка = "";
									
									//ТЧ
									СтрокаПлатежа = ЗаявкаНаРасходованиеДС.РасшифровкаПлатежа.Добавить();
									СтрокаПлатежа.Партнер = Выборка.Партнер;
									СтрокаПлатежа.ОбъектРасчетов = Выборка.ОбъектРасчетов;
									СтрокаПлатежа.Сумма = 0;
									СтрокаПлатежа.ВалютаВзаиморасчетов = Выборка.Валюта;
									СтрокаПлатежа.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДвиженияДенежныхСредств; 
									СтрокаПлатежа.Организация = Выборка.Организация;
									СтрокаПлатежа.СтавкаНДС = Выборка.СтавкаНДС;
									
									СтрокаБанковскогоСчета = ЗаявкаНаРасходованиеДС.РаспределениеПоСчетам.Добавить();
									СтрокаБанковскогоСчета.БанковскийСчетКасса = ?(ЗаявкаНаРасходованиеДС.ФормаОплатыНаличная, Выборка.Касса, Выборка.БанковскийСчет);
									СтрокаБанковскогоСчета.Сумма = 0;
									СтрокаБанковскогоСчета.ДатаПлатежа = ЗаявкаНаРасходованиеДС.ДатаПлатежа;
									
									СуммаВсего = 0;
									
								КонецЕсли; 
								
								СтрокаРаспределения = ЗаявкаНаРасходованиеДС.Логс_РаспределениеПоСводамЗаявокНаДоставку.Добавить();
								СтрокаРаспределения.СводЗаявок = Выборка.СводЗаявок;
								СтрокаРаспределения.Сумма = Выборка.Сумма;
								
								СуммаВсего = СуммаВсего + СтрокаРаспределения.Сумма;
								
								Если СтрокаРаспределения.Сумма >= 0 Тогда
									НазначениеПлатежаКорректировка = НазначениеПлатежаКорректировка +
										СтрШаблон(НСтр("ru=', по отчету %1 от %2'"),
											Выборка.НомерСвода, Формат(Выборка.ДатаСвода, "ДФ='dd.MM.yy""г.""'")
										);
								Иначе
									ДанныеСвода = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаРаспределения.СводЗаявок, "Номер,Дата");
									НазначениеПлатежаКорректировка = НазначениеПлатежаКорректировка +
										СтрШаблон(НСтр("ru=', кор-ка по отчету %1 от %2'"),
											Выборка.НомерСвода, Формат(Выборка.ДатаСвода, "ДФ='dd.MM.yy""г.""'")
										);
								КонецЕсли; 
								
							КонецЦикла; //своды	(конец выборки)
							
							Если СуммаВсего > 0 Тогда  //запись заявки на расходование
									
								Если НазначениеПлатежаКорректировка <> "" Тогда
									НазначениеПлатежа = НазначениеПлатежа + НазначениеПлатежаКорректировка;
								КонецЕсли; 	
								
								ЗаявкаНаРасходованиеДС.НазначениеПлатежа = НазначениеПлатежа;
								ЗаявкаНаРасходованиеДС.СуммаДокумента = СуммаВсего;
								
								//СтрокаПлатежа = ЗаявкаНаРасходованиеДС.РасшифровкаПлатежа.Добавить();
								СтрокаПлатежа.Сумма = СуммаВсего;   
								//++ Ким Виктор 10.12.2025
								//Фикс после обновления
								//ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаПлатежа, СтруктураДействий, КэшированныеЗначения);
								ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаПлатежа, СтруктураДействий, КэшированныеЗначения);
								//-- Ким Виктор 10.12.2025
											
								//СтрокаБанковскогоСчета = ЗаявкаНаРасходованиеДС.РаспределениеПоСчетам.Добавить();
								СтрокаБанковскогоСчета.Сумма = СуммаВсего;
								
								ЗаявкаНаРасходованиеДС.УстановитьНовыйНомер();
								ЗаявкаНаРасходованиеДС.Записать(РежимЗаписиДокумента.Запись);
								
								Попытка
									ЗаявкаНаРасходованиеДС.Записать(РежимЗаписиДокумента.Проведение);
								Исключение
									ТекстСообщения = СтрШаблон(
										НСтр("ru='Произошла ошибка при записи заявки на расходование денежных средств по своду заявок на доставку № %1 от %2: %3'"),
										Выборка.НомерСвода, Формат(Выборка.ДатаСвода, "ДФ=dd.MM.yyyy"),
										КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
									ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание заявок на расходование ДС",
										УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
									БылиОшибки = Истина;
								КонецПопытки;
								
								ЗаявкаНаРасходованиеДС = Неопределено;
								
							КонецЕсли; 
								
						
						КонецЦикла; // Валюты
					КонецЦикла; // Договоры
				КонецЦикла; // Дата
			КонецЦикла; // Контрагенты
		КонецЦикла; // Партнеры
	КонецЦикла; // Организации
	
	// формируем заявки на расход ДС на возврат переплаты
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", КонецДня(Параметры.Период));
	Запрос.УстановитьПараметр("СрокиПеречисленияНП", Параметры.СрокиПеречисленияНП);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Логс_ВзаиморасчетыПоУслугам100.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Логс_ВзаиморасчетыПоУслугам100.Счет.Дата КАК Дата,
	|	Логс_ВзаиморасчетыПоУслугам100.Счет.Номер КАК Номер,
	|	Логс_ВзаиморасчетыПоУслугам100.Счет КАК Счет,
	|	Логс_ВзаиморасчетыПоУслугам100.Валюта КАК Валюта,
	|	Логс_ВзаиморасчетыПоУслугам100.ПредоплатаОстаток КАК Сумма
	|ПОМЕСТИТЬ РасчетыПоНаложеннымПлатежамОстатки
	|ИЗ
	|	РегистрНакопления.Логс_ВзаиморасчетыПоУслугам100.Остатки(
	|			,
	|			(АналитикаУчетаПоПартнерам.Договор.Логс_СрокПеречисленияНП В (&СрокиПеречисленияНП)
	|					ИЛИ АналитикаУчетаПоПартнерам.Договор.Логс_СрокПеречисленияНПРег В (&СрокиПеречисленияНП))
	|				И НЕ АналитикаУчетаПоПартнерам.Организация.Логс_НеФормироватьРеглДокументы
	|				И Счет.Дата <= &Период
	|				И Счет.Договор.Логс_ВидКлиентаCRM <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.СКС)
	|				И &ТекстОтбораПоПартнеру) КАК Логс_ВзаиморасчетыПоУслугам100
	|ГДЕ
	|	Логс_ВзаиморасчетыПоУслугам100.ПредоплатаОстаток <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Аналитика.Организация КАК Организация,
	|	Аналитика.Партнер КАК Партнер,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор
	|ПОМЕСТИТЬ ИспользуемаяАналитика
	|ИЗ
	|	(ВЫБРАТЬ
	|		РасчетыПоНаложеннымПлатежам.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|	ИЗ
	|		РасчетыПоНаложеннымПлатежамОстатки КАК РасчетыПоНаложеннымПлатежам
	|	
	|	СГРУППИРОВАТЬ ПО
	|		РасчетыПоНаложеннымПлатежам.АналитикаУчетаПоПартнерам
	|	
	|	ИМЕЮЩИЕ
	|		СУММА(РасчетыПоНаложеннымПлатежам.Сумма) <> 0) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО ВложенныйЗапрос.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	АналитикаУчетаПоПартнерам
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоНаложеннымПлатежам.Счет КАК Счет,
	|	РасчетыПоНаложеннымПлатежам.Дата КАК Дата,
	|	РасчетыПоНаложеннымПлатежам.Номер КАК Номер,
	|	РасчетыПоНаложеннымПлатежам.Валюта КАК Валюта,
	|	Аналитика.Организация КАК Организация,
	|	Аналитика.Партнер КАК Партнер,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор,
	|	РасчетыПоНаложеннымПлатежам.Сумма КАК Сумма
	|ПОМЕСТИТЬ РасчетыПоНаложеннымПлатежам
	|ИЗ
	|	РасчетыПоНаложеннымПлатежамОстатки КАК РасчетыПоНаложеннымПлатежам
	|		ЛЕВОЕ СОЕДИНЕНИЕ ИспользуемаяАналитика КАК Аналитика
	|		ПО РасчетыПоНаложеннымПлатежам.АналитикаУчетаПоПартнерам = Аналитика.АналитикаУчетаПоПартнерам
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет,
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РасчетыПоНаложеннымПлатежамОстатки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ИспользуемаяАналитика
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Кассы.Владелец КАК Организация,
	|	МАКСИМУМ(Кассы.Ссылка) КАК Ссылка
	|ПОМЕСТИТЬ Кассы
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|ГДЕ
	|	Кассы.Владелец В
	|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|				РасчетыПоНаложеннымПлатежам.Организация
	|			ИЗ
	|				РасчетыПоНаложеннымПлатежам)
	|	И НЕ Кассы.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Кассы.Владелец
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоНаложеннымПлатежам.Дата КАК Дата,
	|	РасчетыПоНаложеннымПлатежам.Номер КАК Номер,
	|	РасчетыПоНаложеннымПлатежам.Организация КАК Организация,
	|	РасчетыПоНаложеннымПлатежам.Партнер КАК Партнер,
	|	РасчетыПоНаложеннымПлатежам.Контрагент КАК Контрагент,
	|	РасчетыПоНаложеннымПлатежам.Договор КАК Договор,
	|	ДоговорыКонтрагентов.НаименованиеДляПечати КАК НаименованиеДоговора,
	|	ДоговорыКонтрагентов.Логс_ВидКлиентаCRM КАК ВидКлиента,
	|	Организации.Логс_ОсновнойБанковскийСчет КАК БанковскийСчет,
	|	ДоговорыКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ДоговорыКонтрагентов.Подразделение КАК Подразделение,
	|	ДоговорыКонтрагентов.СтавкаНДС КАК СтавкаНДС,
	|	Кассы.Ссылка КАК Касса,
	|	РасчетыПоНаложеннымПлатежам.Счет КАК Счет,
	|	РасчетыПоНаложеннымПлатежам.Валюта КАК Валюта,
	|	РасчетыПоНаложеннымПлатежам.Сумма КАК Сумма,
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	РасчетыПоНаложеннымПлатежам КАК РасчетыПоНаложеннымПлатежам
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РасчетыПоНаложеннымПлатежам.Договор = ДоговорыКонтрагентов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		ПО РасчетыПоНаложеннымПлатежам.Договор = ОбъектыРасчетов.Объект
	|		И ОбъектыРасчетов.ТипРасчетов = Значение(Перечисление.ТипыРасчетовСПартнерами.РасчетыСПоставщиком)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО РасчетыПоНаложеннымПлатежам.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Кассы КАК Кассы
	|		ПО РасчетыПоНаложеннымПлатежам.Организация = Кассы.Организация
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата,
	|	Сумма
	|ИТОГИ
	|	МАКСИМУМ(БанковскийСчет),
	|	МАКСИМУМ(БанковскийСчетКонтрагента),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(СтавкаНДС),
	|	МАКСИМУМ(Касса)
	|ПО
	|	Организация,
	|	Партнер,
	|	Контрагент,
	|	Договор,
	|	Валюта";
	
	Если Параметры.Свойство("Партнер") Тогда
		Запрос.УстановитьПараметр("Партнер", Параметры.Партнер);
		ТекстОтбораПоПартнеру = "АналитикаУчетаПоПартнерам.Партнер = &Партнер";
	Иначе
		ТекстОтбораПоПартнеру = "ИСТИНА";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтбораПоПартнеру", ТекстОтбораПоПартнеру);
	
	СтатьяДДС = Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоНаименованию("Поступление оплаты за услуги доставки");
	
	ПриоритетОплаты = Справочники.ПриоритетыОплаты.ПолучитьПриоритетПоУмолчанию(Неопределено);
	ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
							
	СтруктураПересчетаСуммы = Новый Структура;
	СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", Истина);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ДатаДокумента = ?(НачалоДня(ТекущаяДата) = НачалоДня(Параметры.Период), ТекущаяДата, КонецДня(Параметры.Период));
	
	ВыборкаОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизации.Следующий() Цикл
		ВыборкаПартнеры = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПартнеры.Следующий() Цикл
			ВыборкаКонтрагенты = ВыборкаПартнеры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагенты.Следующий() Цикл
					ВыборкаДоговоры = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаДоговоры.Следующий() Цикл
						ВыборкаВалюты = ВыборкаДоговоры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаВалюты.Следующий() Цикл
							
							ЗаявкаНаРасходованиеДС = Документы.ЗаявкаНаРасходованиеДенежныхСредств.СоздатьДокумент();
							ЗаявкаНаРасходованиеДС.Дата = ДатаДокумента;
							ЗаявкаНаРасходованиеДС.Организация = ВыборкаВалюты.Организация;
							ЗаявкаНаРасходованиеДС.Статус = Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.НеСогласована;
							ЗаявкаНаРасходованиеДС.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратОплатыКлиенту;
							ЗаявкаНаРасходованиеДС.Валюта = ВыборкаВалюты.Валюта;
							ЗаявкаНаРасходованиеДС.ФормаОплатыНаличная = (ВыборкаВалюты.Организация = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ОрганизацияЛогсис());
							ЗаявкаНаРасходованиеДС.ФормаОплатыБезналичная = Не ЗаявкаНаРасходованиеДС.ФормаОплатыНаличная;
							ЗаявкаНаРасходованиеДС.БанковскийСчет = ВыборкаВалюты.БанковскийСчет;
							ЗаявкаНаРасходованиеДС.Касса = ВыборкаВалюты.Касса;
							ЗаявкаНаРасходованиеДС.Контрагент = ВыборкаВалюты.Контрагент;
							ЗаявкаНаРасходованиеДС.БанковскийСчетКонтрагента = ВыборкаВалюты.БанковскийСчетКонтрагента;
							ЗаявкаНаРасходованиеДС.Подразделение = ВыборкаВалюты.Подразделение;
							ЗаявкаНаРасходованиеДС.КтоЗаявил = Пользователи.ТекущийПользователь();
							ЗаявкаНаРасходованиеДС.Автор = ЗаявкаНаРасходованиеДС.КтоЗаявил;
							ЗаявкаНаРасходованиеДС.СтатьяДвиженияДенежныхСредств = СтатьяДДС;
							ЗаявкаНаРасходованиеДС.ПланированиеСуммы = Перечисления.СпособыПланированияОплатыЗаявок.ВВалютеПлатежа;
							ЗаявкаНаРасходованиеДС.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления;
							ЗаявкаНаРасходованиеДС.ВидПеречисленияВБюджет = Перечисления.ВидыПеречисленийВБюджет.ИнойПлатеж;
							ЗаявкаНаРасходованиеДС.ПриоритетОплаты = ПриоритетОплаты;
							
							СуммаВсего = 0; НомераСчетов = "";							
							Выборка = ВыборкаВалюты.Выбрать();
							Пока Выборка.Следующий() Цикл  									
								СтрокаРаспределения = ЗаявкаНаРасходованиеДС.Логс_РаспределениеПоСчетам.Добавить();
								СтрокаРаспределения.Счет = Выборка.Счет;
								СтрокаРаспределения.Сумма = Выборка.Сумма;								
								СуммаВсего = СуммаВсего + СтрокаРаспределения.Сумма;	
								НомераСчетов = НомераСчетов + "№" + Выборка.Номер + " от " + Формат(Выборка.Дата, "ДЛФ = D") + ", ";
							КонецЦикла; // Счет
							
							ЗаявкаНаРасходованиеДС.ДатаПлатежа = ДатаДокумента;
							ЗаявкаНаРасходованиеДС.ЖелательнаяДатаПлатежа = ДатаДокумента;
							ЗаявкаНаРасходованиеДС.НазначениеПлатежа = "Возврат излишне перечисленных дс по счетам: " + НомераСчетов + "договор: " + ВыборкаВалюты.Договор;
							ЗаявкаНаРасходованиеДС.СуммаДокумента = СуммаВсего;
							
							СтрокаПлатежа = ЗаявкаНаРасходованиеДС.РасшифровкаПлатежа.Добавить();
							СтрокаПлатежа.Партнер = ВыборкаВалюты.Партнер;
							СтрокаПлатежа.ОбъектРасчетов = ВыборкаВалюты.ОбъектРасчетов;
							СтрокаПлатежа.Сумма = СуммаВсего;
							СтрокаПлатежа.ВалютаВзаиморасчетов = ВыборкаВалюты.Валюта;
							СтрокаПлатежа.СтатьяДвиженияДенежныхСредств = СтатьяДДС; 
							СтрокаПлатежа.Организация = ВыборкаВалюты.Организация;
							СтрокаПлатежа.СтавкаНДС = ВыборкаВалюты.СтавкаНДС;
							
							//++ Ким Виктор 10.12.2025
							//Фикс после обновления
							//ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаПлатежа, СтруктураДействий, КэшированныеЗначения);
							ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(СтрокаПлатежа, СтруктураДействий, КэшированныеЗначения);
							//-- Ким Виктор 10.12.2025
                            							
							СтрокаБанковскогоСчета = ЗаявкаНаРасходованиеДС.РаспределениеПоСчетам.Добавить();
							СтрокаБанковскогоСчета.БанковскийСчетКасса = ?(ЗаявкаНаРасходованиеДС.ФормаОплатыНаличная, ВыборкаВалюты.Касса, ВыборкаВалюты.БанковскийСчет);
							СтрокаБанковскогоСчета.Сумма = СуммаВсего;
							СтрокаБанковскогоСчета.ДатаПлатежа = ЗаявкаНаРасходованиеДС.ДатаПлатежа;
							
							ЗаявкаНаРасходованиеДС.УстановитьНовыйНомер();
							ЗаявкаНаРасходованиеДС.Записать(РежимЗаписиДокумента.Запись);
							
							Попытка
								ЗаявкаНаРасходованиеДС.Записать(РежимЗаписиДокумента.Проведение);
							Исключение
								ТекстСообщения = СтрШаблон(
									НСтр("ru='Произошла ошибка при записи заявки на расходование денежных средств по своду заявок на доставку № %1 от %2: %3'"),
									ЗаявкаНаРасходованиеДС.Номер, Формат(ЗаявкаНаРасходованиеДС.Дата, "ДФ=dd.MM.yyyy"),
									КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
								ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание заявок на расходование ДС",
									УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
								БылиОшибки = Истина;
							КонецПопытки;							
						
						КонецЦикла; // Валюты
					КонецЦикла; // Договоры
			КонецЦикла; // Контрагенты
		КонецЦикла; // Партнеры
	КонецЦикла; // Организации	
	
	СоздатьЗаявкиНаРасходованиеДенежныхСредств(Параметры, СписокОшибок = Неопределено);
	
КонецФункции

Функция СоздатьСчетаНаОплату(Параметры, СписокОшибок = Неопределено)
	
	Если СписокОшибок = Неопределено Тогда
		СписокОшибок = Новый Массив;
	КонецЕсли; 
	Для каждого ЭлСрокиВыставленияСчетов Из Параметры.СрокиВыставленияСчетов Цикл
		Если ЭлСрокиВыставленияСчетов = Перечисления.Логс_СрокиВыставленияСчетаЗаУслугиАгента.ПриОплатеНП Тогда
			
			Запрос = Новый Запрос;
			Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(Параметры.Период), ВидГраницы.Включая));
			Запрос.УстановитьПараметр("СрокиВыставленияСчетов", Параметры.СрокиВыставленияСчетов);
			Запрос.УстановитьПараметр("ОрганизацияЛогсис", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ОрганизацияЛогсис());
			
						Запрос.Текст =
			"ВЫБРАТЬ
			|	Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам.Организация КАК Организация,
			|	Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам.Контрагент КАК Контрагент,
			|	Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам.Договор КАК Договор,
			|	Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам.Партнер КАК Партнер,
			|	Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок КАК СводЗаявок,
			|	Логс_ВзаиморасчетыЗаВычетомОстатки.Валюта КАК Валюта,
			|	Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам.Договор.НаименованиеДляПечати КАК НаименованиеДоговора,
			|	Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам.Организация.Логс_ОсновнойБанковскийСчет КАК БанковскийСчет,
			|	Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок.РегиональныйСвод КАК РегиональныйСвод,
			|	Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок.МоментВремени КАК Порядок,
			|	Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам.Договор.Логс_НаименованиеУслугПоДоставке КАК НаименованиеУслугПоДоставке,
			|	ВЫБОР
			|		КОГДА Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок.РегиональныйСвод
			|			ТОГДА Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам.Договор.Логс_СрокПлатежаРег
			|		ИНАЧЕ Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам.Договор.Логс_СрокПлатежа
			|	КОНЕЦ КАК СрокПлатежа,
			|	ВЫБОР
			|		КОГДА Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок.РегиональныйСвод
			|			ТОГДА Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам.Договор.Логс_СрокВыставленияСчетаЗаУслугиАгентаРег
			|		ИНАЧЕ Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам.Договор.Логс_СрокВыставленияСчетаЗаУслугиАгента
			|	КОНЕЦ КАК СрокВыставленияСчетаЗаУслугиАгента,
			|	Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаУслугОстаток КАК Сумма
			|ПОМЕСТИТЬ Данные
			|ИЗ
			|	РегистрНакопления.Логс_ВзаиморасчетыЗаВычетом.Остатки(
			|			&Период,
			|			АналитикаУчетаПоПартнерам.Договор.Логс_СрокВыставленияСчетаЗаУслугиАгентаРег В (&СрокиВыставленияСчетов)
			|			И НЕ АналитикаУчетаПоПартнерам.Организация.Логс_НеФормироватьРеглДокументы
			|				И &ТекстОтбораПоПартнеру) КАК Логс_ВзаиморасчетыЗаВычетомОстатки
			|ГДЕ
			|	Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаУслугОстаток > 0
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Данные.Организация КАК Организация,
			|	Данные.Партнер КАК Партнер,
			|	Данные.Контрагент КАК Контрагент,
			|	Данные.Договор КАК Договор,
			|	Данные.СводЗаявок КАК СводЗаявок,
			|	Данные.Валюта КАК Валюта,
			|	Данные.НаименованиеДоговора КАК НаименованиеДоговора,
			|	Данные.НаименованиеУслугПоДоставке КАК НаименованиеУслугПоДоставке,
			|	Данные.СрокВыставленияСчетаЗаУслугиАгента КАК СрокВыставленияСчетаЗаУслугиАгента,  
			|	Данные.СрокПлатежа КАК СрокПлатежаСсылка,  
			|	ЕСТЬNULL(СрокиПлатежейПоАгентскомуДоговору.СрокПлатежа, 0) КАК СрокПлатежа,
			|	ЕСТЬNULL(СрокиПлатежейПоАгентскомуДоговору.СрокДата, ЛОЖЬ) КАК СрокПлатежаДата,
			|	Данные.БанковскийСчет КАК БанковскийСчет,
			|	Данные.Сумма КАК Сумма
			|ИЗ
			|	Данные КАК Данные
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Логс_СрокиПлатежейПоАгентскомуДоговору КАК СрокиПлатежейПоАгентскомуДоговору
			|		ПО Данные.СрокПлатежа = СрокиПлатежейПоАгентскомуДоговору.Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	Данные.Порядок
			|ИТОГИ
			|	МАКСИМУМ(НаименованиеДоговора),
			|	МАКСИМУМ(НаименованиеУслугПоДоставке),
			|	МАКСИМУМ(СрокВыставленияСчетаЗаУслугиАгента),
			|	МАКСИМУМ(СрокПлатежаСсылка),
			|	МАКСИМУМ(СрокПлатежа),
			|	МАКСИМУМ(СрокПлатежаДата),
			|	СУММА(Сумма)
			|ПО
			|	Организация,
			|	Партнер,
			|	Контрагент,
			|	Договор,
			|	БанковскийСчет,
			|	Валюта";
			
			Если Параметры.Свойство("Партнер") Тогда
				Запрос.УстановитьПараметр("Партнер", Параметры.Партнер);
				ТекстОтбораПоПартнеру = "АналитикаУчетаПоПартнерам.Партнер = &Партнер";
			Иначе
				ТекстОтбораПоПартнеру = "ИСТИНА";
			КонецЕсли;
			
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтбораПоПартнеру", ТекстОтбораПоПартнеру);
			
			ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
			
			ТекущаяДата = ТекущаяДатаСеанса();
			ДатаСчета = ?(НачалоДня(ТекущаяДата) = НачалоДня(Параметры.Период), ТекущаяДата, КонецДня(Параметры.Период));
			ГодПлатежа = Год(ДатаСчета);
			МесяцПлатежа = Месяц(ДатаСчета);
			
			ВыборкаОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаОрганизации.Следующий() Цикл
				ВыборкаПартнеры = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПартнеры.Следующий() Цикл
					ВыборкаКонтрагенты = ВыборкаПартнеры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаКонтрагенты.Следующий() Цикл
						//ВыборкаРегион = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						//Пока ВыборкаРегион.Следующий() Цикл
							ВыборкаДоговоры = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ВыборкаДоговоры.Следующий() Цикл
								ВыборкаБанковскиеСчета = ВыборкаДоговоры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Пока ВыборкаБанковскиеСчета.Следующий() Цикл
									
									ВыборкаВалюты = ВыборкаБанковскиеСчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									Пока ВыборкаВалюты.Следующий() Цикл
										
										Если ВыборкаВалюты.Сумма < 0 Тогда
											// Общая сумма (свёрнуто по сводам) меньше нуля - нечего выставлять клиенту.
											Продолжить;
										КонецЕсли; 
										
										#Область Пофикшено_В_Комбайн
										//Если ВыборкаВалюты.СрокПлатежаДата Тогда
										//	ДеньПлатежа = ВыборкаВалюты.СрокПлатежа;
										//	
										//	Если ДеньПлатежа < День(ДатаСчета) Тогда
										//		МесяцПлатежа = МесяцПлатежа + 1;
										//	КонецЕсли; 
										//	
										//	ДатаПлатежа = Дата(ГодПлатежа, МесяцПлатежа, ДеньПлатежа);
										//Иначе
										//	ДатаПлатежа = НачалоДня(ДатаСчета) + ВыборкаВалюты.СрокПлатежа * 86400;
										//КонецЕсли; 
										//
										//// День платежа должен быть рабочим.
										//НачальныеДаты = Новый Массив;
										//НачальныеДаты.Добавить(ДатаПлатежа);
										//РабочиеДни = КалендарныеГрафики.ДатыБлижайшихРабочихДней(ПроизводственныйКалендарь, НачальныеДаты, Ложь, Ложь, Истина);
										//ДатаПлатежа = РабочиеДни[ДатаПлатежа];
										
										#КонецОбласти
										ДатаПлатежа = Логс_ДатыПовтИсп.РассчитатьСдвигДаты(ДатаСчета, ВыборкаВалюты.СрокПлатежаСсылка);
										
										СчетНаОплату = Документы.СчетНаОплатуКлиенту.СоздатьДокумент();
										СчетНаОплату.Дата = ДатаСчета;
										СчетНаОплату.Организация = ВыборкаВалюты.Организация;
										СчетНаОплату.СуммаДокумента = ВыборкаВалюты.Сумма;
										СчетНаОплату.Валюта = ВыборкаВалюты.Валюта;
										СчетНаОплату.ДокументОснование = ВыборкаВалюты.Договор;
										СчетНаОплату.ФормаОплаты = Перечисления.ФормыОплаты.Безналичная;
										СчетНаОплату.БанковскийСчет = ВыборкаВалюты.БанковскийСчет;
										СчетНаОплату.Менеджер = Пользователи.ТекущийПользователь();
										СчетНаОплату.Партнер = ВыборкаВалюты.Партнер;
										СчетНаОплату.Контрагент = ВыборкаВалюты.Контрагент;
										СчетНаОплату.Договор = ВыборкаВалюты.Договор;
										
										ЭтапОплаты = СчетНаОплату.ЭтапыГрафикаОплаты.Добавить();
										ЭтапОплаты.ДатаПлатежа = ДатаПлатежа;
										ЭтапОплаты.ПроцентПлатежа = 100;
										ЭтапОплаты.СуммаПлатежа = СчетНаОплату.СуммаДокумента;
										
										Выборка = ВыборкаВалюты.Выбрать();
										Пока Выборка.Следующий() Цикл
											СтрокаРаспределения = СчетНаОплату.Логс_РаспределениеПоСводамЗаявокНаДоставку.Добавить();
											СтрокаРаспределения.СводЗаявок = Выборка.СводЗаявок;
											СтрокаРаспределения.Сумма = Выборка.Сумма;
										КонецЦикла; // Своды
										
										СчетНаОплату.УстановитьНовыйНомер();
										
										СчетНаОплату.НазначениеПлатежа = СтрШаблон(НСтр("ru='%1 по %2 по счету %3 от %4'"), 
										ВыборкаВалюты.НаименованиеУслугПоДоставке,
										ВыборкаВалюты.НаименованиеДоговора,
										СчетНаОплату.Номер,
										Формат(СчетНаОплату.Дата, "ДФ=dd.MM.yyyy"));
										
										СчетНаОплату.Записать(РежимЗаписиДокумента.Запись);
										
										Попытка
											СчетНаОплату.Записать(РежимЗаписиДокумента.Проведение);
										Исключение
											ТекстСообщения = СтрШаблон(
											НСтр("ru='Произошла ошибка при записи счета на оплату № %1 от %2: %3'"),
											СчетНаОплату.Номер, Формат(СчетНаОплату.Дата, "ДФ=dd.MM.yyyy"),
											КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
											ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание счетов на оплату",
											УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
											СписокОшибок.Добавить(Новый Структура("ТекстОшибки,КлючДанных",
											ТекстСообщения, СчетНаОплату.Ссылка));
										КонецПопытки;
										//Fil
										Если СчетНаОплату.Проведен И Параметры.ОтправлятьПоЭлектроннойПочте Тогда
											Логс_ДополнительныеПроцедурыИФункции.ОтправитьПоПочтеСчетОтчет(СчетНаОплату.Ссылка, "Счет");
										КонецЕсли;
									КонецЦикла; // Валюты
								КонецЦикла; // Банковские счета
							КонецЦикла; // Договоры
						//КонецЦикла; // Регион
					КонецЦикла; // Контрагенты
				КонецЦикла; // Партнеры
			КонецЦикла; // Организации
		Иначе
			ТекДата = КонецДня(Параметры.Период);
			Если ЭлСрокиВыставленияСчетов = Перечисления.Логс_СрокиВыставленияСчетаЗаУслугиАгента.Число_15_30 Тогда
				Если День(ТекДата) <= 15 Тогда
					НачДата = НачалоМесяца(ТекДата);
					КонДата = КонецДня(НачДата  + 60*60*24*14);
				Иначе
					НачДата = НачалоМесяца(ТекДата)+60*60*24*15;
					КонДата = КонецМесяца(ТекДата);
				КонецЕсли;			
			ИначеЕсли ЭлСрокиВыставленияСчетов = Перечисления.Логс_СрокиВыставленияСчетаЗаУслугиАгента.Число30 Тогда
				НачДата = НачалоМесяца(ТекДата);
				КонДата = КонецМесяца(ТекДата);
			ИначеЕсли ЭлСрокиВыставленияСчетов = Перечисления.Логс_СрокиВыставленияСчетаЗаУслугиАгента.РазаВМесяц4 Тогда
				НачДата = Макс(НачалоНедели(ТекДата), НачалоМесяца(ТекДата));
				КонДата = Мин(КонецНедели(ТекДата), КонецМесяца(ТекДата));
			ИначеЕсли ЭлСрокиВыставленияСчетов = Перечисления.Логс_СрокиВыставленияСчетаЗаУслугиАгента.Декадно Тогда
				
				Год =  Год(ТекДата);
				Месяц = Месяц(ТекДата);   			
				Если ТекДата <= КонецДня(Дата(Год, Месяц, 10)) Тогда
					НачДата = НачалоМесяца(ТекДата);
					КонДата = Дата(Год, Месяц, 10);
				ИначеЕсли ТекДата <= КонецДня(Дата(Год, Месяц, 20)) Тогда
					НачДата = Дата(Год, Месяц, 11);
					КонДата = Дата(Год, Месяц, 20);
				Иначе
					НачДата = Дата(Год, Месяц, 21);
					КонДата = КонецМесяца(ТекДата);	
				КонецЕсли;	
			КонецЕсли;		
			
			//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
			// Данный фрагмент построен конструктором.
			// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	Логс_СводЗаявокНаДоставку.Ссылка КАК СводЗаявок,
			|	Логс_СводЗаявокНаДоставку.Партнер КАК Партнер,
			|	Логс_СводЗаявокНаДоставку.Контрагент КАК Контрагент,
			|	Логс_СводЗаявокНаДоставку.Договор КАК Договор,
			|	Логс_СводЗаявокНаДоставку.Валюта КАК Валюта,
			|	Логс_СводЗаявокНаДоставку.РегиональныйСвод КАК РегиональныйСвод,
			|	Логс_СводЗаявокНаДоставку.ПолнаяСтоимостьВсего КАК Сумма,
			|	ВЫБОР
			|		КОГДА Логс_СводЗаявокНаДоставку.РегиональныйСвод
			|			ТОГДА Логс_СводЗаявокНаДоставку.Договор.Логс_СрокПлатежаРег
			|		ИНАЧЕ Логс_СводЗаявокНаДоставку.Договор.Логс_СрокПлатежа
			|	КОНЕЦ КАК СрокПлатежаСсылка,
			|	ЕСТЬNULL(Логс_СрокиПлатежейПоАгентскомуДоговору.СрокПлатежа, 0) КАК СрокПлатежа,
			|	ЕСТЬNULL(Логс_СрокиПлатежейПоАгентскомуДоговору.СрокДата, ЛОЖЬ) КАК СрокПлатежаДата,
			|	Логс_СводЗаявокНаДоставку.Организация.Логс_ОсновнойБанковскийСчет КАК БанковскийСчет,
			|	Логс_СводЗаявокНаДоставку.Договор.НаименованиеДляПечати КАК НаименованиеДоговора,
			|	Логс_СводЗаявокНаДоставку.Договор.Логс_НаименованиеУслугПоДоставке КАК НаименованиеУслугПоДоставке,
			|	Логс_СводЗаявокНаДоставку.Организация КАК Организация
			|ИЗ
			|	Документ.Логс_СводЗаявокНаДоставку КАК Логс_СводЗаявокНаДоставку
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Логс_СрокиПлатежейПоАгентскомуДоговору КАК Логс_СрокиПлатежейПоАгентскомуДоговору
			|		ПО Логс_СводЗаявокНаДоставку.Ссылка = Логс_СрокиПлатежейПоАгентскомуДоговору.СрокПлатежа
			|ГДЕ
			|	Логс_СводЗаявокНаДоставку.Дата МЕЖДУ &НачПериода И &КонПериода
			|	И Логс_СводЗаявокНаДоставку.Проведен
			|	И НЕ Логс_СводЗаявокНаДоставку.Организация = &ОрганизацияЛогсис
			|	И Логс_СводЗаявокНаДоставку.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом)
			|	И (Логс_СводЗаявокНаДоставку.Договор.Логс_СрокВыставленияСчетаЗаУслугиАгента = &Логс_СрокВыставленияСчетаЗаУслугиАгента
			|			ИЛИ Логс_СводЗаявокНаДоставку.Договор.Логс_СрокВыставленияСчетаЗаУслугиАгентаРег = &Логс_СрокВыставленияСчетаЗаУслугиАгента)
			|	И Логс_СводЗаявокНаДоставку.ПолнаяСтоимостьВсего <> 0";
			
			Если Параметры.Свойство("Партнер") Тогда
				Запрос.Текст = Запрос.Текст + "
				|	И Логс_СводЗаявокНаДоставку.Партнер =  &Партнер";
			КонецЕсли;
			Запрос.Текст = Запрос.Текст + "
			|
			|УПОРЯДОЧИТЬ ПО
			|	Логс_СводЗаявокНаДоставку.МоментВремени
			|ИТОГИ
			|	СУММА(Сумма),
			|	МАКСИМУМ(СрокПлатежаСсылка),
			|	МАКСИМУМ(СрокПлатежа),
			|	МАКСИМУМ(СрокПлатежаДата),
			|	МАКСИМУМ(НаименованиеДоговора)
			|ПО
			|	Организация,
			|	Партнер,
			|	Контрагент,
			|	РегиональныйСвод,
			|	Договор,
			|	БанковскийСчет,
			|	Валюта";
			
			Запрос.УстановитьПараметр("КонПериода", КонДата);
			Запрос.УстановитьПараметр("Логс_СрокВыставленияСчетаЗаУслугиАгента", ЭлСрокиВыставленияСчетов);
			Запрос.УстановитьПараметр("НачПериода", НачДата);
			Запрос.УстановитьПараметр("ОрганизацияЛогсис", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ОрганизацияЛогсис());
			Если Параметры.Свойство("Партнер") Тогда
				Запрос.УстановитьПараметр("Партнер", Параметры.Партнер);
			КонецЕсли;
			
			//РезультатЗапроса = Запрос.Выполнить();
			
			//ВыборкаОрганизация = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
			
			ТекущаяДата = ТекущаяДатаСеанса();
			Если ЭлСрокиВыставленияСчетов = Перечисления.Логс_СрокиВыставленияСчетаЗаУслугиАгента.Декадно Тогда
				ДатаСчета = КонДата;
			Иначе	
				ДатаСчета = ?(НачалоДня(ТекущаяДата) = НачалоДня(Параметры.Период), ТекущаяДата, КонецДня(Параметры.Период));
			КонецЕсли;
			ГодПлатежа = Год(ДатаСчета);
			МесяцПлатежа = Месяц(ДатаСчета);
			ВыборкаОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
			Пока ВыборкаОрганизации.Следующий() Цикл
				// Вставить обработку выборки ВыборкаОрганизация
				
				ВыборкаПартнер = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПартнер.Следующий() Цикл
					// Вставить обработку выборки ВыборкаПартнер
					
					ВыборкаКонтрагент = ВыборкаПартнер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
					Пока ВыборкаКонтрагент.Следующий() Цикл
						// Вставить обработку выборки ВыборкаКонтрагент
						
						ВыборкаРегиональныйСвод = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						
						Пока ВыборкаРегиональныйСвод.Следующий() Цикл
							// Вставить обработку выборки ВыборкаРегиональныйСвод
							
							ВыборкаДоговор = ВыборкаРегиональныйСвод.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Пока ВыборкаДоговор.Следующий() Цикл
								// Вставить обработку выборки ВыборкаДоговор
								
								ВыборкаБанковскийСчет = ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								
								Пока ВыборкаБанковскийСчет.Следующий() Цикл
									// Вставить обработку выборки ВыборкаБанковскийСчет
									
									ВыборкаВалюты = ВыборкаБанковскийСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									
									Пока ВыборкаВалюты.Следующий() Цикл
										
										#Область Пофикшено_В_Комбайне
										//Если ВыборкаВалюты.СрокПлатежаДата Тогда
										//	ДеньПлатежа = ВыборкаВалюты.СрокПлатежа;
										//	
										//	Если ДеньПлатежа < День(ДатаСчета) Тогда
										//		МесяцПлатежа = МесяцПлатежа + 1;
										//	КонецЕсли; 
										//	
										//	ДатаПлатежа = Дата(ГодПлатежа, МесяцПлатежа, ДеньПлатежа);
										//Иначе
										//	ДатаПлатежа = НачалоДня(ДатаСчета) + ВыборкаВалюты.СрокПлатежа * 86400;
										//КонецЕсли; 
										//
										//// День платежа должен быть рабочим.
										//НачальныеДаты = Новый Массив;
										//НачальныеДаты.Добавить(ДатаПлатежа);
										//РабочиеДни = КалендарныеГрафики.ДатыБлижайшихРабочихДней(ПроизводственныйКалендарь, НачальныеДаты, Ложь, Ложь, Истина);
										//ДатаПлатежа = РабочиеДни[ДатаПлатежа];
										#КонецОбласти
										
										ДатаПлатежа = Логс_ДатыПовтИсп.РассчитатьСдвигДаты(ДатаСчета, ВыборкаВалюты.СрокПлатежаСсылка);

										
										СчетНаОплату = Документы.СчетНаОплатуКлиенту.СоздатьДокумент();
										СчетНаОплату.Дата = ДатаСчета;
										СчетНаОплату.Организация = ВыборкаВалюты.Организация;
										СчетНаОплату.СуммаДокумента = ВыборкаВалюты.Сумма;
										СчетНаОплату.Валюта = ВыборкаВалюты.Валюта;
										СчетНаОплату.ДокументОснование = ВыборкаВалюты.Договор;
										СчетНаОплату.ФормаОплаты = Перечисления.ФормыОплаты.Безналичная;
										СчетНаОплату.БанковскийСчет = ВыборкаВалюты.БанковскийСчет;
										СчетНаОплату.Менеджер = Пользователи.ТекущийПользователь();
										СчетНаОплату.Партнер = ВыборкаВалюты.Партнер;
										СчетНаОплату.Контрагент = ВыборкаВалюты.Контрагент;
										СчетНаОплату.Договор = ВыборкаВалюты.Договор;
										
										ЭтапОплаты = СчетНаОплату.ЭтапыГрафикаОплаты.Добавить();
										ЭтапОплаты.ДатаПлатежа = ДатаПлатежа;
										ЭтапОплаты.ПроцентПлатежа = 100;
										ЭтапОплаты.СуммаПлатежа = СчетНаОплату.СуммаДокумента;
										
										Выборка = ВыборкаВалюты.Выбрать();
										Пока Выборка.Следующий() Цикл
											СтрокаРаспределения = СчетНаОплату.Логс_РаспределениеПоСводамЗаявокНаДоставку.Добавить();
											СтрокаРаспределения.СводЗаявок = Выборка.СводЗаявок;
											СтрокаРаспределения.Сумма = Выборка.Сумма;
										КонецЦикла; // Своды
										
										СчетНаОплату.УстановитьНовыйНомер();
										
										СчетНаОплату.НазначениеПлатежа = СтрШаблон(НСтр("ru='%1 по %2 по счету %3 от %4'"), 
										ВыборкаВалюты.НаименованиеУслугПоДоставке,
										ВыборкаВалюты.НаименованиеДоговора,
										СчетНаОплату.Номер,
										Формат(СчетНаОплату.Дата, "ДФ=dd.MM.yyyy"));
										
										СчетНаОплату.Записать(РежимЗаписиДокумента.Запись);
										Сообщить(Выборка.СводЗаявок);
										Попытка
											СчетНаОплату.Записать(РежимЗаписиДокумента.Проведение);
										Исключение
											ТекстСообщения = СтрШаблон(
											НСтр("ru='Произошла ошибка при записи счета на оплату № %1 от %2: %3'"),
											СчетНаОплату.Номер, Формат(СчетНаОплату.Дата, "ДФ=dd.MM.yyyy"),
											КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
											ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание счетов на оплату",
											УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
											СписокОшибок.Добавить(Новый Структура("ТекстОшибки,КлючДанных",
											ТекстСообщения, СчетНаОплату.Ссылка));
										КонецПопытки;
										//Fil
										Если СчетНаОплату.Проведен И Параметры.ОтправлятьПоЭлектроннойПочте Тогда
											Логс_ДополнительныеПроцедурыИФункции.ОтправитьПоПочтеСчетОтчет(СчетНаОплату.Ссылка, "Счет");
										КонецЕсли;
									КонецЦикла;
								КонецЦикла;
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;
			КонецЦикла;
			
			//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА]
		КонецЕсли;
	КонецЦикла;
КонецФункции

Функция СоздатьСчетаНаОплату20(Параметры, СписокОшибок = Неопределено)
	
	КонтрагентСпецСвязь = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("1010c9e4-352b-11e9-93f8-005056987d66")); // Спец.связь для печати товаров в формате
	
	Если СписокОшибок = Неопределено Тогда
		СписокОшибок = Новый Массив;
	КонецЕсли; 
			
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", Новый Граница(КонецДня(Параметры.Период), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СрокиВыставленияСчетов", Параметры.СрокиВыставленияСчетов);
	Запрос.УстановитьПараметр("ОрганизацияЛогсис", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ОрганизацияЛогсис());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Аналитика.Организация КАК Организация,
	|	Аналитика.Партнер КАК Партнер,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор,
	|	Организации.Логс_ОсновнойБанковскийСчет КАК БанковскийСчет,
	|	СчетаПоУслугам100Остатки.СводЗаявок КАК СводЗаявок,
	|	СчетаПоУслугам100Остатки.Валюта КАК Валюта,
	|	-СчетаПоУслугам100Остатки.СуммаОстаток КАК Сумма,
	|	СводЗаявокНаДоставку.МоментВремени КАК Порядок
	|ИЗ
	|	РегистрНакопления.Логс_СчетаПоУслугам100.Остатки(
	|			&Период,
	|			СводЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.Оплата100)
	|				И (АналитикаУчетаПоПартнерам.Договор.Логс_СрокВыставленияСчетаЗаУслугиАгента В (&СрокиВыставленияСчетов)
	|					ИЛИ АналитикаУчетаПоПартнерам.Договор.Логс_СрокВыставленияСчетаЗаУслугиАгентаРег В (&СрокиВыставленияСчетов))
	|				И &ТекстОтбораПоПартнеру) КАК СчетаПоУслугам100Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ПО Аналитика.Договор = ДоговорыКонтрагентов.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО Аналитика.Организация = Организации.Ссылка
	|		ПО СчетаПоУслугам100Остатки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК СводЗаявокНаДоставку
	|		ПО СчетаПоУслугам100Остатки.СводЗаявок = СводЗаявокНаДоставку.Ссылка
	|ГДЕ
	|	СчетаПоУслугам100Остатки.СуммаОстаток < 0
	|	И НЕ Аналитика.Организация = &ОрганизацияЛогсис
	|	И НЕ Аналитика.Организация.Логс_НеФормироватьРеглДокументы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Аналитика.Организация КАК Организация,
	|	Аналитика.Партнер КАК Партнер,
	|	Аналитика.Контрагент КАК Контрагент,
	|	Аналитика.Договор КАК Договор,
	|	СчетаПоУслугам100Остатки.СводЗаявок КАК СводЗаявок,
	|	СчетаПоУслугам100Остатки.Валюта КАК Валюта,
	|	ДоговорыКонтрагентов.НаименованиеДляПечати КАК НаименованиеДоговора,
	|	ДоговорыКонтрагентов.Логс_НаименованиеУслугПоДоставке КАК НаименованиеУслугПоДоставке,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(СводЗаявокНаДоставку.РегиональныйСвод, ЛОЖЬ)
	|			ТОГДА ДоговорыКонтрагентов.Логс_СрокПлатежаРег
	|		ИНАЧЕ ДоговорыКонтрагентов.Логс_СрокПлатежа
	|	КОНЕЦ КАК СрокПлатежа,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.Ссылка ЕСТЬ NULL
	|				ИЛИ ДоговорыКонтрагентов.Логс_ПриоритетныйСчетОплаты = ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка)
	|			ТОГДА Организации.Логс_ОсновнойБанковскийСчет
	|		ИНАЧЕ ДоговорыКонтрагентов.Логс_ПриоритетныйСчетОплаты
	|	КОНЕЦ КАК БанковскийСчет,
	|	СчетаПоУслугам100Остатки.СуммаОстаток КАК Сумма,
	|	СводЗаявокНаДоставку.РегиональныйСвод КАК РегиональныйСвод,
	|	СводЗаявокНаДоставку.Дата КАК ДатаСвода,
	|	СводЗаявокНаДоставку.МоментВремени КАК Порядок
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	РегистрНакопления.Логс_СчетаПоУслугам100.Остатки(
	|			&Период,
	|			СводЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.Оплата100)
	|				И (АналитикаУчетаПоПартнерам.Договор.Логс_СрокВыставленияСчетаЗаУслугиАгента В (&СрокиВыставленияСчетов)
	|					ИЛИ АналитикаУчетаПоПартнерам.Договор.Логс_СрокВыставленияСчетаЗаУслугиАгентаРег В (&СрокиВыставленияСчетов))
	|				И &ТекстОтбораПоПартнеру) КАК СчетаПоУслугам100Остатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ПО Аналитика.Договор = ДоговорыКонтрагентов.Ссылка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|			ПО Аналитика.Организация = Организации.Ссылка
	|		ПО СчетаПоУслугам100Остатки.АналитикаУчетаПоПартнерам = Аналитика.КлючАналитики
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК СводЗаявокНаДоставку
	|		ПО СчетаПоУслугам100Остатки.СводЗаявок = СводЗаявокНаДоставку.Ссылка
	|ГДЕ
	|	СчетаПоУслугам100Остатки.СуммаОстаток > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Организация КАК Организация,
	|	Данные.Партнер КАК Партнер,
	|	Данные.Контрагент КАК Контрагент,
	|	Данные.Договор КАК Договор,
	|	Данные.Договор.Логс_НеРазделятьОтчетыАгентовПоРегионам КАК НеРазделятьОтчетыАгентовПоРегионам,
	|	Данные.СводЗаявок КАК СводЗаявок,
	|	Данные.Валюта КАК Валюта,
	|	Данные.НаименованиеДоговора КАК НаименованиеДоговора,
	|	Данные.НаименованиеУслугПоДоставке КАК НаименованиеУслугПоДоставке,
	|	Данные.СрокПлатежа КАК СрокПлатежаСсылка,
	|	ЕСТЬNULL(СрокиПлатежейПоАгентскомуДоговору.СрокПлатежа, 0) КАК СрокПлатежа,
	|	ЕСТЬNULL(СрокиПлатежейПоАгентскомуДоговору.СрокДата, ЛОЖЬ) КАК СрокПлатежаДата,
	|	ЕСТЬNULL(СрокиПлатежейПоАгентскомуДоговору.ПереноситьНаСледующийМесяц, ЛОЖЬ) КАК ПереноситьНаСледующийМесяц,
	|	Данные.БанковскийСчет КАК БанковскийСчет,
	|	Данные.РегиональныйСвод КАК РегиональныйСвод,
	|	Данные.Сумма КАК Сумма,
	|	Данные.ДатаСвода КАК ДатаСвода
	|ИЗ
	|	Данные КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Логс_СрокиПлатежейПоАгентскомуДоговору КАК СрокиПлатежейПоАгентскомуДоговору
	|		ПО Данные.СрокПлатежа = СрокиПлатежейПоАгентскомуДоговору.Ссылка
	|ГДЕ
	|	НЕ Данные.Организация = &ОрганизацияЛогсис
	|	И НЕ Данные.Организация.Логс_НеФормироватьРеглДокументы
	|
	|УПОРЯДОЧИТЬ ПО
	|	Данные.Порядок
	|ИТОГИ
	|	МАКСИМУМ(НаименованиеДоговора),
	|	МАКСИМУМ(НаименованиеУслугПоДоставке),
	|	МАКСИМУМ(СрокПлатежаСсылка),
	|	МАКСИМУМ(СрокПлатежа),
	|	МАКСИМУМ(СрокПлатежаДата),
	|	МАКСИМУМ(ПереноситьНаСледующийМесяц),
	|	МАКСИМУМ(ДатаСвода),
	|	СУММА(Сумма)
	|ПО
	|	Организация,
	|	Партнер,
	|	Контрагент,
	|	РегиональныйСвод,
	|	Договор,
	|	БанковскийСчет,
	|	Валюта";
	
	Если Параметры.Свойство("Партнер") Тогда
		Запрос.УстановитьПараметр("Партнер", Параметры.Партнер);
		ТекстОтбораПоПартнеру = "АналитикаУчетаПоПартнерам.Партнер = &Партнер";
	Иначе
		ТекстОтбораПоПартнеру = "ИСТИНА";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтбораПоПартнеру", ТекстОтбораПоПартнеру);
	
	ПроизводственныйКалендарь = КалендарныеГрафики.ОсновнойПроизводственныйКалендарь();
	
	ТекущаяДата = ТекущаяДатаСеанса();
	ДатаСчета = ?(НачалоДня(ТекущаяДата) = НачалоДня(Параметры.Период), ТекущаяДата, КонецДня(Параметры.Период));
	ГодПлатежа = Год(ДатаСчета);
	МесяцПлатежа = Месяц(ДатаСчета);
	
	Рез = Запрос.ВыполнитьПакет();
	ТабОтрСводы = Рез[0].Выгрузить();
	СтрПоиск = Новый Структура("Организация, Партнер, Контрагент, Договор, БанковскийСчет, Валюта");
	
	ВыборкаОрганизации = Рез[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизации.Следующий() Цикл
		ВыборкаПартнеры = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПартнеры.Следующий() Цикл
			ВыборкаКонтрагенты = ВыборкаПартнеры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагенты.Следующий() Цикл
				ВыборкаРегион = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаРегион.Следующий() Цикл
					ВыборкаДоговоры = ВыборкаРегион.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаДоговоры.Следующий() Цикл
						ВыборкаБанковскиеСчета = ВыборкаДоговоры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаБанковскиеСчета.Следующий() Цикл
							
							ВыборкаВалюты = ВыборкаБанковскиеСчета.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ВыборкаВалюты.Следующий() Цикл
								
								#Область Пофикшено_В_Комбайн
			//					Если ВыборкаВалюты.СрокПлатежаДата Тогда
			//						ДеньПлатежа = ВыборкаВалюты.СрокПлатежа;
			//						                    
			//						//Если ДеньПлатежа = 20 Тогда
			//						Если ВыборкаВалюты.ПереноситьНаСледующийМесяц Тогда
			//							
			//							Если ДеньПлатежа > День(ДатаСчета) Тогда
			//								Если МесяцПлатежа = 12 Тогда
			//									МесяцПлатежа = 1;
			//									ГодПлатежа = ГодПлатежа + 1;
			//								Иначе	
			//									МесяцПлатежа = МесяцПлатежа + 1;
			//								КонецЕсли;
			//							Иначе
			//								Если МесяцПлатежа = 12 Тогда
			//									МесяцПлатежа = 2;
			//									ГодПлатежа = ГодПлатежа + 1;
			//								ИначеЕсли МесяцПлатежа = 11 Тогда
			//									МесяцПлатежа = 1;
			//									ГодПлатежа = ГодПлатежа + 1;	
			//								Иначе	
			//									МесяцПлатежа = МесяцПлатежа + 2;
			//								КонецЕсли;
			//							
			//							КонецЕсли;	
			//							
			//							ДатаПлатежа = Дата(ГодПлатежа, МесяцПлатежа, ДеньПлатежа);
			//
			//							// День платежа должен быть рабочим.
			//							НачальныеДаты = Новый Массив;
			//							НачальныеДаты.Добавить(ДатаПлатежа);
			//							РабочиеДни = КалендарныеГрафики.ДатыБлижайшихРабочихДней(ПроизводственныйКалендарь, НачальныеДаты, Ложь, Ложь, Истина);
			//							ДатаПлатежа = РабочиеДни[ДатаПлатежа];     									
			//							
			//						Иначе	
			//						
			//							Если ДеньПлатежа < День(ДатаСчета) Тогда
			//								Если МесяцПлатежа = 12 Тогда
			//									МесяцПлатежа = 1;
			//									ГодПлатежа = ГодПлатежа + 1;
			//								Иначе	
			//									МесяцПлатежа = МесяцПлатежа + 1;
			//								КонецЕсли; 
			//							КонецЕсли;	
			//							
			//								ДатаПлатежа = Дата(ГодПлатежа, МесяцПлатежа, ДеньПлатежа);
			//
			//								// День платежа должен быть рабочим.
			//								НачальныеДаты = Новый Массив;
			//								НачальныеДаты.Добавить(ДатаПлатежа);
			//								РабочиеДни = КалендарныеГрафики.ДатыБлижайшихРабочихДней(ПроизводственныйКалендарь, НачальныеДаты, Ложь, Ложь, Истина);
			//								ДатаПлатежа = РабочиеДни[ДатаПлатежа];
			//								
			//						КонецЕсли;		
			//								
			//					Иначе
			//						ДатаПлатежа = КалендарныеГрафики.ДатаПоКалендарю(ПроизводственныйКалендарь,ДатаСчета,ВыборкаВалюты.СрокПлатежа, Истина);
			//					КонецЕсли;  
								
								#КонецОбласти
								ДатаПлатежа = Логс_ДатыПовтИсп.РассчитатьСдвигДаты(ДатаСчета, ВыборкаВалюты.СрокПлатежаСсылка);
								
								СчетНаОплату = Документы.СчетНаОплатуКлиенту.СоздатьДокумент();
								СчетНаОплату.Дата = ДатаСчета;
								СчетНаОплату.Организация = ВыборкаВалюты.Организация;
								СчетНаОплату.СуммаДокумента = ВыборкаВалюты.Сумма;
								СчетНаОплату.Валюта = ВыборкаВалюты.Валюта;
								СчетНаОплату.ДокументОснование = ВыборкаВалюты.Договор;
								СчетНаОплату.ФормаОплаты = Перечисления.ФормыОплаты.Безналичная;
								СчетНаОплату.БанковскийСчет = ВыборкаВалюты.БанковскийСчет;
								СчетНаОплату.Менеджер = Пользователи.ТекущийПользователь();
								СчетНаОплату.Партнер = ВыборкаВалюты.Партнер;
								СчетНаОплату.Контрагент = ВыборкаВалюты.Контрагент;
								СчетНаОплату.Договор = ВыборкаВалюты.Договор;
								
								ЭтапОплаты = СчетНаОплату.ЭтапыГрафикаОплаты.Добавить();
								ЭтапОплаты.ДатаПлатежа = ДатаПлатежа;
								ЭтапОплаты.ПроцентПлатежа = 100;
								ЭтапОплаты.СуммаПлатежа = СчетНаОплату.СуммаДокумента;
								
								////++изменено 27.04.23 по заявке Шабановой
								Выборка = ВыборкаВалюты.Выбрать();
								//НазначениеПлатежаСвод = "";
								Пока Выборка.Следующий() Цикл
									СтрокаРаспределения = СчетНаОплату.Логс_РаспределениеПоСводамЗаявокНаДоставку.Добавить();
									СтрокаРаспределения.СводЗаявок = Выборка.СводЗаявок;
									СтрокаРаспределения.Сумма = Выборка.Сумма;
									//НазначениеПлатежаСвод = НазначениеПлатежаСвод + " по своду " + Выборка.СводЗаявок.Номер + " от " + Формат(Выборка.СводЗаявок.Дата, "ДФ=dd.MM.yyyy") + ", "; 
								КонецЦикла; // Своды
								//Если Не ПустаяСтрока(НазначениеПлатежаСвод) Тогда
								//	НазначениеПлатежаСвод = Лев(НазначениеПлатежаСвод, СтрДлина(НазначениеПлатежаСвод) - 2);
								//КонецЕсли;
								////--
								
								// найдем отрицательные своды и добавим в счет
								ЗаполнитьЗначенияСвойств(СтрПоиск, ВыборкаВалюты);
								МассивПоиск = ТабОтрСводы.НайтиСтроки(СтрПоиск);
								СуммаОст = СчетНаОплату.Логс_РаспределениеПоСводамЗаявокНаДоставку.Итог("Сумма");
								НазначениеПлатежаСводКорр = "";
								Для каждого СтрокаОтр Из МассивПоиск Цикл
									Если СуммаОст = 0 Тогда
										Прервать;
									КонецЕсли;	
									Если СтрокаОтр.Сумма = 0 Тогда
										Продолжить;
									КонецЕсли;	
									Если СтрокаОтр.Сумма <= СуммаОст Тогда
										СуммаОтр = СтрокаОтр.Сумма;
										СуммаОст = СуммаОст - СуммаОтр;
										СтрокаОтр.Сумма = 0;
									Иначе
										СуммаОтр = СуммаОст;
										СуммаОст = 0;
										СтрокаОтр.Сумма = СтрокаОтр.Сумма - СуммаОтр;
									КонецЕсли;
									СтрокаРаспределения = СчетНаОплату.Логс_РаспределениеПоСводамЗаявокНаДоставку.Добавить();
									СтрокаРаспределения.СводЗаявок = СтрокаОтр.СводЗаявок;
									СтрокаРаспределения.Сумма = -СуммаОтр;
								////++изменено 27.04.23 по заявке Шабановой
									//НазначениеПлатежаСводКорр = НазначениеПлатежаСводКорр + " по своду " + СтрокаОтр.СводЗаявок.Номер + " от " + Формат(СтрокаОтр.СводЗаявок.Дата, "ДФ=dd.MM.yyyy") + ", ";
								КонецЦикла;	
								//Если Не ПустаяСтрока(НазначениеПлатежаСводКорр) Тогда
								//	НазначениеПлатежаСводКорр = " корректировка " + Лев(НазначениеПлатежаСводКорр, СтрДлина(НазначениеПлатежаСводКорр) - 2);
								//КонецЕсли;											
								////--
								
								СчетНаОплату.УстановитьНовыйНомер();
											
								////++изменено 27.04.23 по заявке Шабановой
								//Если СчетНаОплату.Контрагент = КонтрагентСпецСвязь Тогда
								//	СчетНаОплату.НазначениеПлатежа = Логс_ДополнительныеПроцедурыИФункции.СформироватьНаименованиеУслугНаДоставкуПоСводу(Выборка.СводЗаявок, Истина, Истина);
								//ИначеЕсли ВыборкаВалюты.НеРазделятьОтчетыАгентовПоРегионам Тогда
								//
								//	СчетНаОплату.НазначениеПлатежа = СтрШаблон(НСтр("ru='%1 по %2 за %3'"), 
								//	ВыборкаВалюты.НаименованиеУслугПоДоставке,
								//	ВыборкаВалюты.НаименованиеДоговора,
								//	Формат(ВыборкаВалюты.ДатаСвода, "ДФ='ММММ гггг'") + " г.");
								//Иначе
									//
									//СчетНаОплату.НазначениеПлатежа = СтрШаблон(НСтр("ru='%1 по %2 %3 %4'"), 
									//ВыборкаВалюты.НаименованиеУслугПоДоставке,
									//ВыборкаВалюты.НаименованиеДоговора,
									//НазначениеПлатежаСвод,
									//?(ПустаяСтрока(НазначениеПлатежаСводКорр), "", НазначениеПлатежаСводКорр));
								//КонецЕсли;
									СчетНаОплату.НазначениеПлатежа = СтрШаблон(НСтр("ru='%1 по %2 по счету %3 от %4'"), 
									ВыборкаВалюты.НаименованиеУслугПоДоставке,
									ВыборкаВалюты.НаименованиеДоговора,
									СчетНаОплату.Номер,
									Формат(СчетНаОплату.Дата, "ДФ=dd.MM.yyyy"));
                                ////--
								СчетНаОплату.Записать(РежимЗаписиДокумента.Запись);
								
								Попытка
									СчетНаОплату.Записать(РежимЗаписиДокумента.Проведение);
								Исключение
									ТекстСообщения = СтрШаблон(
									НСтр("ru='Произошла ошибка при записи счета на оплату № %1 от %2: %3'"),
									СчетНаОплату.Номер, Формат(СчетНаОплату.Дата, "ДФ=dd.MM.yyyy"),
									КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
									ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание счетов на оплату",
									УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
									СписокОшибок.Добавить(Новый Структура("ТекстОшибки,КлючДанных",
									ТекстСообщения, СчетНаОплату.Ссылка));
								КонецПопытки;
								//Fil
								Если СчетНаОплату.Проведен И Параметры.ОтправлятьПоЭлектроннойПочте Тогда
									Логс_ДополнительныеПроцедурыИФункции.ОтправитьПоПочтеСчетОтчет(СчетНаОплату.Ссылка, "Счет");
								КонецЕсли;
							КонецЦикла; // Валюты
						КонецЦикла; // Банковские счета
					КонецЦикла; // Договоры
				КонецЦикла; // Регион
			КонецЦикла; // Контрагенты
		КонецЦикла; // Партнеры
	КонецЦикла; // Организации    		
		
	//СоздатьСчетаНаОплату(Параметры, СписокОшибок = Неопределено); 
	СоздатьСчетаНаОплату(Параметры, СписокОшибок);
		
КонецФункции

Функция СоздатьДокументыПоДвижениюДенежныхСредств(Параметры, СписокОшибок = Неопределено)
	
	Перем Партнер;
	
	Если СписокОшибок = Неопределено Тогда
		СписокОшибок = Новый Массив;
	КонецЕсли; 
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Параметры.Свойство("Партнер", Партнер);
	
	ПоместитьДоговорыПоДвижениюДенежныхСредствВоВременнуюТаблицу(Параметры, МенеджерВременныхТаблиц);
	РегистрыСведений.Логс_ОтборЗаявокНаДоставкуСКС.ПоместитьЗаявкиПоОтборуВоВременнуюТаблицу(
		МенеджерВременныхТаблиц, Параметры.НачалоПериода, Параметры.КонецПериода, Партнер);
	РегистрыСведений.Логс_ПроцентыСтоимостиУслугСКС.ПоместитьДанныеВоВременнуюТаблицу(
		МенеджерВременныхТаблиц, Параметры.НачалоПериода);	
	
	СозданныеДокументы = Новый ТаблицаЗначений;
	СозданныеДокументы.Колонки.Добавить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	СозданныеДокументы.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	СозданныеДокументы.Колонки.Добавить("ДокументыПриемаНаКомиссию", Новый ОписаниеТипов("ТаблицаЗначений"));
	СозданныеДокументы.Колонки.Добавить("ДокументыОтчетовКомитентам", Новый ОписаниеТипов("Массив"));
	СозданныеДокументы.Колонки.Добавить("ДокументыАктовВыполненныхРабот", Новый ОписаниеТипов("Массив"));
	СозданныеДокументы.Колонки.Добавить("ДокументыПриобретенияУслугСКС", Новый ОписаниеТипов("Массив"));
	СозданныеДокументы.Индексы.Добавить("Партнер,Договор");
	
	СписокОшибокДляОтчета = Новый Соответствие;
	
	СоздатьДокументыПриемНаКомиссию(Параметры, МенеджерВременныхТаблиц, СозданныеДокументы, СписокОшибокДляОтчета);
	СоздатьДокументыРеализацияТоваровУслуг(Параметры, МенеджерВременныхТаблиц, СозданныеДокументы, СписокОшибокДляОтчета);
	СоздатьДокументыОтчетКомитенту(Параметры, СозданныеДокументы, СписокОшибокДляОтчета);
	СоздатьДокументыАктВыполненныхРабот(Параметры, МенеджерВременныхТаблиц, СозданныеДокументы, СписокОшибокДляОтчета);
	СоздатьДокументыСчетФактурыВыданный(Параметры, СозданныеДокументы, СписокОшибокДляОтчета);
	///////////////////////////////////////////////////////////////////////////////////////////////////
	// Формирование регл. документов по СКС пока отключено. Нужна доработка процедуры,
	// но на текущий момент своды СКС не формируют, поэтому доработка отложена до тех пор,
	// пока не начнут формировать своды СКС
	//
	СоздатьДокументыДвиженияДенежныхСредствПоСКС(Параметры, МенеджерВременныхТаблиц, СозданныеДокументы, СписокОшибокДляОтчета);
	//++ Ким Виктор 17.01.2025
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15412
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15606
	//Перенесен код на форму сводов маршрутов
	//СоздатьДокументыДвиженияДенежныхСредствПоСКСТМС(Параметры, МенеджерВременныхТаблиц, СозданныеДокументы, СписокОшибокДляОтчета);
	//-- Ким Виктор 17.01.2025
	
	
	//
	///////////////////////////////////////////////////////////////////////////////////////////////////
	
	Для каждого КлючИЗначение Из СписокОшибокДляОтчета Цикл
		СписокОшибок.Добавить(Новый Структура("ТекстОшибки,КлючДанных",
			КлючИЗначение.Значение, КлючИЗначение.Ключ));
	КонецЦикла;
	
	Если Параметры.ПоказатьОтчетПоЗавершении Тогда
		ТабличныйДокумент = СформироватьОтчетОСозданныхДокументахДвиженияДС(Параметры, СозданныеДокументы, СписокОшибокДляОтчета);
	Иначе
		ТабличныйДокумент = Неопределено;
	КонецЕсли; 
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция СоздатьДокументыПоПоступлениюДенежныхСредств(Параметры, СписокОшибок = Неопределено)
	
	Если СписокОшибок = Неопределено Тогда
		СписокОшибок = Новый Массив;
	КонецЕсли; 
	
	Если Параметры.СоздаватьПКО или Параметры.СоздаватьЭквайринговыеОперации Тогда
	
		ДанныеПоПоступлению = ПолучитьДанныеПоПоступлениюДенежныхСредств(Параметры);
		
		Если Параметры.СоздаватьПКО Тогда
			СоздатьДокументПриходныйКассовыйОрдер(ДанныеПоПоступлению.ПКО, Параметры.ТолькоСоздаватьНовые, СписокОшибок);
		КонецЕсли;
		Если Параметры.СоздаватьЭквайринговыеОперации Тогда
			СоздатьДокументОперацияПоПлатежнойКарте(ДанныеПоПоступлению.ПлатежныеКарты, Параметры.ТолькоСоздаватьНовые, СписокОшибок);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

#Область ДокументыДвиженияДенежныхСредств

Процедура СоздатьДокументыПриемНаКомиссию(Параметры, МенеджерВременныхТаблиц, ТаблицаСозданныхДокументов, СписокОшибок)
	
	Если Не Параметры.Создавать.СоздаватьПоступления Тогда
		Возврат;
	КонецЕсли;	
	
	СтавкаНДС20 = Константы.Логс_СтавкаНДС20.Получить();
	СтавкаБезНДС = Справочники.СтавкиНДС.БезНДС; 
	СтавкаНДС5 = Справочники.СтавкиНДС.НайтиПоНаименованию("5%");    
	СтавкаНДС22 = Справочники.СтавкиНДС.НайтиПоНаименованию("22%");
	ЛогсисОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9725007793");
	ОрионОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9728051543");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Дата", НачалоДня(Параметры.ДатаФормирования));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Параметры.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Параметры.КонецПериода));
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СводЗаявокНаДоставку.Ссылка КАК Ссылка,
	|	СводЗаявокНаДоставку.Номер КАК Номер,
	|	СводЗаявокНаДоставку.Организация КАК Организация,
	|	СводЗаявокНаДоставку.Партнер КАК Партнер,
	|	СводЗаявокНаДоставку.Контрагент КАК Контрагент,
	|	СводЗаявокНаДоставку.Договор КАК Договор,
	|	СводЗаявокНаДоставку.НалогообложениеНДС КАК НалогообложениеНДС,
	|	СводЗаявокНаДоставку.Валюта КАК Валюта,
	|	СписокДоговоров.Подразделение КАК Подразделение,
	|	СписокДоговоров.БанковскийСчет КАК БанковскийСчет,
	|	СписокДоговоров.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	СписокДоговоров.ПорядокРасчетов КАК ПорядокРасчетов,
	|	СписокДоговоров.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	СписокДоговоров.Склад КАК Склад,
	|	СводЗаявокНаДоставку.НаложенныйПлатежВсего КАК Сумма
	|ПОМЕСТИТЬ СводЗаявок
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку КАК СводЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДоговоров КАК СписокДоговоров
	|		ПО СводЗаявокНаДоставку.Договор = СписокДоговоров.Договор
	|ГДЕ
	|	СводЗаявокНаДоставку.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СводЗаявокНаДоставку.НаложенныйПлатежВсего > 0
	|	И СводЗаявокНаДоставку.ВидКлиента <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.СКС)
	|	И СводЗаявокНаДоставку.Проведен  И (СводЗаявокНаДоставку.Организация = &Организация или &Организация = Значение(Справочник.Организации.ПустаяСсылка))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Договор КАК Договор,
	|	МАКСИМУМ(ПриобретениеТоваровУслуг.Ссылка) КАК ПриемНаКомиссию
	|ПОМЕСТИТЬ ДокументыПриемаНаКомиссию
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ПриобретениеТоваровУслуг.Дата, ДЕНЬ) = &Дата
	|	И ПриобретениеТоваровУслуг.Договор В
	|			(ВЫБРАТЬ
	|				СписокДоговоров.Договор
	|			ИЗ
	|				СписокДоговоров)
	|	И ПриобретениеТоваровУслуг.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПриемНаКомиссию)
	|	И НЕ ПриобретениеТоваровУслуг.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеТоваровУслуг.Договор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводЗаявок.Ссылка КАК Ссылка,
	|	СводЗаявок.Номер КАК Номер,
	|	СводЗаявок.Организация КАК Организация,
	|	СводЗаявок.Партнер КАК Партнер,
	|	СводЗаявок.Контрагент КАК Контрагент,
	|	СводЗаявок.Договор КАК Договор,
	|	СводЗаявок.Склад КАК Склад,
	|	СводЗаявок.НалогообложениеНДС КАК НалогообложениеНДС,
	|	СводЗаявок.Подразделение КАК Подразделение,
	|	СводЗаявок.БанковскийСчет КАК БанковскийСчет,
	|	СводЗаявок.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	СводЗаявок.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	СводЗаявок.Валюта КАК Валюта,
	|	СводЗаявок.ПорядокРасчетов КАК ПорядокРасчетов,
	|	СводЗаявок.Сумма КАК Сумма,
	|	ЕСТЬNULL(ДокументыПриемаНаКомиссию.ПриемНаКомиссию, НЕОПРЕДЕЛЕНО) КАК ПриемНаКомиссию
	|ИЗ
	|	СводЗаявок КАК СводЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыПриемаНаКомиссию КАК ДокументыПриемаНаКомиссию
	|		ПО СводЗаявок.Договор = ДокументыПриемаНаКомиссию.Договор
	|ИТОГИ
	|	МАКСИМУМ(Склад),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(БанковскийСчет),
	|	МАКСИМУМ(БанковскийСчетКонтрагента),
	|	МАКСИМУМ(ВалютаВзаиморасчетов),
	|	МАКСИМУМ(ПорядокРасчетов),
	|	МАКСИМУМ(ПриемНаКомиссию)
	|ПО
	|	Организация,
	|	Партнер,
	|	Контрагент,
	|	Договор,
	|	НалогообложениеНДС,
	|	Валюта";
	
	Менеджер = Пользователи.ТекущийПользователь();
	
	ВыборкаОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизации.Следующий() Цикл
		ВыборкаПартнеры = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПартнеры.Следующий() Цикл
			ВыборкаКонтрагенты = ВыборкаПартнеры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагенты.Следующий() Цикл
				ВыборкаДоговоры = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДоговоры.Следующий() Цикл
					ВыборкаНалогообложение = ВыборкаДоговоры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаНалогообложение.Следующий() Цикл
						ВыборкаВалюты = ВыборкаНалогообложение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаВалюты.Следующий() Цикл
							
							Склад = ВыборкаВалюты.Склад;
							
							СтруктураОтветственного = ЗакупкиСервер.ПолучитьОтветственногоПоСкладу(Склад, Менеджер);
							Если СтруктураОтветственного <> Неопределено Тогда
								Принял = СтруктураОтветственного.Ответственный;
								ПринялДолжность = СтруктураОтветственного.ОтветственныйДолжность;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ВыборкаВалюты.ПриемНаКомиссию) Тогда
								
								Если Параметры.ТолькоСоздаватьНовые Тогда
									Продолжить;
								КонецЕсли; 
		
								ПриобретениеТоваровУслуг = ВыборкаВалюты.ПриемНаКомиссию.ПолучитьОбъект();
								
								ПриобретениеТоваровУслуг.Товары.Очистить();
								ПриобретениеТоваровУслуг.ЭтапыГрафикаОплаты.Очистить();
								
							Иначе
								
								ПриобретениеТоваровУслуг = Документы.ПриобретениеТоваровУслуг.СоздатьДокумент();
								ПриобретениеТоваровУслуг.Дата = НачалоДня(Параметры.ДатаФормирования) + 43200;
								ПриобретениеТоваровУслуг.Организация = ВыборкаВалюты.Организация;
								ПриобретениеТоваровУслуг.Партнер = ВыборкаВалюты.Партнер;
								ПриобретениеТоваровУслуг.Контрагент = ВыборкаВалюты.Контрагент;
								ПриобретениеТоваровУслуг.Договор = ВыборкаВалюты.Договор;
								ПриобретениеТоваровУслуг.НалогообложениеНДС = ВыборкаВалюты.НалогообложениеНДС;
								ПриобретениеТоваровУслуг.Валюта = ВыборкаВалюты.Валюта;
								ПриобретениеТоваровУслуг.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПриемНаКомиссию;
								
								ПриобретениеТоваровУслуг.УстановитьНовыйНомер();
								
							КонецЕсли; 
							
							ПриобретениеТоваровУслуг.Подразделение = ВыборкаВалюты.Подразделение;
							ПриобретениеТоваровУслуг.Склад = Склад;
							ПриобретениеТоваровУслуг.Менеджер = Менеджер;
							ПриобретениеТоваровУслуг.ЦенаВключаетНДС = Истина;
							ПриобретениеТоваровУслуг.ВалютаВзаиморасчетов = ВыборкаВалюты.ВалютаВзаиморасчетов;
							ПриобретениеТоваровУслуг.Согласован = Истина;
							ПриобретениеТоваровУслуг.БанковскийСчетОрганизации = ВыборкаВалюты.БанковскийСчет;
							ПриобретениеТоваровУслуг.БанковскийСчетКонтрагента = ВыборкаВалюты.БанковскийСчетКонтрагента;
							ПриобретениеТоваровУслуг.Принял = Принял;
							ПриобретениеТоваровУслуг.ПринялДолжность = ПринялДолжность;
							ПриобретениеТоваровУслуг.Автор = Менеджер;
							ПриобретениеТоваровУслуг.ПорядокРасчетов = ВыборкаВалюты.ПорядокРасчетов;
							ПриобретениеТоваровУслуг.СпособДоставки = Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада;
							ПриобретениеТоваровУслуг.КурсЧислитель = 1;
							//ПриобретениеТоваровУслуг.Курс = 1;
							//ПриобретениеТоваровУслуг.Кратность = 1;
							ПриобретениеТоваровУслуг.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
							
							ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(ПриобретениеТоваровУслуг);
							
							Выборка = ВыборкаВалюты.Выбрать();
							Пока Выборка.Следующий() Цикл
								СтрокаТовар = ПриобретениеТоваровУслуг.Товары.Добавить();
								СтрокаТовар.Номенклатура = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ТоварАгента();
								СтрокаТовар.Характеристика =
									Логс_ДополнительныеПроцедурыИФункции.ПолучитьХарактеристикуНоменклатурыАгента(
										СтрокаТовар.Номенклатура, Выборка.Номер);
								СтрокаТовар.Количество = Выборка.Сумма;
								СтрокаТовар.КоличествоУпаковок = Выборка.Сумма;
								СтрокаТовар.Цена = 1;
								СтрокаТовар.Сумма = Выборка.Сумма;
								
								//#TODO Костыль для УСН Орион - НДС нужен.
								Если ПриобретениеТоваровУслуг.Организация = ОрионОрганизация И ПриобретениеТоваровУслуг.Дата < Дата("20260101") Тогда
									СтрокаТовар.СтавкаНДС = СтавкаНДС5;   
								ИначеЕсли (ПриобретениеТоваровУслуг.Организация = ЛогсисОрганизация ИЛИ ПриобретениеТоваровУслуг.Организация = ОрионОрганизация) И ПриобретениеТоваровУслуг.Дата >= Дата("20260101") Тогда  
									СтрокаТовар.СтавкаНДС =
									?(ПриобретениеТоваровУслуг.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
									СтавкаНДС22, СтавкаБезНДС
									);  
                             	Иначе								
									СтрокаТовар.СтавкаНДС =
									?(ПриобретениеТоваровУслуг.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
									СтавкаНДС20, СтавкаБезНДС
									);  
								КонецЕсли;

								//СтрокаТовар.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(СтрокаТовар.Сумма,
								//	УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(СтрокаТовар.СтавкаНДС),
								//	ПриобретениеТоваровУслуг.ЦенаВключаетНДС,
								//	ПриобретениеТоваровУслуг.НалогообложениеНДС);
								СтрокаТовар.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(СтрокаТовар.Сумма,
									УчетНДСУПВызовСервера.ЗначениеСтавкиНДС(СтрокаТовар.СтавкаНДС),
									ПриобретениеТоваровУслуг.ЦенаВключаетНДС,
									ПриобретениеТоваровУслуг.НалогообложениеНДС);
								СтрокаТовар.СуммаСНДС = Выборка.Сумма;
								СтрокаТовар.Склад = ПриобретениеТоваровУслуг.Склад;
								СтрокаТовар.Логс_СводЗаявокНаДоставку = Выборка.Ссылка;
							КонецЦикла; 
	
							Если ПриобретениеТоваровУслуг.Ссылка.Пустая() Тогда
								ПриобретениеТоваровУслуг.Записать(РежимЗаписиДокумента.Запись);
							КонецЕсли; 
							
							Попытка
								ПриобретениеТоваровУслуг.Записать(РежимЗаписиДокумента.Проведение);
							Исключение
								ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
								ТекстСообщения = СтрШаблон(
									НСтр("ru='Произошла ошибка при записи приема на комиссию № %1 от %2: %3'"),
									ПриобретениеТоваровУслуг.Номер, Формат(ПриобретениеТоваровУслуг.Дата, "ДФ=dd.MM.yyyy"),
									ОписаниеОшибки);
								ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание приема на комиссию",
									УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
								СписокОшибок.Вставить(ПриобретениеТоваровУслуг.Ссылка, ОписаниеОшибки);
							КонецПопытки;
							
							ТаблицаПриемаНаКомиссию = Новый ТаблицаЗначений;
							ТаблицаПриемаНаКомиссию.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("ДокументСсылка.ПриобретениеТоваровУслуг"));
							ТаблицаПриемаНаКомиссию.Колонки.Добавить("ДокументыРеализации", Новый ОписаниеТипов("Массив"));
							
							СтрокаТаблицы = ТаблицаПриемаНаКомиссию.Добавить();
							СтрокаТаблицы.Ссылка = ПриобретениеТоваровУслуг.Ссылка;
							
							СозданныйДокумент = ТаблицаСозданныхДокументов.Добавить();
							СозданныйДокумент.Партнер = ВыборкаВалюты.Партнер;
							СозданныйДокумент.Договор = ВыборкаВалюты.Договор;
							СозданныйДокумент.ДокументыПриемаНаКомиссию = ТаблицаПриемаНаКомиссию;
							
						КонецЦикла; // Валюты
					КонецЦикла; // Налогообложение НДС
				КонецЦикла; // Договоры
			КонецЦикла; // Контрагенты
		КонецЦикла; // Партнеры
	КонецЦикла; // Организации
	
	Запрос.Текст =
	"УНИЧТОЖИТЬ СводЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыПриемаНаКомиссию";
	Запрос.Выполнить();
	
КонецПроцедуры

Процедура СоздатьДокументыРеализацияТоваровУслуг(Параметры, МенеджерВременныхТаблиц, ТаблицаСозданныхДокументов, СписокОшибок)
	
	Если Не Параметры.Создавать.СоздаватьРеализации Тогда
		Возврат;
	КонецЕсли;	
	
	ДокументыПриемаНаКомиссию = ПолучитьДокументыПриемаНаКомиссиюИзТаблицыСозданныхДокументов(ТаблицаСозданныхДокументов);
	Если ДокументыПриемаНаКомиссию.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	СтавкаНДС20 = Константы.Логс_СтавкаНДС20.Получить();
	СтавкаБезНДС = Справочники.СтавкиНДС.БезНДС; 
	СтавкаНДС5 = Справочники.СтавкиНДС.НайтиПоНаименованию("5%");
	СтавкаНДС22 = Справочники.СтавкиНДС.НайтиПоНаименованию("22%");
	ЛогсисОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9725007793");
	ОрионОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9728051543");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Период", НачалоДня(Параметры.ДатаФормирования));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Параметры.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Параметры.КонецПериода));
	Запрос.УстановитьПараметр("ДокументыПриемаНаКомиссию", ДокументыПриемаНаКомиссию);
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(ПриобретениеТоваровУслуг.Дата, СЕКУНДА, 1) КАК Дата,
	|	ПриобретениеТоваровУслуг.Организация КАК Организация,
	|	ПриобретениеТоваровУслуг.Партнер КАК Партнер,
	|	ПриобретениеТоваровУслуг.Договор КАК Договор,
	|	ПриобретениеТоваровУслуг.Подразделение КАК Подразделение,
	|	ПриобретениеТоваровУслуг.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	ПриобретениеТоваровУслуг.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ПриобретениеТоваровУслуг.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ПриобретениеТоваровУслуг.Валюта КАК Валюта,
	|	ТаблицаТовары.Ссылка КАК Ссылка,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Сумма КАК Сумма,
	|	ТаблицаТовары.Склад КАК Склад,
	|	ТаблицаТовары.Логс_СводЗаявокНаДоставку КАК СводЗаявок
	|ПОМЕСТИТЬ ТаблицаТовары
	|ИЗ
	|	Документ.ПриобретениеТоваровУслуг.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|		ПО ТаблицаТовары.Ссылка = ПриобретениеТоваровУслуг.Ссылка
	|ГДЕ
	|	ТаблицаТовары.Ссылка В(&ДокументыПриемаНаКомиссию)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СводЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заявка.Ссылка КАК Ссылка,
	|	ВЫРАЗИТЬ(Заявка.НаложенныйПлатеж КАК ЧИСЛО(15, 2)) КАК НаложенныйПлатеж,
	|	АБС_ДоговораТДСрезПоследних.Партнер КАК Партнер,
	|	АБС_ДоговораТДСрезПоследних.ДоговорРеализации КАК Договор,
	|	АБС_ДоговораТДСрезПоследних.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ЗаявкиТД
	|ИЗ
	|	Документ.Логс_ЗаявкаНаДоставку КАК Заявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АБС_ДоговораТД.СрезПоследних(&НачалоПериода, ) КАК АБС_ДоговораТДСрезПоследних
	|		ПО Заявка.Организация = АБС_ДоговораТДСрезПоследних.Договор.Организация
	|			И Заявка.АгентРегион = АБС_ДоговораТДСрезПоследних.Партнер
	|ГДЕ
	|	Заявка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (Заявка.ТДРегион
	|			ИЛИ Заявка.Хаб.ЯвляетсяСКС)
	|	И (Заявка.Организация = &Организация
	|			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Заявка.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиТД.Ссылка КАК Ссылка,
	|	ЗаявкиТД.НаложенныйПлатеж КАК НаложенныйПлатеж,
	|	ЗаявкиТД.Партнер КАК Партнер,
	|	ЕСТЬNULL(АБС_ДоговораТД_ДетальныеСрезПоследних.ДоговорРеализации, ЗаявкиТД.Договор) КАК Договор,
	|	ЗаявкиТД.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ЗаявкиТД_Расширенный
	|ИЗ
	|	ЗаявкиТД КАК ЗаявкиТД
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АБС_ДоговораТД_Детальные.СрезПоследних(&НачалоПериода, ) КАК АБС_ДоговораТД_ДетальныеСрезПоследних
	|		ПО ЗаявкиТД.Партнер = АБС_ДоговораТД_ДетальныеСрезПоследних.Партнер
	|			И ЗаявкиТД.Договор = АБС_ДоговораТД_ДетальныеСрезПоследних.Договор
	|			И ЗаявкиТД.Ссылка.Партнер = АБС_ДоговораТД_ДетальныеСрезПоследних.Агент
	|			И ЗаявкиТД.Ссылка.Договор = АБС_ДоговораТД_ДетальныеСрезПоследних.ДоговорАгента
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заявка.Ссылка КАК Ссылка,
	|	ЗаявкиСКС.Партнер КАК Партнер,
	|	ЗаявкиСКС.Контрагент КАК Контрагент,
	|	ЗаявкиСКС.ДоговорРеализации КАК Договор,
	|	ВЫРАЗИТЬ(Заявка.НаложенныйПлатеж КАК ЧИСЛО(15, 2)) КАК НаложенныйПлатеж
	|ПОМЕСТИТЬ ЗаявкиПоСКС
	|ИЗ
	|	Документ.Логс_ЗаявкаНаДоставку КАК Заявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДоговоров КАК СписокДоговоров
	|		ПО Заявка.Договор = СписокДоговоров.Договор
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаявкиСКС КАК ЗаявкиСКС
	|		ПО Заявка.Ссылка = ЗаявкиСКС.Ссылка
	|ГДЕ
	|	Заявка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И (Заявка.Организация = &Организация
	|			ИЛИ &Организация = ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводЗаявокНаДоставкуЗаявки.Ссылка КАК СводЗаявок,
	|	ЗаявкиПоСКС.Партнер КАК Партнер,
	|	ЗаявкиПоСКС.Контрагент КАК Контрагент,
	|	ЗаявкиПоСКС.Договор КАК Договор,
	|	СУММА(ЗаявкиПоСКС.НаложенныйПлатеж) КАК НаложенныйПлатеж
	|ПОМЕСТИТЬ СводыЗаявокСКС
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку.Заявки КАК СводЗаявокНаДоставкуЗаявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаявкиПоСКС КАК ЗаявкиПоСКС
	|		ПО СводЗаявокНаДоставкуЗаявки.ЗаявкаНаДоставку = ЗаявкиПоСКС.Ссылка
	|ГДЕ
	|	СводЗаявокНаДоставкуЗаявки.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаТовары.СводЗаявок
	|			ИЗ
	|				ТаблицаТовары)
	|
	|СГРУППИРОВАТЬ ПО
	|	СводЗаявокНаДоставкуЗаявки.Ссылка,
	|	ЗаявкиПоСКС.Партнер,
	|	ЗаявкиПоСКС.Контрагент,
	|	ЗаявкиПоСКС.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводЗаявокНаДоставкуЗаявки.Ссылка КАК СводЗаявок,
	|	ЗаявкиТД_Расширенный.Партнер КАК Партнер,
	|	ЗаявкиТД_Расширенный.Контрагент КАК Контрагент,
	|	ЗаявкиТД_Расширенный.Договор КАК Договор,
	|	СУММА(ЗаявкиТД_Расширенный.НаложенныйПлатеж) КАК НаложенныйПлатеж
	|ПОМЕСТИТЬ СводыЗаявокТД
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку.Заявки КАК СводЗаявокНаДоставкуЗаявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаявкиТД_Расширенный КАК ЗаявкиТД_Расширенный
	|		ПО СводЗаявокНаДоставкуЗаявки.ЗаявкаНаДоставку = ЗаявкиТД_Расширенный.Ссылка
	|ГДЕ
	|	СводЗаявокНаДоставкуЗаявки.Ссылка В
	|			(ВЫБРАТЬ
	|				ТаблицаТовары.СводЗаявок
	|			ИЗ
	|				ТаблицаТовары)
	|
	|СГРУППИРОВАТЬ ПО
	|	СводЗаявокНаДоставкуЗаявки.Ссылка,
	|	ЗаявкиТД_Расширенный.Партнер,
	|	ЗаявкиТД_Расширенный.Контрагент,
	|	ЗаявкиТД_Расширенный.Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЗаявкиПоСКС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЗаявкиТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ЗаявкиТД_Расширенный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводыЗаявокСКС.СводЗаявок КАК СводЗаявок,
	|	СУММА(СводыЗаявокСКС.НаложенныйПлатеж) КАК НаложенныйПлатеж
	|ПОМЕСТИТЬ СводыЗаявокСКСОбщий
	|ИЗ
	|	СводыЗаявокСКС КАК СводыЗаявокСКС
	|
	|СГРУППИРОВАТЬ ПО
	|	СводыЗаявокСКС.СводЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводыЗаявокТД.СводЗаявок КАК СводЗаявок,
	|	СУММА(СводыЗаявокТД.НаложенныйПлатеж) КАК НаложенныйПлатеж
	|ПОМЕСТИТЬ СводыЗаявокТДОбщий
	|ИЗ
	|	СводыЗаявокТД КАК СводыЗаявокТД
	|
	|СГРУППИРОВАТЬ ПО
	|	СводыЗаявокТД.СводЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	МАКСИМУМ(ДоговорыКонтрагентов.Ссылка) КАК Договор
	|ПОМЕСТИТЬ ДоговорыРознПокупателей
	|ИЗ
	|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|		ТаблицаТовары.Организация КАК Организация
	|	ИЗ
	|		ТаблицаТовары КАК ТаблицаТовары) КАК ВложенныйЗапрос
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО ВложенныйЗапрос.Организация = ДоговорыКонтрагентов.Организация
	|			И (ДоговорыКонтрагентов.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель))
	|			И (ДоговорыКонтрагентов.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель))
	|			И (ДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту))
	|			И (ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует))
	|			И (ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем))
	|			И (ДоговорыКонтрагентов.Согласован)
	|			И (НЕ ДоговорыКонтрагентов.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.Дата КАК Дата,
	|	ТаблицаТовары.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель) КАК Партнер,
	|	ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель) КАК Контрагент,
	|	ДоговорыРознПокупателей.Договор КАК Договор,
	|	ТаблицаТовары.Подразделение КАК Подразделение,
	|	ТаблицаТовары.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	ТаблицаТовары.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ТаблицаТовары.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ТаблицаТовары.Валюта КАК Валюта,
	|	ТаблицаТовары.Ссылка КАК ДокументОснование,
	|	ТаблицаТовары.Партнер КАК Комитент,
	|	ТаблицаТовары.Договор КАК ДоговорКомитента,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Склад КАК Склад,
	|	ТаблицаТовары.СводЗаявок КАК СводЗаявок,
	|	ТаблицаТовары.Сумма КАК СуммаИтог,
	|	ТаблицаТовары.Сумма - ЕСТЬNULL(СводыЗаявокСКСОбщий.НаложенныйПлатеж, 0) - ЕСТЬNULL(СводыЗаявокТДОбщий.НаложенныйПлатеж, 0) КАК Сумма
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ СводыЗаявокСКСОбщий КАК СводыЗаявокСКСОбщий
	|		ПО ТаблицаТовары.СводЗаявок = СводыЗаявокСКСОбщий.СводЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДоговорыРознПокупателей КАК ДоговорыРознПокупателей
	|		ПО ТаблицаТовары.Организация = ДоговорыРознПокупателей.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ СводыЗаявокТДОбщий КАК СводыЗаявокТДОбщий
	|		ПО ТаблицаТовары.СводЗаявок = СводыЗаявокТДОбщий.СводЗаявок
	|ГДЕ
	|	ТаблицаТовары.Сумма - ЕСТЬNULL(СводыЗаявокСКСОбщий.НаложенныйПлатеж, 0) - ЕСТЬNULL(СводыЗаявокТДОбщий.НаложенныйПлатеж, 0) > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Дата,
	|	ТаблицаТовары.Организация,
	|	СводыЗаявокСКС.Партнер,
	|	СводыЗаявокСКС.Контрагент,
	|	СводыЗаявокСКС.Договор,
	|	ТаблицаТовары.Подразделение,
	|	ТаблицаТовары.БанковскийСчетОрганизации,
	|	ТаблицаТовары.НалогообложениеНДС,
	|	ТаблицаТовары.ЦенаВключаетНДС,
	|	ТаблицаТовары.Валюта,
	|	ТаблицаТовары.Ссылка,
	|	ТаблицаТовары.Партнер,
	|	ТаблицаТовары.Договор,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Склад,
	|	ТаблицаТовары.СводЗаявок,
	|	ТаблицаТовары.Сумма,
	|	СводыЗаявокСКС.НаложенныйПлатеж
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СводыЗаявокСКС КАК СводыЗаявокСКС
	|		ПО ТаблицаТовары.СводЗаявок = СводыЗаявокСКС.СводЗаявок
	|ГДЕ
	|	СводыЗаявокСКС.НаложенныйПлатеж > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаТовары.Дата,
	|	ТаблицаТовары.Организация,
	|	СводыЗаявокТД.Партнер,
	|	СводыЗаявокТД.Контрагент,
	|	СводыЗаявокТД.Договор,
	|	ТаблицаТовары.Подразделение,
	|	ТаблицаТовары.БанковскийСчетОрганизации,
	|	ТаблицаТовары.НалогообложениеНДС,
	|	ТаблицаТовары.ЦенаВключаетНДС,
	|	ТаблицаТовары.Валюта,
	|	ТаблицаТовары.Ссылка,
	|	ТаблицаТовары.Партнер,
	|	ТаблицаТовары.Договор,
	|	ТаблицаТовары.Номенклатура,
	|	ТаблицаТовары.Характеристика,
	|	ТаблицаТовары.Склад,
	|	ТаблицаТовары.СводЗаявок,
	|	ТаблицаТовары.Сумма,
	|	СводыЗаявокТД.НаложенныйПлатеж
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СводыЗаявокТД КАК СводыЗаявокТД
	|		ПО ТаблицаТовары.СводЗаявок = СводыЗаявокТД.СводЗаявок
	|ГДЕ
	|	СводыЗаявокТД.НаложенныйПлатеж > 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СводыЗаявокСКС
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СводыЗаявокСКСОбщий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СводыЗаявокТД
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СводыЗаявокТДОбщий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДоговорыРознПокупателей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Организация КАК Организация,
	|	Данные.Партнер КАК Партнер,
	|	Данные.Контрагент КАК Контрагент,
	|	Данные.Договор КАК Договор,
	|	Данные.ДокументОснование КАК ДокументОснование,
	|	МИНИМУМ(РеализацияТоваровУслуг.Ссылка) КАК ДокументРеализации
	|ПОМЕСТИТЬ ДокументыРеализации
	|ИЗ
	|	Данные КАК Данные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО Данные.Организация = РеализацияТоваровУслуг.Организация
	|			И Данные.Партнер = РеализацияТоваровУслуг.Партнер
	|			И Данные.Контрагент = РеализацияТоваровУслуг.Контрагент
	|			И Данные.Договор = РеализацияТоваровУслуг.Договор
	|			И Данные.ДокументОснование = РеализацияТоваровУслуг.Логс_ДокументОснование
	|			И (НАЧАЛОПЕРИОДА(РеализацияТоваровУслуг.Дата, ДЕНЬ) = &Период)
	|			И (РеализацияТоваровУслуг.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту))
	|			И (НЕ РеализацияТоваровУслуг.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.Организация,
	|	Данные.Партнер,
	|	Данные.Контрагент,
	|	Данные.Договор,
	|	Данные.ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Партнер,
	|	Контрагент,
	|	Договор,
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Дата КАК Дата,
	|	Данные.Организация КАК Организация,
	|	Данные.Партнер КАК Партнер,
	|	Данные.Контрагент КАК Контрагент,
	|	Данные.Подразделение КАК Подразделение,
	|	Данные.Договор КАК Договор,
	|	Данные.НалогообложениеНДС КАК НалогообложениеНДС,
	|	Данные.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	Данные.Валюта КАК Валюта,
	|	Данные.БанковскийСчетОрганизации КАК БанковскийСчетОрганизации,
	|	ДоговорыКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДоговорыКонтрагентов.ПорядокРасчетов КАК ПорядокРасчетов,
	|	ДоговорыКонтрагентов.Ссылка КАК Основание,
	|	ДоговорыКонтрагентов.Дата КАК ОснованиеДата,
	|	ДоговорыКонтрагентов.Номер КАК ОснованиеНомер,
	|	Данные.ДокументОснование КАК ДокументОснование,
	|	Данные.Комитент КАК Комитент,
	|	Данные.ДоговорКомитента КАК ДоговорКомитента,
	|	Данные.Номенклатура КАК Номенклатура,
	|	Данные.Характеристика КАК Характеристика,
	|	Данные.Склад КАК Склад,
	|	Данные.СводЗаявок КАК СводЗаявок,
	|	Данные.СуммаИтог КАК СуммаИтог,
	|	Данные.Сумма КАК Сумма,
	|	ЕСТЬNULL(ДокументыРеализации.ДокументРеализации, НЕОПРЕДЕЛЕНО) КАК РеализацияТоваровУслугСсылка
	|ИЗ
	|	Данные КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыРеализации КАК ДокументыРеализации
	|		ПО Данные.Организация = ДокументыРеализации.Организация
	|			И Данные.Партнер = ДокументыРеализации.Партнер
	|			И Данные.Контрагент = ДокументыРеализации.Контрагент
	|			И Данные.Договор = ДокументыРеализации.Договор
	|			И Данные.ДокументОснование = ДокументыРеализации.ДокументОснование
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Данные.Договор = ДоговорыКонтрагентов.Ссылка
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДокументОснование,
	|	ВЫБОР
	|		КОГДА Данные.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель)
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ
	|ИТОГИ
	|	МИНИМУМ(Дата),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(НалогообложениеНДС),
	|	МАКСИМУМ(ЦенаВключаетНДС),
	|	МАКСИМУМ(БанковскийСчетОрганизации),
	|	МАКСИМУМ(БанковскийСчетКонтрагента),
	|	МАКСИМУМ(ВалютаВзаиморасчетов),
	|	МАКСИМУМ(ПорядокРасчетов),
	|	МАКСИМУМ(Основание),
	|	МАКСИМУМ(ОснованиеДата),
	|	МАКСИМУМ(ОснованиеНомер),
	|	МАКСИМУМ(Комитент),
	|	МАКСИМУМ(ДоговорКомитента),
	|	МАКСИМУМ(Склад),
	|	МАКСИМУМ(СуммаИтог),
	|	СУММА(Сумма),
	|	МАКСИМУМ(РеализацияТоваровУслугСсылка)
	|ПО
	|	ДокументОснование,
	|	Организация,
	|	Партнер,
	|	Контрагент,
	|	Договор,
	|	Валюта";
	
	ВыборкаОснования = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Менеджер = Пользователи.ТекущийПользователь();
	
	ТабКорр = Новый ТаблицаЗначений;
	ТабКорр.Колонки.Добавить("ДокументОснование");
	ТабКорр.Колонки.Добавить("Характеристика");
	ТабКорр.Колонки.Добавить("Сумма");
	ТабКорр.Колонки.Добавить("СуммаИтог");
	
	Пока ВыборкаОснования.Следующий() Цикл
		
		// Найдём строку в таблице созданных документов, в которую будем добавлять реализации.
		СтрокаСозданныхДокументов = ТаблицаСозданныхДокументов.НайтиСтроки(
			Новый Структура("Партнер,Договор",
				ВыборкаОснования.Комитент,
				ВыборкаОснования.ДоговорКомитента))[0];
		СтрокаПриемаНаКомиссию = СтрокаСозданныхДокументов.ДокументыПриемаНаКомиссию.Найти(ВыборкаОснования.ДокументОснование, "Ссылка");
		
		ВыборкаОрганизации = ВыборкаОснования.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаОрганизации.Следующий() Цикл
			
			Если УчетнаяПолитикаПереопределяемый.ПрименяетсяУСН(ВыборкаОрганизации.Организация, Параметры.НачалоПериода) Тогда
				НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
			Иначе
				НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			КонецЕсли;
			
			//#TODO Костыль для УСН Орион - НДС нужен.
			Если ВыборкаОрганизации.Организация = ОрионОрганизация Тогда
				НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
			КонецЕсли;
			
			
			ВыборкаПартнеры = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаПартнеры.Следующий() Цикл
				ВыборкаКонтрагенты = ВыборкаПартнеры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаКонтрагенты.Следующий() Цикл
					ВыборкаДоговоры = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаДоговоры.Следующий() Цикл
						ВыборкаВалюты = ВыборкаДоговоры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаВалюты.Следующий() Цикл
							
							Склад = ВыборкаВалюты.Склад;
							
							СтруктураОтветственного = ЗакупкиСервер.ПолучитьОтветственногоПоСкладу(Склад, Менеджер);
							Если СтруктураОтветственного <> Неопределено Тогда
								Отпустил = СтруктураОтветственного.Ответственный;
								ОтпустилДолжность = СтруктураОтветственного.ОтветственныйДолжность;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(ВыборкаВалюты.РеализацияТоваровУслугСсылка) Тогда
								
								Если Параметры.ТолькоСоздаватьНовые Тогда
									Продолжить;
								КонецЕсли; 
								
								РеализацияТоваровУслуг = ВыборкаВалюты.РеализацияТоваровУслугСсылка.ПолучитьОбъект();
								                                
								РеализацияТоваровУслуг.Товары.Очистить();
								РеализацияТоваровУслуг.ЭтапыГрафикаОплаты.Очистить();
								
							Иначе
								
								РеализацияТоваровУслуг = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
								РеализацияТоваровУслуг.Дата = ВыборкаВалюты.Дата;
								РеализацияТоваровУслуг.Организация = ВыборкаВалюты.Организация;
								РеализацияТоваровУслуг.Партнер = ВыборкаВалюты.Партнер;
								РеализацияТоваровУслуг.Контрагент = ВыборкаВалюты.Контрагент;
								РеализацияТоваровУслуг.Договор = ВыборкаВалюты.Договор;
								РеализацияТоваровУслуг.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
								
								РеализацияТоваровУслуг.УстановитьНовыйНомер();
								
							КонецЕсли; 
							
							РеализацияТоваровУслуг.Логс_ДокументОснование = ВыборкаВалюты.ДокументОснование;
							РеализацияТоваровУслуг.БанковскийСчетОрганизации = ВыборкаВалюты.БанковскийСчетОрганизации;
							РеализацияТоваровУслуг.БанковскийСчетКонтрагента = ВыборкаВалюты.БанковскийСчетКонтрагента;
							РеализацияТоваровУслуг.Валюта = ВыборкаВалюты.Валюта;
							//РеализацияТоваровУслуг.ДатаРаспоряжения = КонецДня(РеализацияТоваровУслуг.Дата);
							РеализацияТоваровУслуг.Менеджер = Менеджер;
							РеализацияТоваровУслуг.Склад = Склад;
							РеализацияТоваровУслуг.Отпустил = Отпустил;
							РеализацияТоваровУслуг.ОтпустилДолжность = ОтпустилДолжность;
							РеализацияТоваровУслуг.Статус = Перечисления.СтатусыРеализацийТоваровУслуг.Отгружено;
							РеализацияТоваровУслуг.Автор = Менеджер;
							РеализацияТоваровУслуг.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
							РеализацияТоваровУслуг.ВариантОформленияПродажи = Перечисления.ВариантыОформленияПродажи.РеализацияТоваровУслуг;
							РеализацияТоваровУслуг.КурсЧислитель = 1;
							//РеализацияТоваровУслуг.Курс = 1;
							//РеализацияТоваровУслуг.Кратность = 1;
							РеализацияТоваровУслуг.Согласован = Истина;
							РеализацияТоваровУслуг.ПорядокРасчетов = ВыборкаВалюты.ПорядокРасчетов;
							РеализацияТоваровУслуг.НалогообложениеНДС = НалогообложениеНДС;
							РеализацияТоваровУслуг.ЦенаВключаетНДС = ВыборкаВалюты.ЦенаВключаетНДС;
							РеализацияТоваровУслуг.ВалютаВзаиморасчетов = ВыборкаВалюты.ВалютаВзаиморасчетов;
							РеализацияТоваровУслуг.Подразделение = ВыборкаВалюты.Подразделение;
							РеализацияТоваровУслуг.Основание = ВыборкаВалюты.Основание;
							РеализацияТоваровУслуг.ОснованиеНомер = ВыборкаВалюты.ОснованиеНомер;
							РеализацияТоваровУслуг.ОснованиеДата = ВыборкаВалюты.ОснованиеДата;
							РеализацияТоваровУслуг.Склад = ВыборкаВалюты.Склад;
		
							ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(РеализацияТоваровУслуг);
							
							Выборка = ВыборкаВалюты.Выбрать();
							Пока Выборка.Следующий() Цикл
								
								Поиск = Новый Структура("ДокументОснование, Характеристика", Выборка.ДокументОснование, Выборка.Характеристика);
								СтрПоиск = ТабКорр.НайтиСтроки(Поиск);
								Если СтрПоиск.Количество() = 0 Тогда
									Строка = ТабКорр.Добавить();
									ЗаполнитьЗначенияСвойств(Строка, Выборка);
								Иначе
									Строка = СтрПоиск[0];
									Строка.Сумма = Строка.Сумма + Выборка.Сумма;
								КонецЕсли;	
								
								Разница = Строка.СуммаИтог - Строка.Сумма;
								РазницаКорр = 0;
								Если Разница = 0.01 ИЛИ Разница = -0.01 Тогда
									РазницаКорр = Разница;
								КонецЕсли;	
								
								НоваяСтрока = РеализацияТоваровУслуг.Товары.Добавить();
								НоваяСтрока.Номенклатура = Выборка.Номенклатура;
								НоваяСтрока.Характеристика = Выборка.Характеристика;
								НоваяСтрока.КоличествоУпаковок = Выборка.Сумма + РазницаКорр;
								НоваяСтрока.Количество = Выборка.Сумма + РазницаКорр;
								НоваяСтрока.Цена = 1;
								НоваяСтрока.Сумма = Выборка.Сумма + РазницаКорр;    
								//#TODO Костыль для УСН Орион - НДС нужен.
								Если РеализацияТоваровУслуг.Организация = ОрионОрганизация И РеализацияТоваровУслуг.Дата < Дата("20260101") Тогда
									НоваяСтрока.СтавкаНДС = СтавкаНДС5;  
								ИначеЕсли (РеализацияТоваровУслуг.Организация = ЛогсисОрганизация ИЛИ РеализацияТоваровУслуг.Организация = ОрионОрганизация) И РеализацияТоваровУслуг.Дата >= Дата("20260101") Тогда  
									НоваяСтрока.СтавкаНДС =
									?(РеализацияТоваровУслуг.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
									СтавкаНДС22, СтавкаБезНДС
									);  
                              	Иначе								
									НоваяСтрока.СтавкаНДС =
									?(РеализацияТоваровУслуг.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
									СтавкаНДС20, СтавкаБезНДС
									);  
								КонецЕсли;  
															
								//НоваяСтрока.СтавкаНДС =
								//	?(РеализацияТоваровУслуг.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
								//		//Перечисления.СтавкиНДС.НДС20,
								//		//Перечисления.СтавкиНДС.БезНДС);
								//		СтавкаНДС20, СтавкаБезНДС);  
								
								//НоваяСтрока.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(НоваяСтрока.Сумма,
								//	УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС),
								//	РеализацияТоваровУслуг.ЦенаВключаетНДС, РеализацияТоваровУслуг.НалогообложениеНДС);
								НоваяСтрока.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(НоваяСтрока.Сумма,
									УчетНДСУПВызовСервера.ЗначениеСтавкиНДС(НоваяСтрока.СтавкаНДС),
									РеализацияТоваровУслуг.ЦенаВключаетНДС, РеализацияТоваровУслуг.НалогообложениеНДС);
								НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
								НоваяСтрока.Склад = Выборка.Склад;
								НоваяСтрока.Логс_СводЗаявокНаДоставку = Выборка.СводЗаявок;

							КонецЦикла;
							
							ЭтапОплаты = РеализацияТоваровУслуг.ЭтапыГрафикаОплаты.Добавить();
							ЭтапОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки;
							ЭтапОплаты.ДатаПлатежа = НачалоДня(РеализацияТоваровУслуг.Дата);
							ЭтапОплаты.СуммаПлатежа = РеализацияТоваровУслуг.Товары.Итог("СуммаСНДС");
							ЭтапОплаты.ПроцентПлатежа = 100;
							ЭтапОплаты.ПроцентЗалогаЗаТару = 100;
							ЭтапОплаты.СуммаВзаиморасчетов = ЭтапОплаты.СуммаПлатежа;
							ЭтапОплаты.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки;
							
							Если РеализацияТоваровУслуг.Ссылка.Пустая() Тогда
								РеализацияТоваровУслуг.Записать(РежимЗаписиДокумента.Запись);
							КонецЕсли; 
							
							Попытка
								РеализацияТоваровУслуг.Записать(РежимЗаписиДокумента.Проведение);
							Исключение
								РеализацияТоваровУслуг.Записать(РежимЗаписиДокумента.Запись);
								ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
								ТекстСообщения = СтрШаблон(
									НСтр("ru='Произошла ошибка при записи реализации товаров агента № %1 от %2: %3'"),
									РеализацияТоваровУслуг.Номер, Формат(РеализацияТоваровУслуг.Дата, "ДФ=dd.MM.yyyy"),
									ОписаниеОшибки);
								ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание реализации товаров агента",
									УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
								СписокОшибок.Вставить(РеализацияТоваровУслуг.Ссылка, ОписаниеОшибки);
							КонецПопытки;
							
							СтрокаПриемаНаКомиссию.ДокументыРеализации.Добавить(РеализацияТоваровУслуг.Ссылка);
						
						КонецЦикла; // Валюты
					КонецЦикла; // Договоры
				КонецЦикла; // Контрагенты
			КонецЦикла; // Партнеры
		КонецЦикла; // Организации
	КонецЦикла; // Основания
	
	Запрос.Текст =
	"УНИЧТОЖИТЬ ТаблицаТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыРеализации";
	Запрос.Выполнить();
	
КонецПроцедуры 

Процедура СоздатьДокументыОтчетКомитенту(Параметры, ТаблицаСозданныхДокументов, СписокОшибок)
	
	Если Не Параметры.Создавать.СоздаватьОтчетыКомитента Тогда
		Возврат;
	КонецЕсли;
	
	ДокументыРеализации = ПолучитьДокументыРеализацииИзТаблицыСозданныхДокументов(ТаблицаСозданныхДокументов);
	Если ДокументыРеализации.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	СтавкаНДС20 = Константы.Логс_СтавкаНДС20.Получить();
	СтавкаБезНДС = Справочники.СтавкиНДС.БезНДС;  
	СтавкаНДС5 = Справочники.СтавкиНДС.НайтиПоНаименованию("5%");  
	СтавкаНДС22 = Справочники.СтавкиНДС.НайтиПоНаименованию("22%");
	ЛогсисОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9725007793");
	ОрионОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9728051543");

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Период", НачалоДня(Параметры.ДатаФормирования));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Параметры.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Параметры.КонецПериода));
	Запрос.УстановитьПараметр("ДокументыРеализации", ДокументыРеализации);
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПриобретениеТоваровУслуг.Ссылка КАК ДокументОснование,
	|	ПриобретениеТоваровУслуг.Организация КАК Организация,
	|	ПриобретениеТоваровУслуг.Партнер КАК Партнер,
	|	ПриобретениеТоваровУслуг.Контрагент КАК Контрагент,
	|	ПриобретениеТоваровУслуг.Договор КАК Договор,
	|	ДОБАВИТЬКДАТЕ(РеализацияТоваровУслуг.Дата, СЕКУНДА, 1) КАК Дата,
	|	ПриобретениеТоваровУслуг.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ПриобретениеТоваровУслуг.Подразделение КАК Подразделение,
	|	ПриобретениеТоваровУслуг.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ПриобретениеТоваровУслуг.ФормаОплаты КАК ФормаОплаты,
	|	ПриобретениеТоваровУслуг.ПорядокРасчетов КАК ПорядокРасчетов,
	|	ПриобретениеТоваровУслуг.БанковскийСчетОрганизации КАК БанковскийСчет,
	|	РеализацияТоваровУслуг.Контрагент КАК Покупатель,
	|	ТаблицаТовары.Номенклатура КАК Номенклатура,
	|	ТаблицаТовары.Характеристика КАК Характеристика,
	|	ТаблицаТовары.Сумма КАК СуммаПродажи,
	|	ЕСТЬNULL(ДанныеСводов.ПолнаяСтоимостьВсего, 0) КАК СуммаВознаграждения,
	|	ТаблицаТовары.Склад КАК Склад,
	|	ТаблицаТовары.Логс_СводЗаявокНаДоставку КАК СводЗаявок,
	|	ДанныеСводов.Номер КАК НомерСвода,
	|	ДанныеСводов.Дата КАК ДатаСвода,
	|	ЛОЖЬ КАК УдержатьВознаграждение,
	|	ВЗ_ДанныеСводовНДС.НДС КАК СуммаНДСВознаграждения
	|ПОМЕСТИТЬ ТаблицаТовары	
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаТовары
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеТоваровУслуг КАК ПриобретениеТоваровУслуг
	|			ПО РеализацияТоваровУслуг.Логс_ДокументОснование = ПриобретениеТоваровУслуг.Ссылка
	|		ПО ТаблицаТовары.Ссылка = РеализацияТоваровУслуг.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК ДанныеСводов
	|		ПО ТаблицаТовары.Логс_СводЗаявокНаДоставку = ДанныеСводов.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Логс_СводЗаявокНаДоставкуЗаявки.Ссылка КАК Ссылка,
	|			СУММА(Логс_СводЗаявокНаДоставкуЗаявки.ПолнаяСтоимостьНДС) КАК НДС
	|		ИЗ
	|			Документ.Логс_СводЗаявокНаДоставку.Заявки КАК Логс_СводЗаявокНаДоставкуЗаявки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Логс_СводЗаявокНаДоставкуЗаявки.Ссылка) КАК ВЗ_ДанныеСводовНДС
	|		ПО ТаблицаТовары.Логс_СводЗаявокНаДоставку = ВЗ_ДанныеСводовНДС.Ссылка
	
	|ГДЕ
	|	ТаблицаТовары.Ссылка В(&ДокументыРеализации)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТаблицаТовары.Организация КАК Организация,
	|	ТаблицаТовары.Партнер КАК Партнер,
	|	ТаблицаТовары.Контрагент КАК Контрагент,
	|	ТаблицаТовары.Договор КАК Договор,
	|	МИНИМУМ(ТаблицаТовары.ДокументОснование) КАК ДокументОснование,
	|	МИНИМУМ(ТаблицаТовары.Дата) КАК Дата,
	|	МАКСИМУМ(ТаблицаТовары.НалогообложениеНДС) КАК НалогообложениеНДС,
	|	МАКСИМУМ(ТаблицаТовары.Подразделение) КАК Подразделение,
	|	МАКСИМУМ(ТаблицаТовары.ЦенаВключаетНДС) КАК ЦенаВключаетНДС,
	|	МАКСИМУМ(ТаблицаТовары.ФормаОплаты) КАК ФормаОплаты,
	|	МАКСИМУМ(ТаблицаТовары.ПорядокРасчетов) КАК ПорядокРасчетов,
	|	МАКСИМУМ(ТаблицаТовары.БанковскийСчет) КАК БанковскийСчет,
	|	МАКСИМУМ(ТаблицаТовары.Склад) КАК Склад,
	|	МАКСИМУМ(ТаблицаТовары.УдержатьВознаграждение) КАК УдержатьВознаграждение
	|ПОМЕСТИТЬ СписокПартнеров
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.Организация,
	|	ТаблицаТовары.Партнер,
	|	ТаблицаТовары.Контрагент,
	|	ТаблицаТовары.Договор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Партнер,
	|	Контрагент,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписокПартнеров.ДокументОснование КАК ДокументОснование,
	|	СводЗаявокНаДоставку.Организация КАК Организация,
	|	СводЗаявокНаДоставку.Партнер КАК Партнер,
	|	СводЗаявокНаДоставку.Контрагент КАК Контрагент,
	|	СводЗаявокНаДоставку.Договор КАК Договор,
	|	СписокПартнеров.НалогообложениеНДС КАК НалогообложениеНДС,
	|	СписокПартнеров.Подразделение КАК Подразделение,
	|	СписокПартнеров.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	СписокПартнеров.ФормаОплаты КАК ФормаОплаты,
	|	СписокПартнеров.ПорядокРасчетов КАК ПорядокРасчетов,
	|	СписокПартнеров.БанковскийСчет КАК БанковскийСчет,
	|	СписокПартнеров.Дата КАК Дата,
	|	СписокПартнеров.Склад КАК Склад,
	|	СписокПартнеров.УдержатьВознаграждение КАК УдержатьВознаграждение,
	|	СводЗаявокНаДоставку.Ссылка КАК СводЗаявок,
	|	СводЗаявокНаДоставку.Номер КАК НомерСвода,
	|	СводЗаявокНаДоставку.Дата КАК ДатаСвода,
	|	СводЗаявокНаДоставку.ПолнаяСтоимостьВсего КАК Сумма,
	|	ВЗ_СводЗаявокНаДоставкуНДС.НДС КАК НДС
	|ПОМЕСТИТЬ ТаблицаВознаграждения
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку КАК СводЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокПартнеров КАК СписокПартнеров
	|		ПО СводЗаявокНаДоставку.Организация = СписокПартнеров.Организация
	|			И СводЗаявокНаДоставку.Партнер = СписокПартнеров.Партнер
	|			И СводЗаявокНаДоставку.Контрагент = СписокПартнеров.Контрагент
	|			И СводЗаявокНаДоставку.Договор = СписокПартнеров.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Логс_СводЗаявокНаДоставкуЗаявки.Ссылка КАК Ссылка,
	|			СУММА(Логс_СводЗаявокНаДоставкуЗаявки.ПолнаяСтоимостьНДС) КАК НДС
	|		ИЗ
	|			Документ.Логс_СводЗаявокНаДоставку.Заявки КАК Логс_СводЗаявокНаДоставкуЗаявки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Логс_СводЗаявокНаДоставкуЗаявки.Ссылка) КАК ВЗ_СводЗаявокНаДоставкуНДС
	|		ПО СводЗаявокНаДоставку.Ссылка = ВЗ_СводЗаявокНаДоставкуНДС.Ссылка
	
	|ГДЕ
	|	СводЗаявокНаДоставку.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СводЗаявокНаДоставку.ВидКлиента <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.СКС)
	|	И СводЗаявокНаДоставку.НаложенныйПлатежВсего = 0
	|	И СводЗаявокНаДоставку.ПолнаяСтоимостьВсего > 0
	|	И СводЗаявокНаДоставку.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Партнер,
	|	Контрагент,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СписокПартнеров
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.ДокументОснование КАК ДокументОснование,
	|	МИНИМУМ(ЕСТЬNULL(ОтчетКомитенту.Ссылка, НЕОПРЕДЕЛЕНО)) КАК ОтчетКомитентуСсылка,
	|	МИНИМУМ(ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.Ссылка, НЕОПРЕДЕЛЕНО)) КАК СчетФактураСсылка
	|ПОМЕСТИТЬ СуществующиеДокументы
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтчетКомитенту КАК ОтчетКомитенту
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|			ПО ОтчетКомитенту.Ссылка = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|				И (НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления)
	|		ПО ТаблицаТовары.ДокументОснование = ОтчетКомитенту.Логс_ДокументОснование
	|			И (НЕ ОтчетКомитенту.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.ДокументОснование
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаТовары.СводЗаявок КАК СводЗаявок,
	|	СУММА(ТаблицаТовары.СуммаПродажи) КАК СуммаПродажи
	|ПОМЕСТИТЬ СуммыПродажДляРаспределенияВознаграждения
	|ИЗ
	|	ТаблицаТовары КАК ТаблицаТовары
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТовары.СводЗаявок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СводЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ДокументОснование КАК ДокументОснование,
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Партнер КАК Партнер,
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.Договор КАК Договор,
	|	ВложенныйЗапрос.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ВложенныйЗапрос.Подразделение КАК Подразделение,
	|	ВложенныйЗапрос.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ВложенныйЗапрос.ФормаОплаты КАК ФормаОплаты,
	|	ВложенныйЗапрос.ПорядокРасчетов КАК ПорядокРасчетов,
	|	ВложенныйЗапрос.БанковскийСчет КАК БанковскийСчет,
	|	ВложенныйЗапрос.Дата КАК Дата,
	|	ВложенныйЗапрос.Покупатель КАК Покупатель,
	|	ВложенныйЗапрос.Склад КАК Склад,
	|	ВложенныйЗапрос.СводЗаявок КАК СводЗаявок,
	|	ВложенныйЗапрос.НомерСвода КАК НомерСвода,
	|	ВложенныйЗапрос.ДатаСвода КАК ДатаСвода,
	|	ВложенныйЗапрос.УдержатьВознаграждение КАК УдержатьВознаграждение,
	|	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	|	ВложенныйЗапрос.Характеристика КАК Характеристика,
	|	ВложенныйЗапрос.СуммаПродажи КАК СуммаПродажи,
	|	ВложенныйЗапрос.СуммаВознаграждения КАК СуммаВознаграждения,
	|	ВложенныйЗапрос.СуммаНДСВознаграждения КАК СуммаНДСВознаграждения,
	|	ЕСТЬNULL(СуществующиеДокументы.ОтчетКомитентуСсылка, НЕОПРЕДЕЛЕНО) КАК ОтчетКомитентуСсылка,
	|	ЕСТЬNULL(СуществующиеДокументы.СчетФактураСсылка, НЕОПРЕДЕЛЕНО) КАК СчетФактураСсылка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаТовары.ДокументОснование КАК ДокументОснование,
	|		ТаблицаТовары.Организация КАК Организация,
	|		ТаблицаТовары.Партнер КАК Партнер,
	|		ТаблицаТовары.Контрагент КАК Контрагент,
	|		ТаблицаТовары.Договор КАК Договор,
	|		ТаблицаТовары.НалогообложениеНДС КАК НалогообложениеНДС,
	|		ТаблицаТовары.Подразделение КАК Подразделение,
	|		ТаблицаТовары.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|		ТаблицаТовары.ФормаОплаты КАК ФормаОплаты,
	|		ТаблицаТовары.ПорядокРасчетов КАК ПорядокРасчетов,
	|		ТаблицаТовары.БанковскийСчет КАК БанковскийСчет,
	|		ТаблицаТовары.Дата КАК Дата,
	|		ТаблицаТовары.Покупатель КАК Покупатель,
	|		ТаблицаТовары.Склад КАК Склад,
	|		ТаблицаТовары.СводЗаявок КАК СводЗаявок,
	|		ТаблицаТовары.НомерСвода КАК НомерСвода,
	|		ТаблицаТовары.ДатаСвода КАК ДатаСвода,
	|		ТаблицаТовары.УдержатьВознаграждение КАК УдержатьВознаграждение,
	|		ТаблицаТовары.Номенклатура КАК Номенклатура,
	|		ТаблицаТовары.Характеристика КАК Характеристика,
	|		ТаблицаТовары.СуммаПродажи КАК СуммаПродажи,
	|		ВЫРАЗИТЬ(ТаблицаТовары.СуммаВознаграждения * ТаблицаТовары.СуммаПродажи / ВЫБОР
	|				КОГДА СуммыПродажДляРаспределенияВознаграждения.СуммаПродажи = 0
	|					ТОГДА 0
	|				ИНАЧЕ СуммыПродажДляРаспределенияВознаграждения.СуммаПродажи
	|			КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаВознаграждения,
	|		ВЫРАЗИТЬ(ТаблицаТовары.СуммаНДСВознаграждения * ТаблицаТовары.СуммаПродажи / ВЫБОР
	|				КОГДА СуммыПродажДляРаспределенияВознаграждения.СуммаПродажи = 0
	|					ТОГДА 0
	|				ИНАЧЕ СуммыПродажДляРаспределенияВознаграждения.СуммаПродажи
	|			КОНЕЦ КАК ЧИСЛО(15, 2)) КАК СуммаНДСВознаграждения	
	|	ИЗ
	|		ТаблицаТовары КАК ТаблицаТовары
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ СуммыПродажДляРаспределенияВознаграждения КАК СуммыПродажДляРаспределенияВознаграждения
	|			ПО ТаблицаТовары.СводЗаявок = СуммыПродажДляРаспределенияВознаграждения.СводЗаявок
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаВознаграждения.ДокументОснование,
	|		ТаблицаВознаграждения.Организация,
	|		ТаблицаВознаграждения.Партнер,
	|		ТаблицаВознаграждения.Контрагент,
	|		ТаблицаВознаграждения.Договор,
	|		ТаблицаВознаграждения.НалогообложениеНДС,
	|		ТаблицаВознаграждения.Подразделение,
	|		ТаблицаВознаграждения.ЦенаВключаетНДС,
	|		ТаблицаВознаграждения.ФормаОплаты,
	|		ТаблицаВознаграждения.ПорядокРасчетов,
	|		ТаблицаВознаграждения.БанковскийСчет,
	|		ТаблицаВознаграждения.Дата,
	|		ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель),
	|		ТаблицаВознаграждения.Склад,
	|		ТаблицаВознаграждения.СводЗаявок,
	|		ТаблицаВознаграждения.НомерСвода,
	|		ТаблицаВознаграждения.ДатаСвода,
	|		ТаблицаВознаграждения.УдержатьВознаграждение,
	|		НЕОПРЕДЕЛЕНО,
	|		НЕОПРЕДЕЛЕНО,
	|		0,
	|		ТаблицаВознаграждения.Сумма,
	|		ТаблицаВознаграждения.НДС
	|	ИЗ
	|		ТаблицаВознаграждения КАК ТаблицаВознаграждения) КАК ВложенныйЗапрос
	|		ЛЕВОЕ СОЕДИНЕНИЕ СуществующиеДокументы КАК СуществующиеДокументы
	|		ПО ВложенныйЗапрос.ДокументОснование = СуществующиеДокументы.ДокументОснование
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	Партнер,
	|	Договор,
	|	НомерСвода
	|ИТОГИ
	|	МАКСИМУМ(НалогообложениеНДС),
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(ЦенаВключаетНДС),
	|	МАКСИМУМ(ФормаОплаты),
	|	МАКСИМУМ(ПорядокРасчетов),
	|	МАКСИМУМ(БанковскийСчет),
	|	МИНИМУМ(Дата),
	|	МАКСИМУМ(УдержатьВознаграждение),
	|	СУММА(СуммаПродажи),
	|	СУММА(СуммаВознаграждения),
	|	СУММА(СуммаНДСВознаграждения),
	|	МИНИМУМ(ОтчетКомитентуСсылка),
	|	МИНИМУМ(СчетФактураСсылка)
	|ПО
	|	Организация,
	|	Партнер,
	|	Контрагент,
	|	Договор,
	|	ДокументОснование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуществующиеДокументы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуммыПродажДляРаспределенияВознаграждения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Организация КАК Организация,
	|	ВложенныйЗапрос.Партнер КАК Партнер,
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	ВложенныйЗапрос.Договор КАК Договор,
	|	СУММА(ВложенныйЗапрос.СуммаВознаграждения) КАК Сумма,
	|	СУММА(ВложенныйЗапрос.СуммаНДСВознаграждения) КАК НДС
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВложенныйЗапрос.Организация КАК Организация,
	|		ВложенныйЗапрос.Партнер КАК Партнер,
	|		ВложенныйЗапрос.Контрагент КАК Контрагент,
	|		ВложенныйЗапрос.Договор КАК Договор,
	|		ВложенныйЗапрос.СуммаВознаграждения КАК СуммаВознаграждения,
	|		ВложенныйЗапрос.СуммаНДСВознаграждения КАК СуммаНДСВознаграждения
	|	ИЗ
	|		(ВЫБРАТЬ
	|			ТаблицаТовары.Организация КАК Организация,
	|			ТаблицаТовары.Партнер КАК Партнер,
	|			ТаблицаТовары.Контрагент КАК Контрагент,
	|			ТаблицаТовары.Договор КАК Договор,
	|			ТаблицаТовары.СводЗаявок КАК СводЗаявок,
	|			МАКСИМУМ(ТаблицаТовары.СуммаВознаграждения) КАК СуммаВознаграждения,
	|			МАКСИМУМ(ТаблицаТовары.СуммаНДСВознаграждения) КАК СуммаНДСВознаграждения
	|		ИЗ
	|			ТаблицаТовары КАК ТаблицаТовары
	|		
	|		СГРУППИРОВАТЬ ПО
	|			ТаблицаТовары.Организация,
	|			ТаблицаТовары.Партнер,
	|			ТаблицаТовары.Контрагент,
	|			ТаблицаТовары.Договор,
	|			ТаблицаТовары.СводЗаявок) КАК ВложенныйЗапрос
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТаблицаВознаграждения.Организация,
	|		ТаблицаВознаграждения.Партнер,
	|		ТаблицаВознаграждения.Контрагент,
	|		ТаблицаВознаграждения.Договор,
	|		ТаблицаВознаграждения.Сумма,
	|		ТаблицаВознаграждения.НДС
	|	ИЗ
	|		ТаблицаВознаграждения КАК ТаблицаВознаграждения) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Организация,
	|	ВложенныйЗапрос.Партнер,
	|	ВложенныйЗапрос.Контрагент,
	|	ВложенныйЗапрос.Договор";
				
	Менеджер = Пользователи.ТекущийПользователь();
	ВалютаДокумента = Константы.ВалютаРегламентированногоУчета.Получить();
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	СуммыВознагражденияОбщие = РезультатЗапроса[9].Выбрать();
	
	СтруктураПоиска = Новый Структура("Организация,Партнер,Контрагент,Договор");
	
	ВыборкаОрганизации = РезультатЗапроса[6].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизации.Следующий() Цикл
		
		
		Если УчетнаяПолитикаПереопределяемый.ПрименяетсяУСН(ВыборкаОрганизации.Организация, Параметры.НачалоПериода) Тогда
			НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
		Иначе
			НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		КонецЕсли;
		
		//#TODO Костыль для УСН Орион - НДС нужен.
		Если ВыборкаОрганизации.Организация = ОрионОрганизация Тогда
			НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		КонецЕсли;
	
		ВыборкаПартнеры = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПартнеры.Следующий() Цикл
			ВыборкаКонтрагенты = ВыборкаПартнеры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагенты.Следующий() Цикл
				ВыборкаДоговоры = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДоговоры.Следующий() Цикл
					
					// Найдём строку в таблице созданных документов, в которую будем добавлять отчеты комитенту.
					СтрокаСозданныхДокументов = ТаблицаСозданныхДокументов.НайтиСтроки(
						Новый Структура("Партнер,Договор",
							ВыборкаДоговоры.Партнер,
							ВыборкаДоговоры.Договор))[0];
					
					ВыборкаОснования = ВыборкаДоговоры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаОснования.Следующий() Цикл
						
						Если ЗначениеЗаполнено(ВыборкаОснования.ОтчетКомитентуСсылка) Тогда
							
							Если Параметры.ТолькоСоздаватьНовые Тогда
								Продолжить;
							КонецЕсли; 
							
							ОтчетКомитенту = ВыборкаОснования.ОтчетКомитентуСсылка.ПолучитьОбъект();
							
							ОтчетКомитенту.Товары.Очистить();
							ОтчетКомитенту.ЭтапыГрафикаОплаты.Очистить();
							
						Иначе
							
							ОтчетКомитенту = Документы.ОтчетКомитенту.СоздатьДокумент();
							ОтчетКомитенту.Дата = ВыборкаОснования.Дата;
							ОтчетКомитенту.Организация = ВыборкаОснования.Организация;
							ОтчетКомитенту.Партнер = ВыборкаОснования.Партнер;
							ОтчетКомитенту.Контрагент = ВыборкаОснования.Контрагент;
							ОтчетКомитенту.Договор = ВыборкаОснования.Договор;
							ОтчетКомитенту.Логс_ДокументОснование = ВыборкаОснования.ДокументОснование;
							
						КонецЕсли; 
						
						СуммаПродаж = ВыборкаОснования.СуммаПродажи;
					
						СуммыВознагражденияОбщие.Сбросить();
						ЗаполнитьЗначенияСвойств(СтруктураПоиска, ВыборкаОснования);
						
						Если СуммыВознагражденияОбщие.НайтиСледующий(СтруктураПоиска) Тогда
							СуммаВознагражденияВсего = СуммыВознагражденияОбщие.Сумма;
							СуммаНДСВсего = СуммыВознагражденияОбщие.НДС;
						Иначе
							СуммаВознагражденияВсего = 0;
							СуммаНДСВсего = 0;
						КонецЕсли;							
						
						ОтчетКомитенту.НалогообложениеНДС = НалогообложениеНДС;
						ОтчетКомитенту.Валюта = ВалютаДокумента;
						ОтчетКомитенту.Подразделение = ВыборкаОснования.Подразделение;
						ОтчетКомитенту.Менеджер = Менеджер;
						ОтчетКомитенту.ЦенаВключаетНДС = ВыборкаОснования.ЦенаВключаетНДС;
						ОтчетКомитенту.СпособРасчетаВознаграждения = Перечисления.СпособыРасчетаКомиссионногоВознаграждения.ПроцентОтСуммыПродажи;
						ОтчетКомитенту.ФормаОплаты = ВыборкаОснования.ФормаОплаты;
						ОтчетКомитенту.БанковскийСчет = ВыборкаОснования.БанковскийСчет;
						ОтчетКомитенту.ДатаПлатежа = НачалоДня(ОтчетКомитенту.Дата);
						ОтчетКомитенту.НачалоПериода = Параметры.НачалоПериода;
						ОтчетКомитенту.КонецПериода = Параметры.КонецПериода;
						ОтчетКомитенту.ПорядокРасчетов = ВыборкаОснования.ПорядокРасчетов;
						ОтчетКомитенту.УдержатьВознаграждение = ВыборкаОснования.УдержатьВознаграждение;
						
						ОтчетКомитенту.Услуга = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.УслугаДоставка();
						ОтчетКомитенту.СуммаВознаграждения = СуммаВознагражденияВсего;
						ОтчетКомитенту.ПроцентВознаграждения = ?(СуммаПродаж = 0, 0, СуммаВознагражденияВсего / СуммаПродаж * 100); 
						//#TODO Костыль для УСН Орион - НДС нужен.
						Если ОтчетКомитенту.Организация = ОрионОрганизация И ОтчетКомитенту.Дата < Дата("20260101") Тогда
							ОтчетКомитенту.СтавкаНДСВознаграждения = СтавкаНДС5; 
						ИначеЕсли (ОтчетКомитенту.Организация = ЛогсисОрганизация ИЛИ ОтчетКомитенту.Организация = ОрионОрганизация)
							И ОтчетКомитенту.Дата >= Дата("20260101") Тогда  
						  	ОтчетКомитенту.СтавкаНДСВознаграждения =
							?(ОтчетКомитенту.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
							  СтавкаНДС22, СтавкаБезНДС
							);
                    	Иначе								
							
							ОтчетКомитенту.СтавкаНДСВознаграждения =
							?(ОтчетКомитенту.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
								//Перечисления.СтавкиНДС.НДС20,
								//Перечисления.СтавкиНДС.БезНДС
								СтавкаНДС20, СтавкаБезНДС
							);
						КонецЕсли;

						//ОтчетКомитенту.СтавкаНДСВознаграждения =
						//	?(ОтчетКомитенту.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
						//		//Перечисления.СтавкиНДС.НДС20,
						//		//Перечисления.СтавкиНДС.БезНДС
						//		СтавкаНДС20, СтавкаБезНДС
						//	);
							
						//ПроцентНДС = УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(ОтчетКомитенту.СтавкаНДСВознаграждения);
						ПроцентНДС = УчетНДСУПВызовСервера.ЗначениеСтавкиНДС(ОтчетКомитенту.СтавкаНДСВознаграждения);
						ОтчетКомитенту.СуммаНДСВознаграждения = СуммаНДСВсего;
	
						ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(ОтчетКомитенту);
						
						Выборка = ВыборкаОснования.Выбрать();
						Пока Выборка.Следующий() Цикл
							НоваяСтрока = ОтчетКомитенту.Товары.Добавить();
							Если Выборка.Номенклатура = Неопределено Тогда
								НоваяСтрока.Номенклатура = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ТоварАгента();
								НоваяСтрока.Характеристика = Логс_ДополнительныеПроцедурыИФункции.ПолучитьХарактеристикуНоменклатурыАгента(
									НоваяСтрока.Номенклатура, ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.СводЗаявок, "Номер"));
							Иначе
								НоваяСтрока.Номенклатура = Выборка.Номенклатура;
								НоваяСтрока.Характеристика = Выборка.Характеристика;
							КонецЕсли; 
							НоваяСтрока.Количество = Выборка.СуммаПродажи;
							НоваяСтрока.КоличествоУпаковок = Выборка.СуммаПродажи;
							НоваяСтрока.СуммаСНДС = Выборка.СуммаПродажи; 
							
							//#TODO Костыль по Ориону
							Если ОтчетКомитенту.СтавкаНДСВознаграждения = СтавкаНДС5 Тогда
							НоваяСтрока.СтавкаНДС = ?(Выборка.СуммаНДСВознаграждения <> 0,
														//Перечисления.СтавкиНДС.НДС20,
														//Перечисления.СтавкиНДС.БезНДС
														СтавкаНДС5, СтавкаБезНДС
													);
							ИначеЕсли ОтчетКомитенту.СтавкаНДСВознаграждения = СтавкаНДС22 Тогда 
							НоваяСтрока.СтавкаНДС = ?(Выборка.СуммаНДСВознаграждения <> 0,
														СтавкаНДС22, СтавкаБезНДС);
												
							Иначе
							НоваяСтрока.СтавкаНДС = ?(Выборка.СуммаНДСВознаграждения <> 0,
														//Перечисления.СтавкиНДС.НДС20,
														//Перечисления.СтавкиНДС.БезНДС
														СтавкаНДС20, СтавкаБезНДС
													); 
							КонецЕсли;
							НоваяСтрока.СуммаНДС = Выборка.СуммаНДСВознаграждения;							
							//НоваяСтрока.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(НоваяСтрока.Сумма,
							//							УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС),
							//							ОтчетКомитенту.ЦенаВключаетНДС, ОтчетКомитенту.НалогообложениеНДС);
							НоваяСтрока.Сумма = НоваяСтрока.СуммаСНДС - ?(ОтчетКомитенту.ЦенаВключаетНДС, 0, НоваяСтрока.СуммаНДС);
							НоваяСтрока.Цена = 1;
							НоваяСтрока.ЦенаПродажи = 1;
							НоваяСтрока.СуммаПродажи = НоваяСтрока.СуммаСНДС;
							НоваяСтрока.Покупатель = Выборка.Покупатель;
							НоваяСтрока.Логс_СводЗаявокНаДоставку = Выборка.СводЗаявок;
							//НоваяСтрока.СуммаВознаграждения = СуммаВознагражденияВсего * ?(СуммаПродаж = 0, 0, Выборка.Сумма / СуммаПродаж);
							НоваяСтрока.СуммаВознаграждения = Выборка.СуммаВознаграждения;
							НоваяСтрока.СуммаНДСВознаграждения = Выборка.СуммаНДСВознаграждения;
						КонецЦикла;
						
						// В результате распределения суммы вознаграждения по строкам табличной части из-за округления
						// могла возникнуть разница в копейках. В таком случае скорректируем последнюю строку.
						// ABS 26.12.2019 Архипкин Р.В. переносим корректировку с первой строки на последнюю
						ТабТовары = ОтчетКомитенту.Товары.Выгрузить();
						ТабТовары.Свернуть("Логс_СводЗаявокНаДоставку", "СуммаВознаграждения");
						Для каждого СтрокаСвод Из ТабТовары Цикл
							
							Разница = СтрокаСвод.Логс_СводЗаявокНаДоставку.ПолнаяСтоимостьВсего - СтрокаСвод.СуммаВознаграждения;								
							Если Разница <> 0 Тогда
								МассивСтроки = ОтчетКомитенту.Товары.НайтиСтроки(Новый Структура("Логс_СводЗаявокНаДоставку", СтрокаСвод.Логс_СводЗаявокНаДоставку));
								Строка = МассивСтроки[0];
								Строка.СуммаВознаграждения = Строка.СуммаВознаграждения + Разница;
							КонецЕсли;						
						КонецЦикла;
						
						ПараметрыДляДобавления = ЭтапыОплатыКлиентСервер.ПараметрыДляДобавленияЭтапаПоУмолчанию();
						ПараметрыДляДобавления.Объект = ОтчетКомитенту;
						ПараметрыДляДобавления.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыПоставщику.КредитСдвиг;
						ПараметрыДляДобавления.ЖелаемаяДата = НачалоДня(ОтчетКомитенту.Дата);
						ПараметрыДляДобавления.ДатаСеанса = ТекущаяДатаСеанса();
						ПараметрыДляДобавления.СуммаОплатыПоДокументу = СуммаПродаж;
						
						ЭтапыОплатыКлиентСервер.ДобавитьЭтапОплатыПоУмолчанию(ПараметрыДляДобавления);
						ОтчетКомитенту.ЭтапыГрафикаОплаты[0].ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки;
						
						Если ОтчетКомитенту.Ссылка.Пустая() Тогда
							ОтчетКомитенту.Записать(РежимЗаписиДокумента.Запись);
						КонецЕсли; 
						
						Попытка
							ОтчетКомитенту.Записать(РежимЗаписиДокумента.Проведение);
						Исключение
							ОтчетКомитенту.Записать(РежимЗаписиДокумента.Запись);
							ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
							ТекстСообщения = СтрШаблон(
								НСтр("ru='Произошла ошибка при записи отчета комитенту № %1 от %2: %3'"),
								ОтчетКомитенту.Номер, Формат(ОтчетКомитенту.Дата, "ДФ=dd.MM.yyyy"),
								ОписаниеОшибки);
							ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание отчета комитенту",
								УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
							СписокОшибок.Вставить(ОтчетКомитенту.Ссылка, ОписаниеОшибки);
						КонецПопытки;
				
						СтрокаСозданныхДокументов.ДокументыОтчетовКомитентам.Добавить(
							Новый Структура("Ссылка,Номер,Дата,Организация,Контрагент,СчетФактура",
								ОтчетКомитенту.Ссылка,
								ОтчетКомитенту.Номер,
								ОтчетКомитенту.Дата + 1,
								ОтчетКомитенту.Организация,
								ОтчетКомитенту.Контрагент,
								ВыборкаОснования.СчетФактураСсылка
							));
						
					КонецЦикла; // Основания
				КонецЦикла; // Договоры
				
			КонецЦикла; // Контрагенты
		КонецЦикла; // Партнеры
	КонецЦикла; // Организации
	
КонецПроцедуры 

Процедура СоздатьДокументыАктВыполненныхРабот(Параметры, МенеджерВременныхТаблиц, ТаблицаСозданныхДокументов, СписокОшибок)
	
	Если Не Параметры.Создавать.СоздаватьАктыВыполненныхРабот Тогда
		Возврат;
	КонецЕсли;	
	
	СтавкаНДС20 = Константы.Логс_СтавкаНДС20.Получить();
	СтавкаБезНДС = Справочники.СтавкиНДС.БезНДС;
	СтавкаНДС5  = Справочники.СтавкиНДС.НайтиПоНаименованию("5%"); 
	СтавкаНДС22 = Справочники.СтавкиНДС.НайтиПоНаименованию("22%");
	ЛогсисОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9725007793");
    ОрионОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9728051543");
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Дата", НачалоДня(Параметры.ДатаФормирования));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Параметры.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Параметры.КонецПериода));
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СводЗаявокНаДоставку.Организация КАК Организация,
	|	СводЗаявокНаДоставку.Партнер КАК Партнер,
	|	СводЗаявокНаДоставку.Контрагент КАК Контрагент,
	|	СводЗаявокНаДоставку.Договор КАК Договор
	|ПОМЕСТИТЬ СводЗаявокТолькоУслуги
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку КАК СводЗаявокНаДоставку
	|ГДЕ
	|	СводЗаявокНаДоставку.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СводЗаявокНаДоставку.ВидКлиента <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.СКС)
	|	И СводЗаявокНаДоставку.Договор В
	|			(ВЫБРАТЬ
	|				СписокДоговоров.Договор
	|			ИЗ
	|				СписокДоговоров)
	|	И СводЗаявокНаДоставку.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	СводЗаявокНаДоставку.Организация,
	|	СводЗаявокНаДоставку.Партнер,
	|	СводЗаявокНаДоставку.Контрагент,
	|	СводЗаявокНаДоставку.Договор
	|
	|ИМЕЮЩИЕ
	|	СУММА(СводЗаявокНаДоставку.НаложенныйПлатежВсего) = 0 И
	|	СУММА(СводЗаявокНаДоставку.ПолнаяСтоимостьВсего) > 0
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Партнер,
	|	Контрагент,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводЗаявокНаДоставку.Ссылка КАК Ссылка,
	|	СводЗаявокНаДоставку.Номер КАК Номер,
	|	СводЗаявокНаДоставку.Дата КАК Дата,
	|	СводЗаявокНаДоставку.Организация КАК Организация,
	|	СводЗаявокНаДоставку.Партнер КАК Партнер,
	|	СводЗаявокНаДоставку.Контрагент КАК Контрагент,
	|	СводЗаявокНаДоставку.Договор КАК Договор,
	|	СводЗаявокНаДоставку.НалогообложениеНДС КАК НалогообложениеНДС,
	|	СводЗаявокНаДоставку.Валюта КАК Валюта,
	|	СводЗаявокНаДоставку.ФормаОплаты КАК ФормаОплаты,
	|	СписокДоговоров.Подразделение КАК Подразделение,
	|	СписокДоговоров.БанковскийСчет КАК БанковскийСчет,
	|	СписокДоговоров.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	СписокДоговоров.ПорядокРасчетов КАК ПорядокРасчетов,
	|	СписокДоговоров.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	СписокДоговоров.Основание КАК Основание,
	|	СписокДоговоров.ОснованиеДата КАК ОснованиеДата,
	|	СписокДоговоров.ОснованиеНомер КАК ОснованиеНомер,
	|	СписокДоговоров.ДоговорНаОказаниеУслуг КАК ДоговорНаОказаниеУслуг,
	|	СводЗаявокНаДоставку.ПолнаяСтоимостьВсего КАК СуммаУслуг,
	|	ВЗ_СводЗаявокНаДоставкуНДС.НДС КАК НДС
	|ПОМЕСТИТЬ СводЗаявокОбщий
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку КАК СводЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДоговоров КАК СписокДоговоров
	|		ПО СводЗаявокНаДоставку.Договор = СписокДоговоров.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Логс_СводЗаявокНаДоставкуЗаявки.Ссылка КАК Ссылка,
	|			СУММА(Логс_СводЗаявокНаДоставкуЗаявки.ПолнаяСтоимостьНДС) КАК НДС
	|		ИЗ
	|			Документ.Логс_СводЗаявокНаДоставку.Заявки КАК Логс_СводЗаявокНаДоставкуЗаявки
	|		
	|		СГРУППИРОВАТЬ ПО
	|			Логс_СводЗаявокНаДоставкуЗаявки.Ссылка) КАК ВЗ_СводЗаявокНаДоставкуНДС
	|		ПО СводЗаявокНаДоставку.Ссылка = ВЗ_СводЗаявокНаДоставкуНДС.Ссылка
	|ГДЕ
	|	СводЗаявокНаДоставку.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СводЗаявокНаДоставку.НаложенныйПлатежВсего = 0
	|	И СводЗаявокНаДоставку.ПолнаяСтоимостьВсего > 0
	|	И СводЗаявокНаДоставку.ВидКлиента <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.СКС)
	|	И (СводЗаявокНаДоставку.Организация, СводЗаявокНаДоставку.Партнер, СводЗаявокНаДоставку.Контрагент, СводЗаявокНаДоставку.Договор) В
	|			(ВЫБРАТЬ
	|				СводЗаявокТолькоУслуги.Организация,
	|				СводЗаявокТолькоУслуги.Партнер,
	|				СводЗаявокТолькоУслуги.Контрагент,
	|				СводЗаявокТолькоУслуги.Договор
	|			ИЗ
	|				СводЗаявокТолькоУслуги)
	|	И СводЗаявокНаДоставку.Проведен
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	АктВыполненныхРаботУслуги.Логс_СводЗаявокНаДоставку КАК СводЗаявок
	|ПОМЕСТИТЬ СуществующиеАкты
	|ИЗ
	|	Документ.АктВыполненныхРабот.Услуги КАК АктВыполненныхРаботУслуги
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
	|		ПО АктВыполненныхРаботУслуги.Ссылка = АктВыполненныхРабот.Ссылка
	|ГДЕ
	|	АктВыполненныхРаботУслуги.Логс_СводЗаявокНаДоставку В
	|			(ВЫБРАТЬ
	|				СводЗаявокОбщий.Ссылка
	|			ИЗ
	|				СводЗаявокОбщий)
	|	И НАЧАЛОПЕРИОДА(АктВыполненныхРабот.Дата, ДЕНЬ) <> &Дата
	|	И АктВыполненныхРабот.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводЗаявок.Ссылка КАК Ссылка,
	|	СводЗаявок.Номер КАК Номер,
	|	СводЗаявок.Дата КАК Дата,
	|	СводЗаявок.Организация КАК Организация,
	|	СводЗаявок.Партнер КАК Партнер,
	|	СводЗаявок.Контрагент КАК Контрагент,
	|	СводЗаявок.Договор КАК Договор,
	|	СводЗаявок.НалогообложениеНДС КАК НалогообложениеНДС,
	|	СводЗаявок.Валюта КАК Валюта,
	|	СводЗаявок.ФормаОплаты КАК ФормаОплаты,
	|	СводЗаявок.Подразделение КАК Подразделение,
	|	СводЗаявок.БанковскийСчет КАК БанковскийСчет,
	|	СводЗаявок.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	СводЗаявок.ПорядокРасчетов КАК ПорядокРасчетов,
	|	СводЗаявок.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	СводЗаявок.Основание КАК Основание,
	|	СводЗаявок.ОснованиеДата КАК ОснованиеДата,
	|	СводЗаявок.ОснованиеНомер КАК ОснованиеНомер,
	|	СводЗаявок.ДоговорНаОказаниеУслуг КАК ДоговорНаОказаниеУслуг,
	|	СводЗаявок.СуммаУслуг КАК СуммаУслуг,
	|	СводЗаявок.НДС КАК НДС
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	СводЗаявокОбщий КАК СводЗаявок
	|ГДЕ
	|	НЕ СводЗаявок.Ссылка В
	|				(ВЫБРАТЬ
	|					СуществующиеАкты.СводЗаявок
	|				ИЗ
	|					СуществующиеАкты)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СводЗаявокОбщий
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ СуществующиеАкты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Данные.Организация КАК Организация,
	|	Данные.Партнер КАК Партнер,
	|	Данные.Контрагент КАК Контрагент,
	|	Данные.Договор КАК Договор
	|ПОМЕСТИТЬ ДанныеДляПоискаАктов
	|ИЗ
	|	Данные КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Организация КАК Организация,
	|	Данные.Партнер КАК Партнер,
	|	Данные.Контрагент КАК Контрагент,
	|	Данные.Договор КАК Договор,
	|	МИНИМУМ(АктВыполненныхРабот.Ссылка) КАК Ссылка,
	|	МИНИМУМ(ЕСТЬNULL(СчетФактураВыданныйДокументыОснования.Ссылка, НЕОПРЕДЕЛЕНО)) КАК СчетФактураСсылка
	|ПОМЕСТИТЬ АктыВыполненныхРабот
	|ИЗ
	|	ДанныеДляПоискаАктов КАК Данные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.АктВыполненныхРабот КАК АктВыполненныхРабот
	|			ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетФактураВыданный.ДокументыОснования КАК СчетФактураВыданныйДокументыОснования
	|			ПО АктВыполненныхРабот.Ссылка = СчетФактураВыданныйДокументыОснования.ДокументОснование
	|				И (НЕ СчетФактураВыданныйДокументыОснования.Ссылка.ПометкаУдаления)
	|		ПО Данные.Организация = АктВыполненныхРабот.Организация
	|			И Данные.Партнер = АктВыполненныхРабот.Партнер
	|			И Данные.Контрагент = АктВыполненныхРабот.Контрагент
	|			И Данные.Договор = АктВыполненныхРабот.Договор
	|			И (НАЧАЛОПЕРИОДА(АктВыполненныхРабот.Дата, ДЕНЬ) = &Дата)
	|			И (НЕ АктВыполненныхРабот.ПометкаУдаления)
	|
	|СГРУППИРОВАТЬ ПО
	|	Данные.Организация,
	|	Данные.Партнер,
	|	Данные.Контрагент,
	|	Данные.Договор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация,
	|	Партнер,
	|	Контрагент,
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Ссылка КАК Ссылка,
	|	Данные.Номер КАК Номер,
	|	Данные.Дата КАК Дата,
	|	Данные.Организация КАК Организация,
	|	Данные.Партнер КАК Партнер,
	|	Данные.Контрагент КАК Контрагент,
	|	Данные.Договор КАК Договор,
	|	Данные.НалогообложениеНДС КАК НалогообложениеНДС,
	|	Данные.Валюта КАК Валюта,
	|	Данные.Подразделение КАК Подразделение,
	|	Данные.БанковскийСчет КАК БанковскийСчет,
	|	Данные.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	Данные.ПорядокРасчетов КАК ПорядокРасчетов,
	|	Данные.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	Данные.Основание КАК Основание,
	|	Данные.ОснованиеДата КАК ОснованиеДата,
	|	Данные.ОснованиеНомер КАК ОснованиеНомер,
	|	Данные.ДоговорНаОказаниеУслуг КАК ДоговорНаОказаниеУслуг,
	|	Данные.СуммаУслуг КАК Сумма,
	|	ЕСТЬNULL(АктыВыполненныхРабот.Ссылка, НЕОПРЕДЕЛЕНО) КАК АктВыполненныхРаботСсылка,
	|	ЕСТЬNULL(АктыВыполненныхРабот.СчетФактураСсылка, НЕОПРЕДЕЛЕНО) КАК СчетФактураСсылка,
	|	Данные.НДС КАК НДС
	|ИЗ
	|	Данные КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ АктыВыполненныхРабот КАК АктыВыполненныхРабот
	|		ПО Данные.Организация = АктыВыполненныхРабот.Организация
	|			И Данные.Партнер = АктыВыполненныхРабот.Партнер
	|			И Данные.Контрагент = АктыВыполненныхРабот.Контрагент
	|			И Данные.Договор = АктыВыполненныхРабот.Договор
	|ИТОГИ
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(БанковскийСчет),
	|	МАКСИМУМ(БанковскийСчетКонтрагента),
	|	МАКСИМУМ(ПорядокРасчетов),
	|	МАКСИМУМ(ВалютаВзаиморасчетов),
	|	МАКСИМУМ(Основание),
	|	МАКСИМУМ(ОснованиеДата),
	|	МАКСИМУМ(ОснованиеНомер),
	|	МАКСИМУМ(ДоговорНаОказаниеУслуг),
	|	МАКСИМУМ(АктВыполненныхРаботСсылка),
	|	МАКСИМУМ(СчетФактураСсылка)
	|ПО
	|	Организация,
	|	Партнер,
	|	Контрагент,
	|	Договор,
	|	НалогообложениеНДС,
	|	Валюта";
	
	ВыборкаОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизации.Следующий() Цикл
		
		Если УчетнаяПолитикаПереопределяемый.ПрименяетсяУСН(ВыборкаОрганизации.Организация, Параметры.НачалоПериода) Тогда
			НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
		Иначе
			НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		КонецЕсли;
		
		//#TODO Костыль для УСН Орион - НДС нужен.
		Если ВыборкаОрганизации.Организация = ОрионОрганизация Тогда
			НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		КонецЕсли;
		         	
		ВыборкаПартнеры = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаПартнеры.Следующий() Цикл
			ВыборкаКонтрагенты = ВыборкаПартнеры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагенты.Следующий() Цикл
				ВыборкаДоговоры = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДоговоры.Следующий() Цикл
					
					// Найдём строку в таблице созданных документов, в которую будем добавлять акты выполненных работ.
					СтрокиСозданныхДокументов = ТаблицаСозданныхДокументов.НайтиСтроки(
						Новый Структура("Партнер,Договор",
							ВыборкаДоговоры.Партнер,
							ВыборкаДоговоры.Договор));
					Если СтрокиСозданныхДокументов.Количество() = 0 Тогда
						СтрокаСозданныхДокументов = ТаблицаСозданныхДокументов.Добавить();
						СтрокаСозданныхДокументов.Партнер = ВыборкаДоговоры.Партнер;
						СтрокаСозданныхДокументов.Договор = ВыборкаДоговоры.Договор;
					Иначе
						СтрокаСозданныхДокументов = СтрокиСозданныхДокументов[0];
					КонецЕсли; 
							
					ВыборкаНалогообложение = ВыборкаДоговоры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаНалогообложение.Следующий() Цикл
						ВыборкаВалюты = ВыборкаНалогообложение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаВалюты.Следующий() Цикл
							
							Если ЗначениеЗаполнено(ВыборкаВалюты.АктВыполненныхРаботСсылка) Тогда
								
								Если Параметры.ТолькоСоздаватьНовые Тогда
									Продолжить;
								КонецЕсли; 
								
								АктВыполненныхРабот = ВыборкаВалюты.АктВыполненныхРаботСсылка.ПолучитьОбъект();
								
								АктВыполненныхРабот.Услуги.Очистить();
								АктВыполненныхРабот.ЭтапыГрафикаОплаты.Очистить();
								
							Иначе
								
								АктВыполненныхРабот = Документы.АктВыполненныхРабот.СоздатьДокумент();
								АктВыполненныхРабот.Дата = НачалоДня(Параметры.ДатаФормирования) + 43203;
								АктВыполненныхРабот.Организация = ВыборкаВалюты.Организация;
								АктВыполненныхРабот.Партнер = ВыборкаВалюты.Партнер;
								АктВыполненныхРабот.Контрагент = ВыборкаВалюты.Контрагент;
								АктВыполненныхРабот.Договор = ВыборкаВалюты.Договор;
								АктВыполненныхРабот.НалогообложениеНДС = НалогообложениеНДС;
								АктВыполненныхРабот.Валюта = ВыборкаВалюты.Валюта;
								//АктВыполненныхРабот.Логс_ДокументОснование = ?(ОтчетКомитенту = Неопределено, Неопределено, ОтчетКомитенту.Ссылка);
								
								АктВыполненныхРабот.УстановитьНовыйНомер();
								
							КонецЕсли; 
							
							АктВыполненныхРабот.Подразделение = ВыборкаВалюты.Подразделение;
							АктВыполненныхРабот.БанковскийСчетОрганизации = ВыборкаВалюты.БанковскийСчет;
							АктВыполненныхРабот.БанковскийСчетКонтрагента = ВыборкаВалюты.БанковскийСчетКонтрагента;
							АктВыполненныхРабот.ВалютаВзаиморасчетов = ВыборкаВалюты.ВалютаВзаиморасчетов;
							АктВыполненныхРабот.ПорядокРасчетов = ВыборкаВалюты.ПорядокРасчетов;
							АктВыполненныхРабот.Основание = ВыборкаВалюты.Основание;
							АктВыполненныхРабот.ОснованиеНомер = ВыборкаВалюты.ОснованиеНомер;
							АктВыполненныхРабот.ОснованиеДата = ВыборкаВалюты.ОснованиеДата;
							АктВыполненныхРабот.Менеджер = Пользователи.ТекущийПользователь();
							АктВыполненныхРабот.Автор = Пользователи.ТекущийПользователь();
							АктВыполненныхРабот.Согласован = Истина;
							АктВыполненныхРабот.ЦенаВключаетНДС = Истина;
							АктВыполненныхРабот.КурсЧислитель = 1;
							//АктВыполненныхРабот.Курс = 1;
							//АктВыполненныхРабот.Кратность = 1;
							
							ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(АктВыполненныхРабот);
							
							Выборка = ВыборкаВалюты.Выбрать();
							Пока Выборка.Следующий() Цикл
								
								Если Выборка.ДоговорНаОказаниеУслуг Тогда
									ДатаНачалаУчета = Дата(2019, 6, 27);
									НачалоПериода = Макс(
										ДатаНачалаУчета,
										?(День(Выборка.Дата) <= 15,
											НачалоМесяца(Выборка.Дата),
											Дата(Год(Выборка.Дата), Месяц(Выборка.Дата), 16)
										));
									КонецПериода = Выборка.Дата;
									ДополнениеКСодержанию = СтрШаблон(НСтр("ru=' по %1 за период с %2 по %3'"),
										Выборка.Основание, День(НачалоПериода), Формат(КонецПериода, "ДЛФ=DD"));
								Иначе
									ДополнениеКСодержанию = "";
								КонецЕсли; 
								
								НоваяСтрока = АктВыполненныхРабот.Услуги.Добавить();
								НоваяСтрока.Номенклатура = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.УслугаДоставка();
								НоваяСтрока.Содержание = Логс_ДополнительныеПроцедурыИФункции.СформироватьНаименованиеУслугНаДоставкуПоСводу(Выборка.Ссылка) +
															ДополнениеКСодержанию;
								НоваяСтрока.Количество = 1;
								НоваяСтрока.Цена = Выборка.Сумма;
								НоваяСтрока.Сумма = Выборка.Сумма;
								
								
								//#TODO Костыль для УСН Орион - НДС нужен.
								Если АктВыполненныхРабот.Организация = ОрионОрганизация  И АктВыполненныхРабот.Дата < Дата("20260101") Тогда
									НоваяСтрока.СтавкаНДС = СтавкаНДС5; 
									
								ИначеЕсли (АктВыполненныхРабот.Организация = ЛогсисОрганизация ИЛИ АктВыполненныхРабот.Организация = ОрионОрганизация)
									И АктВыполненныхРабот.Дата >= Дата("20260101") Тогда 
									НоваяСтрока.СтавкаНДС =
									?(АктВыполненныхРабот.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
									СтавкаНДС22, СтавкаБезНДС
									);
	                            Иначе								
									
									НоваяСтрока.СтавкаНДС =
									?(АктВыполненныхРабот.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
										//Перечисления.СтавкиНДС.НДС20,
										//Перечисления.СтавкиНДС.БезНДС
										СтавкаНДС20, СтавкаБезНДС
									);
								КонецЕсли;
								
								//НоваяСтрока.СтавкаНДС =
								//	?(АктВыполненныхРабот.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
								//		//Перечисления.СтавкиНДС.НДС20,
								//		//Перечисления.СтавкиНДС.БезНДС
								//		СтавкаНДС20, СтавкаБезНДС
								//	);          
									
								//НоваяСтрока.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(НоваяСтрока.Сумма,
								//	УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(НоваяСтрока.СтавкаНДС),
								//	АктВыполненныхРабот.ЦенаВключаетНДС, АктВыполненныхРабот.НалогообложениеНДС);
								НоваяСтрока.СуммаНДС = Выборка.НДС;
								НоваяСтрока.СуммаСНДС = НоваяСтрока.Сумма;
								НоваяСтрока.Логс_СводЗаявокНаДоставку = Выборка.Ссылка;
								НоваяСтрока.Подразделение = Выборка.Подразделение;
								
							КонецЦикла; 
							
							ЭтапОплаты = АктВыполненныхРабот.ЭтапыГрафикаОплаты.Добавить();
							ЭтапОплаты.ВариантОплаты = Перечисления.ВариантыКонтроляОплатыКлиентом.КредитПослеОтгрузки;
							ЭтапОплаты.ДатаПлатежа = НачалоДня(АктВыполненныхРабот.Дата);
							ЭтапОплаты.СуммаПлатежа = АктВыполненныхРабот.Услуги.Итог("СуммаСНДС");
							ЭтапОплаты.ПроцентПлатежа = 100;
							ЭтапОплаты.СуммаВзаиморасчетов = ЭтапОплаты.СуммаПлатежа;
							ЭтапОплаты.ВариантОтсчета = Перечисления.ВариантыОтсчетаДатыПлатежа.ОтДатыОтгрузки;
							
							Если АктВыполненныхРабот.Ссылка.Пустая() Тогда
								АктВыполненныхРабот.Записать(РежимЗаписиДокумента.Запись);
							КонецЕсли; 
							
							Попытка
								АктВыполненныхРабот.Записать(РежимЗаписиДокумента.Проведение);
							Исключение
								ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
								ТекстСообщения = СтрШаблон(
									НСтр("ru='Произошла ошибка при записи акта выполненных работ № %1 от %2: %3'"),
									АктВыполненныхРабот.Номер, Формат(АктВыполненныхРабот.Дата, "ДФ=dd.MM.yyyy"),
									ОписаниеОшибки);
								ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание актов выполненных работ",
									УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
								СписокОшибок.Вставить(АктВыполненныхРабот.Ссылка, ОписаниеОшибки);
							КонецПопытки;
							
							СтрокаСозданныхДокументов.ДокументыАктовВыполненныхРабот.Добавить(
								Новый Структура("Ссылка,Номер,Дата,Организация,Контрагент,СчетФактура",
									АктВыполненныхРабот.Ссылка,
									АктВыполненныхРабот.Номер,
									АктВыполненныхРабот.Дата + 1,
									АктВыполненныхРабот.Организация,
									АктВыполненныхРабот.Контрагент,
									ВыборкаВалюты.СчетФактураСсылка
								));
							
						КонецЦикла; // Валюты
					КонецЦикла; // Налогообложение НДС
				КонецЦикла; // Договоры
			КонецЦикла; // Контрагенты
		КонецЦикла; // Партнеры
	КонецЦикла; // Организации
	
	Запрос.Текст =
	"УНИЧТОЖИТЬ Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДанныеДляПоискаАктов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ АктыВыполненныхРабот";
	Запрос.Выполнить();
	
КонецПроцедуры 

Процедура СоздатьДокументыДвиженияДенежныхСредствПоСКС(Параметры, МенеджерВременныхТаблиц, ТаблицаСозданныхДокументов, СписокОшибок)
	
	//++ Ким Виктор 22.01.2025
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15412
	//Разделение функционала СКС стандарт от СКС ТМС;
	Если Не Параметры.Создавать.СоздаватьПоступления Тогда
		Возврат;
	КонецЕсли;		
	//-- Ким Виктор 22.01.2025
	
	СтавкаНДС20 = Константы.Логс_СтавкаНДС20.Получить();
	СтавкаБезНДС = Справочники.СтавкиНДС.БезНДС;  
	СтавкаНДС5 = Справочники.СтавкиНДС.НайтиПоНаименованию("5%");
	СтавкаНДС22 = Справочники.СтавкиНДС.НайтиПоНаименованию("22%");
	ЛогсисОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9725007793");
    ОрионОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9728051543");

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Дата", НачалоДня(Параметры.ДатаФормирования));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Параметры.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Параметры.КонецПериода));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СводЗаявокНаДоставку.Ссылка КАК Ссылка,
	|	СводЗаявокНаДоставку.Номер КАК Номер,
	|	СводЗаявокНаДоставку.Организация КАК Организация,
	|	СводЗаявокНаДоставку.Партнер КАК Партнер,
	|	СводЗаявокНаДоставку.Контрагент КАК Контрагент,
	|	СводЗаявокНаДоставку.Договор КАК Договор,
	|	СводЗаявокНаДоставку.НалогообложениеНДС КАК НалогообложениеНДС,
	|	СводЗаявокНаДоставку.Валюта КАК Валюта,
	|	СписокДоговоров.Подразделение КАК Подразделение,
	|	СписокДоговоров.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	СписокДоговоров.БанковскийСчет КАК БанковскийСчет,
	|	СписокДоговоров.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	СписокДоговоров.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	СписокДоговоров.ПорядокРасчетов КАК ПорядокРасчетов,
	|	СписокДоговоров.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	СписокДоговоров.ФормаОплатыУслуг КАК ФормаОплатыУслуг,
	|	ПроцентыСтоимостиУслугСКС.Договор КАК ДоговорСПокупателем,
	|	СводЗаявокНаДоставку.ПолнаяСтоимостьВсего КАК Сумма
	|ПОМЕСТИТЬ СводЗаявок
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку КАК СводЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СписокДоговоров КАК СписокДоговоров
	|		ПО СводЗаявокНаДоставку.Договор = СписокДоговоров.Договор
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПроцентыСтоимостиУслугСКС КАК ПроцентыСтоимостиУслугСКС
	|		ПО СводЗаявокНаДоставку.Организация = ПроцентыСтоимостиУслугСКС.Организация
	|			И СводЗаявокНаДоставку.Партнер = ПроцентыСтоимостиУслугСКС.Партнер
	|			И СводЗаявокНаДоставку.Контрагент = ПроцентыСтоимостиУслугСКС.Контрагент
	|ГДЕ
	|	СводЗаявокНаДоставку.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И СводЗаявокНаДоставку.ПолнаяСтоимостьВсего > 0
	|	И СводЗаявокНаДоставку.ВидКлиента = ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.СКС)
	|	И СводЗаявокНаДоставку.Проведен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПриобретениеУслугПрочихАктивов.Договор КАК Договор,
	|	МАКСИМУМ(ПриобретениеУслугПрочихАктивов.Ссылка) КАК ПриобретениеУслуг,
	|	МАКСИМУМ(ЕСТЬNULL(ВзаимозачетЗадолженности.Ссылка, НЕОПРЕДЕЛЕНО)) КАК ВзаимозачетЗадолженности
	|ПОМЕСТИТЬ ДокументыПриобретенияУслуг
	|ИЗ
	|	Документ.ПриобретениеУслугПрочихАктивов КАК ПриобретениеУслугПрочихАктивов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВзаимозачетЗадолженности КАК ВзаимозачетЗадолженности
	|		ПО ПриобретениеУслугПрочихАктивов.Ссылка = ВзаимозачетЗадолженности.ДокументОснование
	|			И (НЕ ВзаимозачетЗадолженности.ПометкаУдаления)
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ПриобретениеУслугПрочихАктивов.Дата, ДЕНЬ) = &Дата
	|	И ПриобретениеУслугПрочихАктивов.Договор В
	|			(ВЫБРАТЬ
	|				СписокДоговоров.Договор
	|			ИЗ
	|				СписокДоговоров)
	|	И ПриобретениеУслугПрочихАктивов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
	|	И НЕ ПриобретениеУслугПрочихАктивов.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеУслугПрочихАктивов.Договор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводЗаявок.Ссылка КАК Ссылка,
	|	СводЗаявок.Номер КАК Номер,
	|	СводЗаявок.Организация КАК Организация,
	|	СводЗаявок.Партнер КАК Партнер,
	|	СводЗаявок.Контрагент КАК Контрагент,
	|	СводЗаявок.Договор КАК Договор,
	|	СводЗаявок.НалогообложениеНДС КАК НалогообложениеНДС,
	|	СводЗаявок.Валюта КАК Валюта,
	|	СводЗаявок.Подразделение КАК Подразделение,
	|	СводЗаявок.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	СводЗаявок.БанковскийСчет КАК БанковскийСчет,
	|	СводЗаявок.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	СводЗаявок.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	СводЗаявок.ПорядокРасчетов КАК ПорядокРасчетов,
	|	СводЗаявок.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	СводЗаявок.ФормаОплатыУслуг КАК ФормаОплатыУслуг,
	|	СводЗаявок.ДоговорСПокупателем КАК ДоговорСПокупателем,
	|	СводЗаявок.Сумма КАК Сумма,
	|	ЕСТЬNULL(ДокументыПриобретенияУслуг.ПриобретениеУслуг, НЕОПРЕДЕЛЕНО) КАК ПриобретениеУслуг,
	|	ЕСТЬNULL(ДокументыПриобретенияУслуг.ВзаимозачетЗадолженности, НЕОПРЕДЕЛЕНО) КАК ВзаимозачетЗадолженности
	|ИЗ
	|	СводЗаявок КАК СводЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДокументыПриобретенияУслуг КАК ДокументыПриобретенияУслуг
	|		ПО СводЗаявок.Договор = ДокументыПриобретенияУслуг.Договор
	|ИТОГИ
	|	МАКСИМУМ(Подразделение),
	|	МАКСИМУМ(ВалютаВзаиморасчетов),
	|	МАКСИМУМ(БанковскийСчет),
	|	МАКСИМУМ(БанковскийСчетКонтрагента),
	|	МАКСИМУМ(ПорядокРасчетов),
	|	МАКСИМУМ(ЦенаВключаетНДС),
	|	МАКСИМУМ(ФормаОплатыУслуг),
	|	МАКСИМУМ(ДоговорСПокупателем),
	|	МАКСИМУМ(ПриобретениеУслуг),
	|	МАКСИМУМ(ВзаимозачетЗадолженности)
	|ПО
	|	Организация,
	|	Партнер,
	|	Контрагент,
	|	Договор,
	|	НалогообложениеНДС,
	|	Валюта";
	
	Менеджер = Пользователи.ТекущийПользователь();
	СтатьяРасходов = Константы.Логс_СтатьяРасходовУслугСКС.Получить();
	АналитикаРасходов = Константы.Логс_АналитикаРасходовУслугСКС.Получить();
	
	ВыборкаОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизации.Следующий() Цикл
		ВыборкаПартнеры = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если УчетнаяПолитикаПереопределяемый.ПрименяетсяУСН(ВыборкаОрганизации.Организация, Параметры.НачалоПериода) Тогда
			НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
		Иначе
			НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		КонецЕсли;	
		
		//#TODO Костыль для УСН Орион - НДС нужен.
		Если ВыборкаОрганизации.Организация = ОрионОрганизация Тогда
			НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		КонецЕсли;

		
		Пока ВыборкаПартнеры.Следующий() Цикл
			ВыборкаКонтрагенты = ВыборкаПартнеры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагенты.Следующий() Цикл
				ВыборкаДоговоры = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДоговоры.Следующий() Цикл
					
					// Найдём строку в таблице созданных документов, в которую будем добавлять приобретения услуг.
					СтрокиСозданныхДокументов = ТаблицаСозданныхДокументов.НайтиСтроки(
						Новый Структура("Партнер,Договор",
							ВыборкаДоговоры.Партнер,
							ВыборкаДоговоры.Договор));
					Если СтрокиСозданныхДокументов.Количество() = 0 Тогда
						СтрокаСозданныхДокументов = ТаблицаСозданныхДокументов.Добавить();
						СтрокаСозданныхДокументов.Партнер = ВыборкаДоговоры.Партнер;
						СтрокаСозданныхДокументов.Договор = ВыборкаДоговоры.Договор;
					Иначе
						СтрокаСозданныхДокументов = СтрокиСозданныхДокументов[0];
					КонецЕсли; 
					
					ВыборкаНалогообложение = ВыборкаДоговоры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаНалогообложение.Следующий() Цикл
						ВыборкаВалюты = ВыборкаНалогообложение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаВалюты.Следующий() Цикл
							
							Если ЗначениеЗаполнено(ВыборкаВалюты.ПриобретениеУслуг) Тогда
								ПриобретениеУслугПрочихАктивов = ВыборкаВалюты.ПриобретениеУслуг.ПолучитьОбъект();
								
								ПриобретениеУслугПрочихАктивов.Расходы.Очистить();
								ПриобретениеУслугПрочихАктивов.РасшифровкаПлатежа.Очистить();
							Иначе
								ПриобретениеУслугПрочихАктивов = Документы.ПриобретениеУслугПрочихАктивов.СоздатьДокумент();
								ПриобретениеУслугПрочихАктивов.Дата = НачалоДня(Параметры.ДатаФормирования) + 43210;
								ПриобретениеУслугПрочихАктивов.Организация = ВыборкаВалюты.Организация;
								ПриобретениеУслугПрочихАктивов.Партнер = ВыборкаВалюты.Партнер;
								ПриобретениеУслугПрочихАктивов.Контрагент = ВыборкаВалюты.Контрагент;
								ПриобретениеУслугПрочихАктивов.Договор = ВыборкаВалюты.Договор;
								ПриобретениеУслугПрочихАктивов.Менеджер = Менеджер;
								
								ПриобретениеУслугПрочихАктивов.УстановитьНовыйНомер();
							КонецЕсли;
	
							ПриобретениеУслугПрочихАктивов.Подразделение = ВыборкаВалюты.Подразделение;
							ПриобретениеУслугПрочихАктивов.Валюта = ВыборкаВалюты.ВалютаВзаиморасчетов;
							ПриобретениеУслугПрочихАктивов.ВалютаВзаиморасчетов = ВыборкаВалюты.ВалютаВзаиморасчетов;
							ПриобретениеУслугПрочихАктивов.ЦенаВключаетНДС = ВыборкаВалюты.ЦенаВключаетНДС;
							ПриобретениеУслугПрочихАктивов.ДатаПлатежа = НачалоДня(ПриобретениеУслугПрочихАктивов.Дата);
							ПриобретениеУслугПрочихАктивов.НалогообложениеНДС = НалогообложениеНДС;
							ПриобретениеУслугПрочихАктивов.БанковскийСчетОрганизации = ВыборкаВалюты.БанковскийСчет;
							ПриобретениеУслугПрочихАктивов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
							ПриобретениеУслугПрочихАктивов.БанковскийСчетКонтрагента = ВыборкаВалюты.БанковскийСчетКонтрагента;
							ПриобретениеУслугПрочихАктивов.ЗакупкаПодДеятельность = ВыборкаВалюты.НалогообложениеНДС;
							ПриобретениеУслугПрочихАктивов.ПорядокРасчетов = ВыборкаВалюты.ПорядокРасчетов;
							ПриобретениеУслугПрочихАктивов.СтатьяДвиженияДенежныхСредств = ВыборкаВалюты.СтатьяДвиженияДенежныхСредств;
							ПриобретениеУслугПрочихАктивов.КурсЧислитель = 1;
							//ПриобретениеУслугПрочихАктивов.Курс = 1;
							//ПриобретениеУслугПрочихАктивов.Кратность = 1;

							ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(ПриобретениеУслугПрочихАктивов);
							
							Выборка = ВыборкаВалюты.Выбрать();
							Пока Выборка.Следующий() Цикл
								СтрокаУслуга = ПриобретениеУслугПрочихАктивов.Расходы.Добавить();
								СтрокаУслуга.Содержание = Логс_ДополнительныеПроцедурыИФункции.СформироватьНаименованиеУслугНаДоставкуПоСводу(Выборка.Ссылка);
								СтрокаУслуга.Количество = 1;
								СтрокаУслуга.Цена = Выборка.Сумма;
								СтрокаУслуга.Сумма = Выборка.Сумма; 
								
								//#TODO Костыль для УСН Орион - НДС нужен.
								Если ПриобретениеУслугПрочихАктивов.Организация = ОрионОрганизация И ПриобретениеУслугПрочихАктивов.Дата < Дата("20260101") Тогда
									СтрокаУслуга.СтавкаНДС = СтавкаНДС5;  
									
								ИначеЕсли (ПриобретениеУслугПрочихАктивов.Организация = ЛогсисОрганизация ИЛИ ПриобретениеУслугПрочихАктивов.Организация = ОрионОрганизация)
									И ПриобретениеУслугПрочихАктивов.Дата >= Дата("20260101") Тогда 
									СтрокаУслуга.СтавкаНДС =
									?(ПриобретениеУслугПрочихАктивов.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
									СтавкаНДС22, СтавкаБезНДС
									);
	                          	Иначе								
									СтрокаУслуга.СтавкаНДС =
									?(ПриобретениеУслугПрочихАктивов.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
										//Перечисления.СтавкиНДС.НДС20,
										//Перечисления.СтавкиНДС.БезНДС
										СтавкаНДС20, СтавкаБезНДС
									);
								КонецЕсли;

								//СтрокаУслуга.СтавкаНДС =
								//	?(ПриобретениеУслугПрочихАктивов.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
								//		//Перечисления.СтавкиНДС.НДС20,
								//		//Перечисления.СтавкиНДС.БезНДС
								//		СтавкаНДС20, СтавкаБезНДС
								//	);      
								
								//СтрокаУслуга.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(СтрокаУслуга.Сумма,
								//	УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(СтрокаУслуга.СтавкаНДС),
								//	ПриобретениеУслугПрочихАктивов.ЦенаВключаетНДС,
								//	ПриобретениеУслугПрочихАктивов.НалогообложениеНДС);
								СтрокаУслуга.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(СтрокаУслуга.Сумма,
									УчетНДСУПВызовСервера.ЗначениеСтавкиНДС(СтрокаУслуга.СтавкаНДС),
									ПриобретениеУслугПрочихАктивов.ЦенаВключаетНДС,
									ПриобретениеУслугПрочихАктивов.НалогообложениеНДС);
								СтрокаУслуга.СуммаСНДС = Выборка.Сумма;
								СтрокаУслуга.СтатьяРасходов = СтатьяРасходов;
								СтрокаУслуга.АналитикаРасходов = АналитикаРасходов;
								СтрокаУслуга.Подразделение = ПриобретениеУслугПрочихАктивов.Подразделение;
								СтрокаУслуга.Логс_СводЗаявокНаДоставку = Выборка.Ссылка;
							КонецЦикла; 
							
							СуммаВсего = ПриобретениеУслугПрочихАктивов.Расходы.Итог("СуммаСНДС");
							
							СтрокаПлатежа = ПриобретениеУслугПрочихАктивов.РасшифровкаПлатежа.Добавить();
							СтрокаПлатежа.Сумма = СуммаВсего;
	
							Если ПриобретениеУслугПрочихАктивов.Ссылка.Пустая() Тогда
								ПриобретениеУслугПрочихАктивов.Записать(РежимЗаписиДокумента.Запись);
							КонецЕсли; 
							
							Попытка
								ПриобретениеУслугПрочихАктивов.Записать(РежимЗаписиДокумента.Проведение);
							Исключение
								ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
								ТекстСообщения = СтрШаблон(
									НСтр("ru='Произошла ошибка при записи приобретения услуг № %1 от %2: %3'"),
									ПриобретениеУслугПрочихАктивов.Номер, Формат(ПриобретениеУслугПрочихАктивов.Дата, "ДФ=dd.MM.yyyy"),
									ОписаниеОшибки);
								ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание приобретения услуг",
									УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
								СписокОшибок.Вставить(ПриобретениеУслугПрочихАктивов.Ссылка, ОписаниеОшибки);
							КонецПопытки;
							
							Если ВыборкаВалюты.ФормаОплатыУслуг = Перечисления.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом Тогда
								ВзаимозачетСсылка = СоздатьДокументВзаимозачетЗадолженностиСКС(ПриобретениеУслугПрочихАктивов.Дата + 1,
									ВыборкаВалюты.Организация, ВыборкаВалюты.Партнер, ВыборкаВалюты.Контрагент, ВыборкаВалюты.Подразделение,
									ВыборкаВалюты.Договор, ВыборкаВалюты.ДоговорСПокупателем, ВыборкаВалюты.ВалютаВзаиморасчетов,
									ПриобретениеУслугПрочихАктивов.Ссылка, СуммаВсего,
									ВыборкаВалюты.ВзаимозачетЗадолженности, СписокОшибок);
							Иначе
								ВзаимозачетСсылка = Неопределено;
							КонецЕсли; 
							
							СтрокаСозданныхДокументов.ДокументыПриобретенияУслугСКС.Добавить(Новый Структура("Ссылка,Взаимозачет",
								ПриобретениеУслугПрочихАктивов.Ссылка, ВзаимозачетСсылка));
							
						КонецЦикла; // Валюты
					КонецЦикла; // Налогообложение НДС
				КонецЦикла; // Договоры
			КонецЦикла; // Контрагенты
		КонецЦикла; // Партнеры
	КонецЦикла; // Организации
	
	Запрос.Текст =
	"УНИЧТОЖИТЬ СводЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ДокументыПриобретенияУслуг";
	Запрос.Выполнить();
	
КонецПроцедуры 

//++ Ким Виктор 17.01.2025
//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15412
Процедура СоздатьДокументыДвиженияДенежныхСредствПоСКСТМС(Параметры, МенеджерВременныхТаблиц, ТаблицаСозданныхДокументов, СписокОшибок)

	Если Не Параметры.Создавать.СоздаватьПоступленияСКСТМС Тогда
		Возврат;
	КонецЕсли;	
	
	СтавкаНДС20 = Константы.Логс_СтавкаНДС20.Получить();
	СтавкаБезНДС = Справочники.СтавкиНДС.БезНДС; 
	СтавкаНДС5	 = Справочники.СтавкиНДС.НайтиПоНаименованию("5%");
	СтавкаНДС22 = Справочники.СтавкиНДС.НайтиПоНаименованию("22%");
	ЛогсисОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9725007793");
	ОрионОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9728051543");

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Дата", НачалоДня(Параметры.ДатаФормирования));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Параметры.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Параметры.КонецПериода));
	
	Партнер = Неопределено;
	Параметры.Свойство("Партнер", Партнер);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ПартнерЗаполнен", ЗначениеЗаполнено(Партнер));
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Логс_СводМаршрутов.Ссылка КАК ДокументСводовМаршрутов,
	|	Логс_СводМаршрутов.ДоговорСКС.Организация КАК Организация,
	|	Логс_СводМаршрутов.КонтрагентСКС КАК КонтрагентСКС,
	|	Логс_СводМаршрутов.ПартнерСКС КАК ПартнерСКС,
	|	Логс_СводМаршрутов.ДоговорСКС КАК ДоговорСКС,
	|	Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.ДоговорРеализации КАК ДоговорСПокупателем,
	|	Логс_СводМаршрутов.СуммаДокумента КАК СуммаДокумента
	|ПОМЕСТИТЬ втСводыМаршрутов
	|ИЗ
	|	Документ.Логс_СводМаршрутов КАК Логс_СводМаршрутов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ПроцентыСтоимостиУслугСКСTMS.СрезПоследних(&НачалоПериода, ) КАК Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних
	|		ПО Логс_СводМаршрутов.КонтрагентСКС = Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Контрагент
	|			И Логс_СводМаршрутов.ПартнерСКС = Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Партнер
	|			И Логс_СводМаршрутов.ДоговорСКС = Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Договор
	|ГДЕ
	|	Логс_СводМаршрутов.Ссылка.Проведен
	|	И Логс_СводМаршрутов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ВЫБОР
	|			КОГДА &ПартнерЗаполнен
	|				ТОГДА Логс_СводМаршрутов.ПартнерСКС = &Партнер
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПриобретениеУслугПрочихАктивовРасходы.Ссылка) КАК ДокументПриобретениеУслуг,
	|	ПриобретениеУслугПрочихАктивовРасходы.Ссылка.Договор КАК Договор,
	|	ПриобретениеУслугПрочихАктивовРасходы.Логс_СводМаршрутов КАК СводМаршрутов
	|ПОМЕСТИТЬ втДокументПриобретениеУслуг
	|ИЗ
	|	втСводыМаршрутов КАК втСводыМаршрутов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК ПриобретениеУслугПрочихАктивовРасходы
	|		ПО втСводыМаршрутов.ДоговорСКС = ПриобретениеУслугПрочихАктивовРасходы.Ссылка.Договор
	|			И втСводыМаршрутов.ДокументСводовМаршрутов = ПриобретениеУслугПрочихАктивовРасходы.Логс_СводМаршрутов
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ПриобретениеУслугПрочихАктивовРасходы.Ссылка.Дата, ДЕНЬ) = &Дата
	|	И НЕ ПриобретениеУслугПрочихАктивовРасходы.Ссылка.ПометкаУдаления
	|	И ПриобретениеУслугПрочихАктивовРасходы.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
	|
	|СГРУППИРОВАТЬ ПО
	|	ПриобретениеУслугПрочихАктивовРасходы.Ссылка.Договор,
	|	ПриобретениеУслугПрочихАктивовРасходы.Логс_СводМаршрутов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втСводыМаршрутов.ДокументСводовМаршрутов КАК ДокументСводовМаршрутов,
	|	втСводыМаршрутов.Организация КАК Организация,
	|	втСводыМаршрутов.КонтрагентСКС КАК Контрагент,
	|	втСводыМаршрутов.ПартнерСКС КАК Партнер,
	|	втСводыМаршрутов.ДоговорСКС КАК Договор,
	|	ЕСТЬNULL(втДокументПриобретениеУслуг.ДокументПриобретениеУслуг, НЕОПРЕДЕЛЕНО) КАК ПриобретениеУслуг,
	|	втСводыМаршрутов.ДоговорСПокупателем КАК ДоговорСПокупателем,
	|	втСводыМаршрутов.ДоговорСКС.БанковскийСчет КАК БанковскийСчет,
	|	втСводыМаршрутов.ДоговорСКС.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	втСводыМаршрутов.ДоговорСКС.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	втСводыМаршрутов.ДоговорСКС.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	втСводыМаршрутов.ДоговорСКС.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	втСводыМаршрутов.ДоговорСКС.НалогообложениеНДС КАК НалогообложениеНДС,
	|	втСводыМаршрутов.ДоговорСКС.ПорядокРасчетов КАК ПорядокРасчетов,
	|	ИСТИНА КАК ЦенаВключаетНДС,
	|	втСводыМаршрутов.ДоговорСКС.СтавкаНДС КАК СтавкаНДС,
	|	втСводыМаршрутов.ДоговорСКС.Подразделение КАК Подразделение,
	|	втСводыМаршрутов.СуммаДокумента КАК Сумма
	|ИЗ
	|	втСводыМаршрутов КАК втСводыМаршрутов
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДокументПриобретениеУслуг КАК втДокументПриобретениеУслуг
	|		ПО втСводыМаршрутов.ДоговорСКС = втДокументПриобретениеУслуг.Договор
	|			И втСводыМаршрутов.ДокументСводовМаршрутов = втДокументПриобретениеУслуг.СводМаршрутов
	|ИТОГИ
	|	МАКСИМУМ(ПриобретениеУслуг),
	|	МАКСИМУМ(ДоговорСПокупателем),
	|	МАКСИМУМ(БанковскийСчет),
	|	МАКСИМУМ(БанковскийСчетКонтрагента),
	|	МАКСИМУМ(ВалютаВзаиморасчетов),
	|	МАКСИМУМ(ПорядокРасчетов),
	|	МАКСИМУМ(ЦенаВключаетНДС),
	|	МАКСИМУМ(Подразделение)
	|ПО
	|	Организация,
	|	Партнер,
	|	Контрагент,
	|	Договор,
	|	НалогообложениеНДС,
	|	ВалютаВзаиморасчетов,
	|	ДокументСводовМаршрутов";
	
	Менеджер = Пользователи.ТекущийПользователь();
	СтатьяРасходов = Константы.Логс_СтатьяРасходовУслугСКС.Получить();
	АналитикаРасходов = Константы.Логс_АналитикаРасходовУслугСКС.Получить();
	НалогообложениеНДС = Неопределено;
	
	ВыборкаОрганизации = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизации.Следующий() Цикл 
		
		ВыборкаПартнеры = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Если УчетнаяПолитикаПереопределяемый.ПрименяетсяУСН(ВыборкаОрганизации.Организация, Параметры.НачалоПериода) Тогда
			НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
		Иначе
			НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		КонецЕсли;
		
		//#TODO Костыль для УСН Орион - НДС нужен.
		Если ВыборкаОрганизации.Организация = ОрионОрганизация Тогда
			НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
		КонецЕсли;

		
		Пока ВыборкаПартнеры.Следующий() Цикл
			ВыборкаКонтрагенты = ВыборкаПартнеры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаКонтрагенты.Следующий() Цикл
				ВыборкаДоговоры = ВыборкаКонтрагенты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаДоговоры.Следующий() Цикл  
					
					// Найдём строку в таблице созданных документов, в которую будем добавлять приобретения услуг.
					СтрокиСозданныхДокументов = ТаблицаСозданныхДокументов.НайтиСтроки(
						Новый Структура("Партнер,Договор",
							ВыборкаДоговоры.Партнер,
							ВыборкаДоговоры.Договор));
					Если СтрокиСозданныхДокументов.Количество() = 0 Тогда
						СтрокаСозданныхДокументов = ТаблицаСозданныхДокументов.Добавить();
						СтрокаСозданныхДокументов.Партнер = ВыборкаДоговоры.Партнер;
						СтрокаСозданныхДокументов.Договор = ВыборкаДоговоры.Договор;
					Иначе
						СтрокаСозданныхДокументов = СтрокиСозданныхДокументов[0];
					КонецЕсли; 
					
					ВыборкаНалогообложение = ВыборкаДоговоры.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаНалогообложение.Следующий() Цикл
						
						ВыборкаВалюты = ВыборкаНалогообложение.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаВалюты.Следующий() Цикл   
							
							ВыборкаПоСводам = ВыборкаВалюты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							
							Пока ВыборкаПоСводам.Следующий() Цикл 
								
								Если ЗначениеЗаполнено(ВыборкаПоСводам.ПриобретениеУслуг) Тогда
									ПриобретениеУслугПрочихАктивов = ВыборкаПоСводам.ПриобретениеУслуг.ПолучитьОбъект();
									
									ПриобретениеУслугПрочихАктивов.Расходы.Очистить();
									ПриобретениеУслугПрочихАктивов.РасшифровкаПлатежа.Очистить();
								Иначе
									ПриобретениеУслугПрочихАктивов = Документы.ПриобретениеУслугПрочихАктивов.СоздатьДокумент();
									ПриобретениеУслугПрочихАктивов.Дата = НачалоДня(Параметры.ДатаФормирования) + 43210;
									ПриобретениеУслугПрочихАктивов.Организация 	= ВыборкаПоСводам.Организация;
									ПриобретениеУслугПрочихАктивов.Партнер 		= ВыборкаПоСводам.Партнер;
									ПриобретениеУслугПрочихАктивов.Контрагент 	= ВыборкаПоСводам.Контрагент;
									ПриобретениеУслугПрочихАктивов.Договор 	    = ВыборкаПоСводам.Договор;
									ПриобретениеУслугПрочихАктивов.Менеджер = Менеджер;
									
									ПриобретениеУслугПрочихАктивов.УстановитьНовыйНомер();
								КонецЕсли;
								
								ПриобретениеУслугПрочихАктивов.Подразделение = ВыборкаПоСводам.Подразделение;
								ПриобретениеУслугПрочихАктивов.Валюта = ВыборкаПоСводам.ВалютаВзаиморасчетов;
								ПриобретениеУслугПрочихАктивов.ВалютаВзаиморасчетов = ВыборкаПоСводам.ВалютаВзаиморасчетов;
								ПриобретениеУслугПрочихАктивов.ЦенаВключаетНДС = ВыборкаПоСводам.ЦенаВключаетНДС;
								ПриобретениеУслугПрочихАктивов.ДатаПлатежа = НачалоДня(ПриобретениеУслугПрочихАктивов.Дата);
								Если Не ЗначениеЗаполнено(ВыборкаПоСводам.НалогообложениеНДС) Тогда 
									ПриобретениеУслугПрочихАктивов.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
								Иначе
									ПриобретениеУслугПрочихАктивов.НалогообложениеНДС = ВыборкаПоСводам.НалогообложениеНДС;
								КонецЕсли;
								ПриобретениеУслугПрочихАктивов.БанковскийСчетОрганизации = ВыборкаПоСводам.БанковскийСчет;
								ПриобретениеУслугПрочихАктивов.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
								ПриобретениеУслугПрочихАктивов.БанковскийСчетКонтрагента = ВыборкаПоСводам.БанковскийСчетКонтрагента;
								ПриобретениеУслугПрочихАктивов.ЗакупкаПодДеятельность = ПриобретениеУслугПрочихАктивов.НалогообложениеНДС;
								ПриобретениеУслугПрочихАктивов.ПорядокРасчетов = ВыборкаПоСводам.ПорядокРасчетов;
								ПриобретениеУслугПрочихАктивов.СтатьяДвиженияДенежныхСредств = ВыборкаПоСводам.СтатьяДвиженияДенежныхСредств;
								ПриобретениеУслугПрочихАктивов.КурсЧислитель = 1;
								ПриобретениеУслугПрочихАктивов.КурсЗнаменатель = 1; 
								//ПриобретениеУслугПрочихАктивов.Курс = 1;
								//ПриобретениеУслугПрочихАктивов.Кратность = 1;
								
								ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(ПриобретениеУслугПрочихАктивов);
								
								Выборка = ВыборкаПоСводам.Выбрать();
								
								Пока Выборка.Следующий() Цикл
									СтрокаУслуга = ПриобретениеУслугПрочихАктивов.Расходы.Добавить();
									СтрокаУслуга.Содержание = Логс_ДополнительныеПроцедурыИФункции.СформироватьНаименованиеУслугНаДоставкуПоСводуМаршрутов(Выборка.ДокументСводовМаршрутов);
									СтрокаУслуга.Количество = 1;
									СтрокаУслуга.Цена = Выборка.Сумма;
									СтрокаУслуга.Сумма = Выборка.Сумма;
									
									//#TODO Костыль для УСН Орион - НДС нужен.
									Если ПриобретениеУслугПрочихАктивов.Организация = ОрионОрганизация И ПриобретениеУслугПрочихАктивов.Дата < Дата("20260101") Тогда
										СтрокаУслуга.СтавкаНДС = СтавкаНДС5; 
										
									ИначеЕсли (ПриобретениеУслугПрочихАктивов.Организация = ЛогсисОрганизация ИЛИ ПриобретениеУслугПрочихАктивов.Организация = ОрионОрганизация)
										И ПриобретениеУслугПрочихАктивов.Дата >= Дата("20260101") Тогда 
										СтрокаУслуга.СтавкаНДС =
										?(ПриобретениеУслугПрочихАктивов.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
										СтавкаНДС22, СтавкаБезНДС
										);
                                   	Иначе
										
										СтрокаУслуга.СтавкаНДС =
										?(ПриобретениеУслугПрочихАктивов.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
										//Перечисления.СтавкиНДС.НДС20,
										//Перечисления.СтавкиНДС.БезНДС
										СтавкаНДС20, СтавкаБезНДС
										);
									КонецЕсли;

									//СтрокаУслуга.СтавкаНДС =
									//?(ПриобретениеУслугПрочихАктивов.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС,
									////Перечисления.СтавкиНДС.НДС20,
									////Перечисления.СтавкиНДС.БезНДС
									//СтавкаНДС20, СтавкаБезНДС
									//);
									
									СтрокаУслуга.СуммаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(СтрокаУслуга.Сумма,
									УчетНДСУПВызовСервера.ЗначениеСтавкиНДС(СтрокаУслуга.СтавкаНДС),
									ПриобретениеУслугПрочихАктивов.ЦенаВключаетНДС,
									ПриобретениеУслугПрочихАктивов.НалогообложениеНДС);
									СтрокаУслуга.СуммаСНДС = Выборка.Сумма;
									СтрокаУслуга.СтатьяРасходов = СтатьяРасходов;
									//СтрокаУслуга.АналитикаРасходов = АналитикаРасходов;
									СтрокаУслуга.Подразделение = ПриобретениеУслугПрочихАктивов.Подразделение;
									СтрокаУслуга.АналитикаРасходов = СтрокаУслуга.Подразделение;
									СтрокаУслуга.Логс_СводМаршрутов = Выборка.ДокументСводовМаршрутов;
								КонецЦикла; 
								
								СуммаВсего = ПриобретениеУслугПрочихАктивов.Расходы.Итог("СуммаСНДС");
								
								СтрокаПлатежа = ПриобретениеУслугПрочихАктивов.РасшифровкаПлатежа.Добавить();
								СтрокаПлатежа.Сумма = СуммаВсего;
								ПриобретениеУслугПрочихАктивов.Комментарий = "Создан автоматически на основе документа " +  ВыборкаПоСводам.ДокументСводовМаршрутов;
								
								Если ПриобретениеУслугПрочихАктивов.Ссылка.Пустая() Тогда
									ПриобретениеУслугПрочихАктивов.Записать(РежимЗаписиДокумента.Запись);
								КонецЕсли; 
								
								Попытка
									ПриобретениеУслугПрочихАктивов.Записать(РежимЗаписиДокумента.Проведение);
								Исключение
									ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
									ТекстСообщения = СтрШаблон(
									НСтр("ru='Произошла ошибка при записи приобретения услуг № %1 от %2: %3'"),
									ПриобретениеУслугПрочихАктивов.Номер, Формат(ПриобретениеУслугПрочихАктивов.Дата, "ДФ=dd.MM.yyyy"),
									ОписаниеОшибки);
									ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание приобретения услуг",
									УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
									СписокОшибок.Вставить(ПриобретениеУслугПрочихАктивов.Ссылка, ОписаниеОшибки);
								КонецПопытки;
								
								//Если ВыборкаВалюты.ФормаОплатыУслуг = Перечисления.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом Тогда
								//	ВзаимозачетСсылка = СоздатьДокументВзаимозачетЗадолженностиСКС(ПриобретениеУслугПрочихАктивов.Дата + 1,
								//		ВыборкаВалюты.Организация, ВыборкаВалюты.Партнер, ВыборкаВалюты.Контрагент, ВыборкаВалюты.Подразделение,
								//		ВыборкаВалюты.Договор, ВыборкаВалюты.ДоговорСПокупателем, ВыборкаВалюты.ВалютаВзаиморасчетов,
								//		ПриобретениеУслугПрочихАктивов.Ссылка, СуммаВсего,
								//		ВыборкаВалюты.ВзаимозачетЗадолженности, СписокОшибок);
								//Иначе
									ВзаимозачетСсылка = Неопределено;
								//КонецЕсли; 
								
								//ТаблицаСозданныхДокументов
								СтрокаСозданныхДокументов.ДокументыПриобретенияУслугСКС.Добавить(Новый Структура("Ссылка,Взаимозачет",
								ПриобретениеУслугПрочихАктивов.Ссылка, ВзаимозачетСсылка));
								
							КонецЦикла;
						КонецЦикла;
					КонецЦикла;
				КонецЦикла;		
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Запрос.Текст =
	"УНИЧТОЖИТЬ втСводыМаршрутов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втДокументПриобретениеУслуг";
	Запрос.Выполнить();
		
КонецПроцедуры

//-- Ким Виктор 17.01.2025  

//++ Ким Виктор 17.02.2025
//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15606
Функция СоздатьДокументыСКСПоТМС(Параметры, СписокОшибок = Неопределено) 
		
	Перем Партнер;
	
	Если СписокОшибок = Неопределено Тогда
		СписокОшибок = Новый Массив;
	КонецЕсли; 
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Параметры.Свойство("Партнер", Партнер);
	
	СписокОшибокДляОтчета = Новый Соответствие;
	
	СозданныеДокументы = Новый ТаблицаЗначений;
	СозданныеДокументы.Колонки.Добавить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	СозданныеДокументы.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	СозданныеДокументы.Колонки.Добавить("ДокументыПриемаНаКомиссию", Новый ОписаниеТипов("ТаблицаЗначений"));
	СозданныеДокументы.Колонки.Добавить("ДокументыОтчетовКомитентам", Новый ОписаниеТипов("Массив"));
	СозданныеДокументы.Колонки.Добавить("ДокументыАктовВыполненныхРабот", Новый ОписаниеТипов("Массив"));
	СозданныеДокументы.Колонки.Добавить("ДокументыПриобретенияУслугСКС", Новый ОписаниеТипов("Массив"));
	СозданныеДокументы.Индексы.Добавить("Партнер,Договор");
	
	СоздатьДокументыДвиженияДенежныхСредствПоСКСТМС(Параметры, МенеджерВременныхТаблиц, СозданныеДокументы, СписокОшибокДляОтчета);
	
	Для каждого КлючИЗначение Из СписокОшибокДляОтчета Цикл
		СписокОшибок.Добавить(Новый Структура("ТекстОшибки,КлючДанных",
		КлючИЗначение.Значение, КлючИЗначение.Ключ));
	КонецЦикла;
	
	Если Параметры.ПоказатьОтчетПоЗавершении Тогда
		ТабличныйДокумент = СформироватьОтчетОСозданныхДокументахДвиженияДС(Параметры, СозданныеДокументы, СписокОшибокДляОтчета);
	Иначе
		ТабличныйДокумент = Неопределено;
	КонецЕсли; 
	
	Возврат ТабличныйДокумент;
		
КонецФункции

//-- Ким Виктор 17.01.2025 

//++ Ким Виктор 25.04.2025 

Функция СоздатьДокументыВзаимозачетыСКСПоТМС(Параметры, СписокОшибок = Неопределено) 
		
	Перем Партнер;
	
	Если СписокОшибок = Неопределено Тогда
		СписокОшибок = Новый Массив;
	КонецЕсли; 
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Параметры.Свойство("Партнер", Партнер);
	
	СписокОшибокДляОтчета = Новый Соответствие;
	
	СозданныеДокументы = Новый ТаблицаЗначений;
	СозданныеДокументы.Колонки.Добавить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	СозданныеДокументы.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	СозданныеДокументы.Колонки.Добавить("ДокументыПриемаНаКомиссию", Новый ОписаниеТипов("ТаблицаЗначений"));
	СозданныеДокументы.Колонки.Добавить("ДокументыОтчетовКомитентам", Новый ОписаниеТипов("Массив"));
	СозданныеДокументы.Колонки.Добавить("ДокументыАктовВыполненныхРабот", Новый ОписаниеТипов("Массив"));
	СозданныеДокументы.Колонки.Добавить("ДокументыПриобретенияУслугСКС", Новый ОписаниеТипов("Массив"));
	СозданныеДокументы.Индексы.Добавить("Партнер,Договор");
	
	СоздатьДокументВзаимозачетЗадолженностиСКСТМС(Параметры, МенеджерВременныхТаблиц, СозданныеДокументы, СписокОшибокДляОтчета);
	
	Для каждого КлючИЗначение Из СписокОшибокДляОтчета Цикл
		СписокОшибок.Добавить(Новый Структура("ТекстОшибки,КлючДанных",
		КлючИЗначение.Значение, КлючИЗначение.Ключ));
	КонецЦикла;
	
	Если Параметры.ПоказатьОтчетПоЗавершении Тогда
		ТабличныйДокумент = СформироватьОтчетОСозданныхДокументахДвиженияДС(Параметры, СозданныеДокументы, СписокОшибокДляОтчета);
	Иначе
		ТабличныйДокумент = Неопределено;
	КонецЕсли; 
	
	Возврат ТабличныйДокумент;
		
КонецФункции   

Процедура СоздатьДокументВзаимозачетЗадолженностиСКСТМС(Параметры, МенеджерВременныхТаблиц, СозданныеДокументы, СписокОшибокДляОтчета)   
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Дата", НачалоДня(Параметры.ДатаФормирования));
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Параметры.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Параметры.КонецПериода));
	
	Партнер = Неопределено;
	Параметры.Свойство("Партнер", Партнер);
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ПартнерЗаполнен", ЗначениеЗаполнено(Партнер));
	 
	Запрос.Текст = ( "ВЫБРАТЬ
	                 |	Логс_СводМаршрутов.Ссылка КАК ДокументСводовМаршрутов,
	                 |	Логс_СводМаршрутов.ДоговорСКС.Организация КАК Организация,
	                 |	Логс_СводМаршрутов.КонтрагентСКС КАК КонтрагентСКС,
	                 |	Логс_СводМаршрутов.ПартнерСКС КАК ПартнерСКС,
	                 |	Логс_СводМаршрутов.ДоговорСКС КАК ДоговорСКС
	                 |ПОМЕСТИТЬ втСводыМаршрутов
	                 |ИЗ
	                 |	Документ.Логс_СводМаршрутов КАК Логс_СводМаршрутов
	                 |ГДЕ
	                 |	Логс_СводМаршрутов.Ссылка.Проведен
	                 |	И Логс_СводМаршрутов.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	                 |	И ВЫБОР
	                 |			КОГДА &ПартнерЗаполнен
	                 |				ТОГДА Логс_СводМаршрутов.ПартнерСКС = &Партнер
	                 |			ИНАЧЕ ИСТИНА
	                 |		КОНЕЦ
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	МАКСИМУМ(ПриобретениеУслугПрочихАктивовРасходы.Ссылка) КАК ДокументПриобретениеУслуг,
	                 |	ПриобретениеУслугПрочихАктивовРасходы.Ссылка.Договор КАК Договор,
	                 |	ПриобретениеУслугПрочихАктивовРасходы.Логс_СводМаршрутов КАК СводМаршрутов
	                 |ПОМЕСТИТЬ втДокументПриобретениеУслуг
	                 |ИЗ
	                 |	втСводыМаршрутов КАК втСводыМаршрутов
	                 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриобретениеУслугПрочихАктивов.Расходы КАК ПриобретениеУслугПрочихАктивовРасходы
	                 |		ПО втСводыМаршрутов.ДоговорСКС = ПриобретениеУслугПрочихАктивовРасходы.Ссылка.Договор
	                 |			И втСводыМаршрутов.ДокументСводовМаршрутов = ПриобретениеУслугПрочихАктивовРасходы.Логс_СводМаршрутов
	                 |ГДЕ
	                 |	НЕ ПриобретениеУслугПрочихАктивовРасходы.Ссылка.ПометкаУдаления
	                 |	И ПриобретениеУслугПрочихАктивовРасходы.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ЗакупкаУПоставщика)
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	ПриобретениеУслугПрочихАктивовРасходы.Ссылка.Договор,
	                 |	ПриобретениеУслугПрочихАктивовРасходы.Логс_СводМаршрутов
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	втДокументПриобретениеУслуг.ДокументПриобретениеУслуг КАК ДокументПриобретениеУслуг,
	                 |	втДокументПриобретениеУслуг.СводМаршрутов КАК СводМаршрутов,
	                 |	МАКСИМУМ(ЕСТЬNULL(ВзаимозачетЗадолженности.Ссылка, НЕОПРЕДЕЛЕНО)) КАК Взаимозачет,
	                 |	втДокументПриобретениеУслуг.СводМаршрутов.КонтрагентСКС КАК КонтрагентСКС,
	                 |	втДокументПриобретениеУслуг.СводМаршрутов.ПартнерСКС КАК ПартнерСКС,
	                 |	втДокументПриобретениеУслуг.СводМаршрутов.Организация КАК Организация,
	                 |	втДокументПриобретениеУслуг.СводМаршрутов.ДоговорСКС КАК ДоговорСКС,
	                 |	втДокументПриобретениеУслуг.СводМаршрутов.ДоговорСКС.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	                 |	втДокументПриобретениеУслуг.ДокументПриобретениеУслуг.СуммаДокумента КАК СуммаДокумента,
	                 |	втДокументПриобретениеУслуг.ДокументПриобретениеУслуг.Подразделение КАК Подразделение
	                 |ИЗ
	                 |	втДокументПриобретениеУслуг КАК втДокументПриобретениеУслуг
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВзаимозачетЗадолженности КАК ВзаимозачетЗадолженности
	                 |		ПО втДокументПриобретениеУслуг.ДокументПриобретениеУслуг = ВзаимозачетЗадолженности.ДокументОснование
	                 |			И (НЕ ВзаимозачетЗадолженности.ПометкаУдаления)
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	втДокументПриобретениеУслуг.ДокументПриобретениеУслуг,
	                 |	втДокументПриобретениеУслуг.СводМаршрутов,
	                 |	втДокументПриобретениеУслуг.СводМаршрутов.КонтрагентСКС,
	                 |	втДокументПриобретениеУслуг.СводМаршрутов.ПартнерСКС,
	                 |	втДокументПриобретениеУслуг.СводМаршрутов.Организация,
	                 |	втДокументПриобретениеУслуг.СводМаршрутов.ДоговорСКС,
	                 |	втДокументПриобретениеУслуг.СводМаршрутов.ДоговорСКС.ВалютаВзаиморасчетов,
	                 |	втДокументПриобретениеУслуг.ДокументПриобретениеУслуг.СуммаДокумента") ; 
					 
	Результат = Запрос.Выполнить();
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ПриобретениеУслугПрочихАктивов = Выборка.ДокументПриобретениеУслуг;
		Организация = Выборка.Организация;
		Партнер = Выборка.ПартнерСКС;
		Контрагент = Выборка.КонтрагентСКС;
		Подразделение = Выборка.Подразделение;
		Договор = Выборка.ДоговорСКС; 
		ВалютаВзаиморасчетов = Выборка.ВалютаВзаиморасчетов;
		СуммаВсего = Выборка.СуммаДокумента;
		ВзаимозачетЗадолженности = Выборка.Взаимозачет;  
		
		СтрокиСозданныхДокументов = СозданныеДокументы.НайтиСтроки(
		Новый Структура("Партнер,Договор",
		Партнер,
		Договор));
		Если СтрокиСозданныхДокументов.Количество() = 0 Тогда
			СтрокаСозданныхДокументов = СозданныеДокументы.Добавить();
			СтрокаСозданныхДокументов.Партнер = Партнер;
			СтрокаСозданныхДокументов.Договор = Договор;
		Иначе
			СтрокаСозданныхДокументов = СтрокиСозданныхДокументов[0];
		КонецЕсли;    
		
		ДоговорСПокупателем = ПолучитьДоговорСПокупателем(Контрагент, Договор);
		
		ОбъектРасчетовСПокупателем = ПолучитьОбъектовРасчетов(ДоговорСПокупателем, Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом); 
		ОбъектРасчетовСПоставщиком = ПолучитьОбъектовРасчетов(Договор, Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком); 
					 		
		ВзаимозачетСсылка = СоздатьИзменитьДокументВзаимозачетЗадолженностиСКСТМС(Параметры.ДатаФормирования,
		Организация, Партнер, Контрагент, Подразделение,
		ОбъектРасчетовСПоставщиком, ОбъектРасчетовСПокупателем, ВалютаВзаиморасчетов,
		ПриобретениеУслугПрочихАктивов, СуммаВсего,
		ВзаимозачетЗадолженности, СписокОшибокДляОтчета);
		
		СтрокаСозданныхДокументов.ДокументыПриобретенияУслугСКС.Добавить(Новый Структура("Ссылка,Взаимозачет",
		ПриобретениеУслугПрочихАктивов, ВзаимозачетСсылка));	
		
	КонецЦикла;
	
	Запрос.Текст =
	"УНИЧТОЖИТЬ втСводыМаршрутов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ втДокументПриобретениеУслуг";
	Запрос.Выполнить();

	
КонецПроцедуры     

Функция ПолучитьДоговорСПокупателем(Контрагент, Договор) 
	
	ДоговорСПокупателем = Неопределено;
	
	НомерДоговораБезДефиса = СтрЗаменить(Договор.Номер, "-", "");
	
	Запрос = Новый Запрос;
	Запрос.Текст =  ( "ВЫБРАТЬ
	                  |	ДоговорыКонтрагентов.Ссылка КАК ДоговорСПокупателем
	                  |ИЗ
	                  |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                  |ГДЕ
	                  |	ДоговорыКонтрагентов.Контрагент = &Контрагент
	                  |	И ДоговорыКонтрагентов.Номер = &Номер
	                  |	И ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	                  |	И НЕ ДоговорыКонтрагентов.ПометкаУдаления");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);  
	Запрос.УстановитьПараметр("Номер", НомерДоговораБезДефиса);
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда 
		
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		
		ДоговорСПокупателем = Выборка.ДоговорСПокупателем;
				
	КонецЕсли;
	
	Возврат ДоговорСПокупателем;

КонецФункции

Функция ПолучитьОбъектовРасчетов(Договор, ТипРасчетов) 
	
	Возврат ОбъектыРасчетовСервер.ПолучитьОбъектРасчетовПоСсылке(Договор, Договор.Организация, ТипРасчетов);
	
КонецФункции


Функция СоздатьИзменитьДокументВзаимозачетЗадолженностиСКСТМС(Дата, Организация, Партнер, Контрагент, Подразделение, Договор, ДоговорСПокупателем,
	ВалютаВзаиморасчетов, ДокументОснование, СуммаВзаимозачета, ДокументСсылка, СписокОшибок)
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		ВзаимозачетЗадолженности = ДокументСсылка.ПолучитьОбъект();
		
		ВзаимозачетЗадолженности.ДебиторскаяЗадолженность.Очистить();
		ВзаимозачетЗадолженности.КредиторскаяЗадолженность.Очистить();
	Иначе
		ВзаимозачетЗадолженности = Документы.ВзаимозачетЗадолженности.СоздатьДокумент();
		ВзаимозачетЗадолженности.Дата = Дата;
		ВзаимозачетЗадолженности.Организация = Организация;
		ВзаимозачетЗадолженности.КонтрагентДебитор = Контрагент;
		ВзаимозачетЗадолженности.КонтрагентКредитор = Контрагент;
		ВзаимозачетЗадолженности.ТипДебитора = Перечисления.ТипыУчастниковВзаимозачета.Клиент;
		ВзаимозачетЗадолженности.ТипКредитора = Перечисления.ТипыУчастниковВзаимозачета.Поставщик;
		ВзаимозачетЗадолженности.ДокументОснование = ДокументОснование;
		ВзаимозачетЗадолженности.Ответственный = Пользователи.ТекущийПользователь();
		
		ВзаимозачетЗадолженности.УстановитьНовыйНомер();
	КонецЕсли; 
	
	ВзаимозачетЗадолженности.Подразделение = Подразделение;
	ВзаимозачетЗадолженности.ВидОперации = Перечисления.ВидыОперацийВзаимозачетаЗадолженности.Бартер;
	ВзаимозачетЗадолженности.СуммаРегл = СуммаВзаимозачета;
	ВзаимозачетЗадолженности.СуммаУпр = СуммаВзаимозачета;
	ВзаимозачетЗадолженности.Логс_ФормироватьДвиженияПоУпрУчету = Истина;

	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(ВзаимозачетЗадолженности);
	
	СтрокаЗадолженность = ВзаимозачетЗадолженности.ДебиторскаяЗадолженность.Добавить();
	СтрокаЗадолженность.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	СтрокаЗадолженность.Партнер = Партнер;
	//СтрокаЗадолженность.Заказ = ДоговорСПокупателем;
	СтрокаЗадолженность.ОбъектРасчетов = ДоговорСПокупателем;
	СтрокаЗадолженность.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
	СтрокаЗадолженность.Организация = Организация;
	СтрокаЗадолженность.СуммаВзаиморасчетов = СуммаВзаимозачета;
	СтрокаЗадолженность.СуммаРегл = СуммаВзаимозачета;
	СтрокаЗадолженность.СуммаУпр = СуммаВзаимозачета;
	
	СтрокаЗадолженность = ВзаимозачетЗадолженности.КредиторскаяЗадолженность.Добавить();
	СтрокаЗадолженность.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСПоставщиком;
	СтрокаЗадолженность.Партнер = Партнер;
	//СтрокаЗадолженность.Заказ = Договор;
	СтрокаЗадолженность.ОбъектРасчетов = Договор;
	СтрокаЗадолженность.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
	СтрокаЗадолженность.Организация = Организация;
	СтрокаЗадолженность.СуммаВзаиморасчетов = СуммаВзаимозачета;
	СтрокаЗадолженность.СуммаРегл = СуммаВзаимозачета;
	СтрокаЗадолженность.СуммаУпр = СуммаВзаимозачета;
	
	Если ВзаимозачетЗадолженности.Ссылка.Пустая() Тогда
		ВзаимозачетЗадолженности.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли; 
	
	Попытка
		ВзаимозачетЗадолженности.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = СтрШаблон(
			НСтр("ru='Произошла ошибка при записи взаимозачета задолженности № %1 от %2: %3'"),
			ВзаимозачетЗадолженности.Номер, Формат(ВзаимозачетЗадолженности.Дата, "ДФ=dd.MM.yyyy"),
			ОписаниеОшибки);
		ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание взаимозачета задолженности СКС ТМС",
			УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		СписокОшибок.Вставить(ВзаимозачетЗадолженности.Ссылка, ОписаниеОшибки);
	КонецПопытки; 

	Возврат ВзаимозачетЗадолженности.Ссылка;
	
КонецФункции 
 
//-- Ким Виктор 25.04.2025


Функция СоздатьДокументВзаимозачетЗадолженностиСКС(Дата, Организация, Партнер, Контрагент, Подразделение, Договор, ДоговорСПокупателем,
	ВалютаВзаиморасчетов, ДокументОснование, СуммаВзаимозачета, ДокументСсылка, СписокОшибок)
	
	Если ЗначениеЗаполнено(ДокументСсылка) Тогда
		ВзаимозачетЗадолженности = ДокументСсылка.ПолучитьОбъект();
		
		ВзаимозачетЗадолженности.ДебиторскаяЗадолженность.Очистить();
		ВзаимозачетЗадолженности.КредиторскаяЗадолженность.Очистить();
	Иначе
		ВзаимозачетЗадолженности = Документы.ВзаимозачетЗадолженности.СоздатьДокумент();
		ВзаимозачетЗадолженности.Дата = Дата;
		ВзаимозачетЗадолженности.Организация = Организация;
		ВзаимозачетЗадолженности.КонтрагентДебитор = Контрагент;
		ВзаимозачетЗадолженности.КонтрагентКредитор = Контрагент;
		ВзаимозачетЗадолженности.ТипДебитора = Перечисления.ТипыУчастниковВзаимозачета.Клиент;
		ВзаимозачетЗадолженности.ТипКредитора = Перечисления.ТипыУчастниковВзаимозачета.Поставщик;
		ВзаимозачетЗадолженности.ДокументОснование = ДокументОснование;
		ВзаимозачетЗадолженности.Ответственный = Пользователи.ТекущийПользователь();
		
		ВзаимозачетЗадолженности.УстановитьНовыйНомер();
	КонецЕсли; 
	
	ВзаимозачетЗадолженности.Подразделение = Подразделение;
	ВзаимозачетЗадолженности.ВидОперации = Перечисления.ВидыОперацийВзаимозачетаЗадолженности.Бартер;
	ВзаимозачетЗадолженности.СуммаРегл = СуммаВзаимозачета;
	ВзаимозачетЗадолженности.СуммаУпр = СуммаВзаимозачета;

	ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(ВзаимозачетЗадолженности);
	
	СтрокаЗадолженность = ВзаимозачетЗадолженности.ДебиторскаяЗадолженность.Добавить();
	СтрокаЗадолженность.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	СтрокаЗадолженность.Партнер = Партнер;
	СтрокаЗадолженность.Заказ = ДоговорСПокупателем;
	СтрокаЗадолженность.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
	СтрокаЗадолженность.Организация = Организация;
	СтрокаЗадолженность.СуммаВзаиморасчетов = СуммаВзаимозачета;
	СтрокаЗадолженность.СуммаРегл = СуммаВзаимозачета;
	СтрокаЗадолженность.СуммаУпр = СуммаВзаимозачета;
	
	СтрокаЗадолженность = ВзаимозачетЗадолженности.КредиторскаяЗадолженность.Добавить();
	СтрокаЗадолженность.ТипРасчетов = Перечисления.ТипыРасчетовСПартнерами.РасчетыСКлиентом;
	СтрокаЗадолженность.Партнер = Партнер;
	СтрокаЗадолженность.Заказ = Договор;
	СтрокаЗадолженность.ВалютаВзаиморасчетов = ВалютаВзаиморасчетов;
	СтрокаЗадолженность.Организация = Организация;
	СтрокаЗадолженность.СуммаВзаиморасчетов = СуммаВзаимозачета;
	СтрокаЗадолженность.СуммаРегл = СуммаВзаимозачета;
	СтрокаЗадолженность.СуммаУпр = СуммаВзаимозачета;
	
	Если ВзаимозачетЗадолженности.Ссылка.Пустая() Тогда
		ВзаимозачетЗадолженности.Записать(РежимЗаписиДокумента.Запись);
	КонецЕсли; 
	
	Попытка
		ВзаимозачетЗадолженности.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		ТекстСообщения = СтрШаблон(
			НСтр("ru='Произошла ошибка при записи взаимозачета задолженности № %1 от %2: %3'"),
			ВзаимозачетЗадолженности.Номер, Формат(ВзаимозачетЗадолженности.Дата, "ДФ=dd.MM.yyyy"),
			ОписаниеОшибки);
		ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание взаимозачета задолженности",
			УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
		СписокОшибок.Вставить(ВзаимозачетЗадолженности.Ссылка, ОписаниеОшибки);
	КонецПопытки; 

	Возврат ВзаимозачетЗадолженности.Ссылка;
	
КонецФункции 

Функция УстановитьИнформациюОбОшибкеВОтчетеОСозданныхДокументахДвиженияДС(Область, ДокументСсылка, СписокОшибок, НомерКолонки)
	
	ОписаниеОшибки = СписокОшибок[ДокументСсылка];
	
	Если ОписаниеОшибки = Неопределено Тогда
		Область.Область(1, НомерКолонки, 1, НомерКолонки).Картинка = Неопределено;
		Область.Область(1, НомерКолонки, 1, НомерКолонки).Гиперссылка = Ложь;
	Иначе
		Область.Параметры.ОписаниеОшибки = ОписаниеОшибки;
	КонецЕсли; 
	
КонецФункции 

Функция ОрганизацияИспользуетНДС(Организация, КешированныеЗначения)
	ИспользуетсяНДС = КешированныеЗначения[Организация];
	
	Если ИспользуетсяНДС <> Неопределено Тогда
		Возврат ИспользуетсяНДС;
	КонецЕсли; 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НастройкиУчетаУСН.ПрименяетсяУСНДоходыМинусРасходы КАК ПрименяетсяУСН
	|ИЗ
	|	РегистрСведений.НастройкиУчетаУСН.СрезПоследних(, Организация = &Организация) КАК НастройкиУчетаУСН");
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ИспользуетсяНДС = ?(Выборка.Следующий(),
		Не Выборка.ПрименяетсяУСН,
		Истина);
		
	КешированныеЗначения.Вставить(Организация, ИспользуетсяНДС);
	
	Возврат ИспользуетсяНДС;
КонецФункции

Процедура СоздатьДокументыСчетФактурыВыданный(Параметры, ТаблицаСозданныхДокументов, СписокОшибок)
	
	ДокументыДляСчетФактур = ПолучитьДокументыДляСчетФактурИзТаблицыСозданныхДокументов(ТаблицаСозданныхДокументов);
	
	КешированныеЗначения = Новый Соответствие;
	
	ОрионОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9728051543");
	
	Для каждого Документ Из ДокументыДляСчетФактур Цикл
		
		//#TODO Костыль для УСН Орион - НДС нужен.
		Если Документ.Организация = ОрионОрганизация Тогда
			
		ИначеЕсли Не ОрганизацияИспользуетНДС(Документ.Организация, КешированныеЗначения) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(Документ.СчетФактура) Тогда
			
			Если Параметры.ТолькоСоздаватьНовые Тогда
				Продолжить;
			КонецЕсли; 			
			
			СчетФактура = Документ.СчетФактура.ПолучитьОбъект();
			СчетФактура.ДокументыОснования.Очистить();
			
		Иначе
			
			СчетФактура = Документы.СчетФактураВыданный.СоздатьДокумент();
			СчетФактура.Дата = Документ.Дата;
			СчетФактура.Номер = Документ.Номер;
			
		КонецЕсли; 
		
		ДанныеЗаполнения = Новый Структура;
		ДанныеЗаполнения.Вставить("ДокументОснование", Документ.Ссылка);
		ДанныеЗаполнения.Вставить("Исправление", Ложь);
		ДанныеЗаполнения.Вставить("Контрагент", Документ.Контрагент);
		ДанныеЗаполнения.Вставить("Корректировочный", Ложь);
		ДанныеЗаполнения.Вставить("Организация", Документ.Организация);
		
		СчетФактура.Заполнить(ДанныеЗаполнения);
		
		Если СчетФактура.Ссылка.Пустая() Тогда
			СчетФактура.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли; 
		
		Попытка
			СчетФактура.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ОписаниеОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			ТекстСообщения = СтрШаблон(
				НСтр("ru='Произошла ошибка при записи счет-фактуры № %1 от %2: %3'"),
				СчетФактура.Номер, Формат(СчетФактура.Дата, "ДФ=dd.MM.yyyy"),
				ОписаниеОшибки);
			ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание счет-фактуры",
				УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			СписокОшибок.Вставить(СчетФактура.Ссылка, ОписаниеОшибки);
		КонецПопытки;
		
		Документ.СчетФактура = СчетФактура.Ссылка;
		
	КонецЦикла;
	
КонецПроцедуры 

Функция СформироватьОтчетОСозданныхДокументахДвиженияДС(Параметры, СозданныеДокументы, СписокОшибок)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	Макет = ПолучитьМакет("ОтчетОСозданныхДокументахДвиженияДС");
	
	Область = Макет.ПолучитьОбласть("Заголовок");
	Область.Параметры.ДатаФормирования = Формат(Параметры.ДатаФормирования, "ДФ=dd.MM.yyyy");
	Область.Параметры.ПредставлениеПериодаСводов = ПредставлениеПериода(
		НачалоДня(Параметры.НачалоПериода), КонецДня(Параметры.КонецПериода), "ФП=Истина");  
	ТабличныйДокумент.Вывести(Область);
	
	ОбластьПартнер     = Макет.ПолучитьОбласть("Партнер");
	ОбластьСводыЗаявок = Макет.ПолучитьОбласть("СводыЗаявок");
	ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель");
	
	Для каждого СтрокаТаблицы Из СозданныеДокументы Цикл
		
		ОбластьПартнер.Параметры.Партнер = СтрокаТаблицы.Партнер;
		ОбластьПартнер.Параметры.ПредставлениеПартнера = СтрШаблон(НСтр("ru='%1; %2'"),
			СтрокаТаблицы.Партнер, СтрокаТаблицы.Договор);
		ТабличныйДокумент.Вывести(ОбластьПартнер, 1);
		
		//ОбластьСводыЗаявок.Параметры.КоличествоСводов = СписокСводов.Количество();
		//ОбластьСводыЗаявок.Параметры.СписокСводов = СписокСводов;
		//ТабличныйДокумент.Вывести(ОбластьСводыЗаявок, 1);
		
		ТабличныйДокумент.Вывести(ОбластьРазделитель, 1);
		
		Для каждого СтрокаПоступления Из СтрокаТаблицы.ДокументыПриемаНаКомиссию Цикл
			
			Область = Макет.ПолучитьОбласть("ПриобретениеТоваровУслуг");
			Область.Параметры.ПриобретениеТоваровУслуг = СтрокаПоступления.Ссылка;
			УстановитьИнформациюОбОшибкеВОтчетеОСозданныхДокументахДвиженияДС(Область, СтрокаПоступления.Ссылка, СписокОшибок, 1);
			ТабличныйДокумент.Вывести(Область, 2);
			
			Для каждого ДокументРеализации Из СтрокаПоступления.ДокументыРеализации Цикл
				Область = Макет.ПолучитьОбласть("РеализацияТоваровУслуг");
				Область.Параметры.РеализацияТоваровУслуг = ДокументРеализации;
				УстановитьИнформациюОбОшибкеВОтчетеОСозданныхДокументахДвиженияДС(Область, ДокументРеализации, СписокОшибок, 2);
				ТабличныйДокумент.Вывести(Область, 2);
			КонецЦикла;
			
		КонецЦикла;
		
		Для каждого ОтчетКомитенту Из СтрокаТаблицы.ДокументыОтчетовКомитентам Цикл
			Область = Макет.ПолучитьОбласть("ОтчетКомитенту");
			Область.Параметры.ОтчетКомитенту = ОтчетКомитенту.Ссылка;
			УстановитьИнформациюОбОшибкеВОтчетеОСозданныхДокументахДвиженияДС(Область, ОтчетКомитенту.Ссылка, СписокОшибок, 2);
			ТабличныйДокумент.Вывести(Область, 2);
			
			Если ЗначениеЗаполнено(ОтчетКомитенту.СчетФактура) Тогда
				Область = Макет.ПолучитьОбласть("СчетФактураВыданный");
				Область.Параметры.СчетФактураВыданный = ОтчетКомитенту.СчетФактура;
				УстановитьИнформациюОбОшибкеВОтчетеОСозданныхДокументахДвиженияДС(Область, ОтчетКомитенту.СчетФактура, СписокОшибок, 3);
				ТабличныйДокумент.Вывести(Область, 3);
			КонецЕсли; 
		КонецЦикла;
		
		Для каждого АктВыполненныхРабот Из СтрокаТаблицы.ДокументыАктовВыполненныхРабот Цикл
			Область = Макет.ПолучитьОбласть("АктВыполненныхРабот");
			Область.Параметры.АктВыполненныхРабот = АктВыполненныхРабот.Ссылка;
			УстановитьИнформациюОбОшибкеВОтчетеОСозданныхДокументахДвиженияДС(Область, АктВыполненныхРабот.Ссылка, СписокОшибок, 1);
			ТабличныйДокумент.Вывести(Область, 2);
			
			Если ЗначениеЗаполнено(АктВыполненныхРабот.СчетФактура) Тогда
				Область = Макет.ПолучитьОбласть("СчетФактураВыданный");
				Область.Параметры.СчетФактураВыданный = АктВыполненныхРабот.СчетФактура;
				УстановитьИнформациюОбОшибкеВОтчетеОСозданныхДокументахДвиженияДС(Область, АктВыполненныхРабот.СчетФактура, СписокОшибок, 3);
				ТабличныйДокумент.Вывести(Область, 3);
			КонецЕсли; 
		КонецЦикла;
		
		Для каждого ДокументыПриобретенияУслугСКС Из СтрокаТаблицы.ДокументыПриобретенияУслугСКС Цикл
			Область= Макет.ПолучитьОбласть("ПриобретениеУслугСКС");
			Область.Параметры.ПриобретениеУслуг = ДокументыПриобретенияУслугСКС.Ссылка;
			УстановитьИнформациюОбОшибкеВОтчетеОСозданныхДокументахДвиженияДС(Область, ДокументыПриобретенияУслугСКС.Ссылка, СписокОшибок, 1);
			ТабличныйДокумент.Вывести(Область, 2);
			
			Если ЗначениеЗаполнено(ДокументыПриобретенияУслугСКС.Взаимозачет) Тогда
				Область = Макет.ПолучитьОбласть("ВзаимозачетЗадолженностиСКС");
				Область.Параметры.ВзаимозачетЗадолженности = ДокументыПриобретенияУслугСКС.Взаимозачет;
				УстановитьИнформациюОбОшибкеВОтчетеОСозданныхДокументахДвиженияДС(Область, ДокументыПриобретенияУслугСКС.Взаимозачет, СписокОшибок, 2);
				ТабличныйДокумент.Вывести(Область, 2);
			КонецЕсли; 
		КонецЦикла;
			
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции 

#КонецОбласти 

#Область ДокументыПоступленияДенежныхСредств
Функция ПолучитьДанныеПоПоступлениюДенежныхСредств_Архивная(Параметры)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Параметры.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Параметры.КонецПериода));
	Запрос.УстановитьПараметр("ОрганизацияЛогсис", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ОрганизацияЛогсис());
	Запрос.УстановитьПараметр("ОрганизацияЛССервис", Справочники.Организации.НайтиПоРеквизиту("ИНН", "7734424084"));
	Запрос.УстановитьПараметр("ОрганизацияНЛ", Справочники.Организации.НайтиПоРеквизиту("ИНН", "9725030344"));
	Запрос.УстановитьПараметр("КонтрагентУпр", Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "9721047523"));
	Запрос.УстановитьПараметр("СвойствоФормироватьПКОПоНаложеннымПлатежа",
		Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоОрганизацияФормироватьПКОПоНаложеннымПлатежам());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ЗаявкаНаДоставку.Дата, ДЕНЬ) КАК Период,
	|	ЗаявкаНаДоставку.Договор КАК Договор,
	|	ЗаявкаНаДоставку.Организация КАК Организация,
	|	ЗаявкаНаДоставку.Хаб КАК Хаб,
	|	ЗаявкаНаДоставку.Курьер КАК Курьер,
	|	ЗаявкаНаДоставку.ОплатаНаличные КАК ОплатаНаличные,
	|	ЗаявкаНаДоставку.ОплатаСБП КАК ОплатаСБП,
	|	СУММА(ЗаявкаНаДоставку.НаложенныйПлатеж) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Заявки
	|ИЗ
	|	Документ.Логс_ЗаявкаНаДоставку КАК ЗаявкаНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.ДополнительныеРеквизиты КАК ДопРеквизитыОрганизации
	|		ПО ЗаявкаНаДоставку.Организация = ДопРеквизитыОрганизации.Ссылка
	|			И (ДопРеквизитыОрганизации.Свойство = &СвойствоФормироватьПКОПоНаложеннымПлатежа)
	|ГДЕ
	|	ЗаявкаНаДоставку.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ(ЗаявкаНаДоставку.ОплатаНаличные
	|				И ЕСТЬNULL(ДопРеквизитыОрганизации.Свойство, ЛОЖЬ) = ЛОЖЬ)
	|	И ЗаявкаНаДоставку.Проведен
	|	И НЕ ЗаявкаНаДоставку.ТДРегион
	|	И НЕ ЗаявкаНаДоставку.Хаб.ЯвляетсяСКС
	|	И НЕ ЗаявкаНаДоставку.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	И ЗаявкаНаДоставку.НаложенныйПлатеж > 0
	|	И &ТекстОтбораПоПартнеру
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаДоставку.Организация,
	|	ЗаявкаНаДоставку.Хаб,
	|	ЗаявкаНаДоставку.Курьер,
	|	ЗаявкаНаДоставку.Договор,
	|	ЗаявкаНаДоставку.ОплатаНаличные,
	|	ЗаявкаНаДоставку.ОплатаСБП,
	|	НАЧАЛОПЕРИОДА(ЗаявкаНаДоставку.Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заявки.Период КАК Период,
	|	Заявки.Договор КАК Договор,
	|	Заявки.ОплатаНаличные КАК ОплатаНаличные,
	|	Заявки.ОплатаСБП КАК ОплатаСБП,
	//|	ЕСТЬNULL(Настройки.ОтражатьРеализациюНаРозничногоПокупателя, ЛОЖЬ) КАК ОтражатьРеализациюНаРозничногоПокупателя,
	//|	ЕСТЬNULL(Настройки.ОтражатьРеализациюЧерезБокс, ЛОЖЬ) КАК ОтражатьРеализациюЧерезБокс,
	|	ЕСТЬNULL(Настройки.МетодПриходования, Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.ПустаяСсылка)) КАК МетодПриходования,
	|	ЕСТЬNULL(Настройки.МетодПриходованияСЗ, Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.ПустаяСсылка)) КАК МетодПриходованияСЗ
	|ПОМЕСТИТЬ ВТ_ИндивидуальныеНастройкиДоговоров
	|ИЗ
	|	(ВЫБРАТЬ
	|		Заявки.Период КАК Период,
	|		Заявки.ОплатаНаличные КАК ОплатаНаличные,
	|		Заявки.ОплатаСБП КАК ОплатаСБП,
	|		Заявки.Договор КАК Договор,
	|		МАКСИМУМ(Настройки.Период) КАК МаксПериод
	|	ИЗ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Заявки.Период КАК Период,
	|			Заявки.ОплатаНаличные КАК ОплатаНаличные,
	|			Заявки.ОплатаСБП КАК ОплатаСБП,
	|			Заявки.Договор КАК Договор
	|		ИЗ
	|			ВТ_Заявки КАК Заявки) КАК Заявки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИндивидуальныеНастройкиДоговоров КАК Настройки
	|			ПО Заявки.Договор = Настройки.Договор
	|				И Заявки.ОплатаНаличные = Настройки.ОплатаНаличные
	|				И Заявки.Период >= Настройки.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Заявки.Период,
	|		Заявки.ОплатаНаличные,
	|		Заявки.ОплатаСБП,
	|		Заявки.Договор) КАК Заявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИндивидуальныеНастройкиДоговоров КАК Настройки
	|		ПО Заявки.Договор = Настройки.Договор
	|			И Заявки.ОплатаНаличные = Настройки.ОплатаНаличные
	|			И Заявки.МаксПериод = Настройки.Период
	|;
	|ВЫБРАТЬ
	|	Заявки.Период КАК Период,
	|	Заявки.Организация КАК Организация,
	|	Заявки.ОплатаНаличные КАК ОплатаНаличные,
	|	Заявки.ОплатаСБП КАК ОплатаСБП,
	|	ЕСТЬNULL(Настройки.МетодПриходования, Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Прямой)) КАК МетодПриходования,
	|	ЕСТЬNULL(Настройки.МетодПриходованияСЗ, Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Прямой)) КАК МетодПриходованияСЗ
	|ПОМЕСТИТЬ ВТ_МетодПриходованияНП
	|ИЗ
	|	(ВЫБРАТЬ
	|		Заявки.Период КАК Период,
	|		Заявки.ОплатаНаличные КАК ОплатаНаличные,
	|		Заявки.ОплатаСБП КАК ОплатаСБП,
	|		Заявки.Организация КАК Организация,
	|		МАКСИМУМ(Настройки.Период) КАК МаксПериод
	|	ИЗ
	|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	|			Заявки.Период КАК Период,
	|			Заявки.ОплатаНаличные КАК ОплатаНаличные,
	|			Заявки.ОплатаСБП КАК ОплатаСБП,
	|			Заявки.Организация КАК Организация
	|		ИЗ
	|			ВТ_Заявки КАК Заявки) КАК Заявки
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Логс_МетодПриходованияНаложенногоПлатежа КАК Настройки
	|			ПО Заявки.Организация = Настройки.Организация
	|				И Заявки.ОплатаНаличные = Настройки.ОплатаНаличные
	|				И Заявки.Период >= Настройки.Период
	|	
	|	СГРУППИРОВАТЬ ПО
	|		Заявки.Период,
	|		Заявки.ОплатаНаличные,
	|		Заявки.ОплатаСБП,
	|		Заявки.Организация) КАК Заявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Логс_МетодПриходованияНаложенногоПлатежа КАК Настройки
	|		ПО Заявки.Организация = Настройки.Организация
	|			И Заявки.ОплатаНаличные = Настройки.ОплатаНаличные
	|			И Заявки.МаксПериод = Настройки.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаНаДоставку.Период КАК Период,
	|	ЗаявкаНаДоставку.Организация КАК Организация,
	|	ЗаявкаНаДоставку.Хаб КАК Хаб,
	|	ЗаявкаНаДоставку.ОплатаНаличные КАК ОплатаНаличные,
	|	ЗаявкаНаДоставку.ОплатаСБП КАК ОплатаСБП,
	|	Выбор Когда не ВТ_МетодПриходованияНП.ОплатаНаличные есть NULL Тогда   
		|	Выбор Когда (НЕ Курьеры.Ссылка есть NULL и Курьеры.Логс_Самозанятый) 
		|					ИЛИ (НЕ КурьерыСЗ.Ссылка есть NULL и КурьерыСЗ.Логс_ВидКлиентаCRM = Значение(Перечисление.Логс_ВидыКлиентовCRM.СамозанятыйКурьер)) Тогда
		|		Выбор Когда ВТ_ИндивидуальныеНастройкиДоговоров.МетодПриходованияСЗ =Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс) Тогда
		|			Ложь
		|		Когда ВТ_ИндивидуальныеНастройкиДоговоров.МетодПриходованияСЗ =Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Прямой) Тогда
		|			Истина
		|		Иначе
		|			Выбор Когда ВТ_МетодПриходованияНП.МетодПриходованияСЗ =Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс) Тогда
		|				Ложь
		|			Иначе  
		|				Истина
		|			Конец
		|		Конец
		|	Иначе 
		|		Выбор Когда ВТ_ИндивидуальныеНастройкиДоговоров.МетодПриходования =Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс) Тогда
		|			Ложь
		|		Когда ВТ_ИндивидуальныеНастройкиДоговоров.МетодПриходования =Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Прямой) Тогда
		|			Истина
		|		Иначе
		|			Выбор Когда ВТ_МетодПриходованияНП.МетодПриходования =Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс) Тогда
		|				Ложь
		|			Иначе  
		|				Истина
		|			Конец
		|		Конец
		|	Конец	
	|	Иначе Ложь Конец КАК РеализацияНаРозничного,
	|	ВТ_МетодПриходованияНП.МетодПриходования КАК МетодПриходования,
	|	СУММА(ЗаявкаНаДоставку.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ЗаявкиНаДоставкуОбщие
	|ИЗ
	|	ВТ_Заявки КАК ЗаявкаНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИндивидуальныеНастройкиДоговоров КАК ВТ_ИндивидуальныеНастройкиДоговоров
	|		ПО ЗаявкаНаДоставку.Договор = ВТ_ИндивидуальныеНастройкиДоговоров.Договор
	|			И ЗаявкаНаДоставку.ОплатаНаличные = ВТ_ИндивидуальныеНастройкиДоговоров.ОплатаНаличные
	|			И ЗаявкаНаДоставку.ОплатаСБП = ВТ_ИндивидуальныеНастройкиДоговоров.ОплатаСБП
	|			И ЗаявкаНаДоставку.Период = ВТ_ИндивидуальныеНастройкиДоговоров.Период
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МетодПриходованияНП КАК ВТ_МетодПриходованияНП
	|		ПО ЗаявкаНаДоставку.Организация = ВТ_МетодПриходованияНП.Организация
	|			И ЗаявкаНаДоставку.ОплатаНаличные = ВТ_МетодПриходованияНП.ОплатаНаличные
	|			И ЗаявкаНаДоставку.ОплатаСБП = ВТ_МетодПриходованияНП.ОплатаСБП
	|			И ЗаявкаНаДоставку.Период = ВТ_МетодПриходованияНП.Период
	|	Левое Соединение Справочник.Сотрудники как Курьеры
	|		По ЗаявкаНаДоставку.Курьер = Курьеры.Ссылка
	|	Левое Соединение Справочник.ДоговорыКонтрагентов как КурьерыСЗ
	|		По ЗаявкаНаДоставку.Курьер = КурьерыСЗ.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаДоставку.Организация,
	|	ЗаявкаНаДоставку.Хаб,
	|	ЗаявкаНаДоставку.ОплатаНаличные,
	|	ЗаявкаНаДоставку.ОплатаСБП,
	|	Выбор Когда не ВТ_МетодПриходованияНП.ОплатаНаличные есть NULL Тогда   
		|	Выбор Когда (НЕ Курьеры.Ссылка есть NULL и Курьеры.Логс_Самозанятый) 
		|					ИЛИ (НЕ КурьерыСЗ.Ссылка есть NULL и КурьерыСЗ.Логс_ВидКлиентаCRM = Значение(Перечисление.Логс_ВидыКлиентовCRM.СамозанятыйКурьер)) Тогда
		|		Выбор Когда ВТ_ИндивидуальныеНастройкиДоговоров.МетодПриходованияСЗ =Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс) Тогда
		|			Ложь
		|		Когда ВТ_ИндивидуальныеНастройкиДоговоров.МетодПриходованияСЗ =Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Прямой) Тогда
		|			Истина
		|		Иначе
		|			Выбор Когда ВТ_МетодПриходованияНП.МетодПриходованияСЗ =Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс) Тогда
		|				Ложь
		|			Иначе  
		|				Истина
		|			Конец
		|		Конец
		|	Иначе 
		|		Выбор Когда ВТ_ИндивидуальныеНастройкиДоговоров.МетодПриходования =Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс) Тогда
		|			Ложь
		|		Когда ВТ_ИндивидуальныеНастройкиДоговоров.МетодПриходования =Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Прямой) Тогда
		|			Истина
		|		Иначе
		|			Выбор Когда ВТ_МетодПриходованияНП.МетодПриходования =Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс) Тогда
		|				Ложь
		|			Иначе  
		|				Истина
		|			Конец
		|		Конец
		|	Конец Иначе Ложь Конец,
	|	ВТ_МетодПриходованияНП.МетодПриходования,
	|	ЗаявкаНаДоставку.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкиНаДоставку.Организация КАК Ссылка
	|ПОМЕСТИТЬ Организации
	|ИЗ
	|	ЗаявкиНаДоставкуОбщие КАК ЗаявкиНаДоставку
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаявкиНаДоставку.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	МАКСИМУМ(ДоговорыКонтрагентов.Ссылка) КАК Договор
	|ПОМЕСТИТЬ Договоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Организации КАК Организации
	|		ПО ДоговорыКонтрагентов.Организация = Организации.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель)
	|	И ДоговорыКонтрагентов.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель)
	|	И ДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|	И ДоговорыКонтрагентов.Согласован
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыКонтрагентов.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Кассы.Владелец КАК Организация,
	|	МАКСИМУМ(Кассы.Ссылка) КАК Ссылка,
	|	ЕСТЬNULL(Логс_ХабыКассы.Ссылка, ЗНАЧЕНИЕ(Справочник.логс_хабы.Москва)) КАК Хаб
	|ПОМЕСТИТЬ Кассы
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Организации КАК Организации
	|		ПО Кассы.Владелец = Организации.Ссылка или кассы.Владелец =  &ОрганизацияЛогсис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Логс_Хабы.Кассы КАК Логс_ХабыКассы
	|		ПО Логс_ХабыКассы.Касса = Кассы.Ссылка
	|ГДЕ
	|	НЕ Кассы.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Кассы.Владелец,
	|	ЕСТЬNULL(Логс_ХабыКассы.Ссылка, ЗНАЧЕНИЕ(Справочник.логс_хабы.Москва))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Организации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Договоры.Организация КАК Организация,
	|	Договоры.Договор КАК Договор,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДоговорыКонтрагентов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ДоговорыКонтрагентов.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ДоговорыКонтрагентов.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ДанныеДоговоров
	|ИЗ
	|	Договоры КАК Договоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Договоры.Договор = ДоговорыКонтрагентов.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Договоры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаДоставку.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ЗаявкиНаДоставку.ОплатаНаличные
	|				И ((ЗаявкиНаДоставку.МетодПриходования = Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс) и не ЗаявкиНаДоставку.РеализацияНаРозничного) 
	|					или ЗаявкиНаДоставку.Организация=&ОрганизацияЛогсис)
	|			ТОГДА ВЫБОР
	|					КОГДА ДЕНЬНЕДЕЛИ(ДОБАВИТЬКДАТЕ(ЗаявкиНаДоставку.Период, ДЕНЬ, 1)) = 7
	|						ТОГДА ДОБАВИТЬКДАТЕ(ЗаявкиНаДоставку.Период, ДЕНЬ, 1)
	|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ЗаявкиНаДоставку.Период, ДЕНЬ, 1)
	|				КОНЕЦ
	|		ИНАЧЕ ЗаявкиНаДоставку.Период
	|	КОНЕЦ КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА ЗаявкиНаДоставку.ОплатаНаличные
	|				И (ЗаявкиНаДоставку.МетодПриходования = Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс) и не ЗаявкиНаДоставку.РеализацияНаРозничного)
	|			ТОГДА &ОрганизацияЛогсис
	|		ИНАЧЕ ЗаявкиНаДоставку.Организация
	|	КОНЕЦ КАК ОрганизацияУпр,
	|	ВЫБОР
	|		КОГДА ЗаявкиНаДоставку.ОплатаНаличные
	|				И (ЗаявкиНаДоставку.МетодПриходования = Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс) и не ЗаявкиНаДоставку.РеализацияНаРозничного)
	|			ТОГДА &КонтрагентУпр
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель)
	|	КОНЕЦ КАК КонтрагентУпр,
	|	ЗаявкиНаДоставку.Организация КАК Организация,
	|	ЗаявкиНаДоставку.РеализацияНаРозничного КАК РеализацияНаРозничного,
	|	ЗаявкиНаДоставку.МетодПриходования КАК МетодПриходования,
	|	ЗаявкиНаДоставку.Хаб КАК Хаб,
	|	ЗаявкиНаДоставку.ОплатаНаличные КАК ОплатаНаличные,
	|	ЗаявкиНаДоставку.ОплатаСБП КАК ОплатаСБП,
	|	ДанныеДоговоров.Договор КАК Договор,
	|	ДанныеДоговоров.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДанныеДоговоров.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеДоговоров.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ДанныеДоговоров.Подразделение КАК Подразделение,
	|	isnull(ЭквайринговыеТерминалы.ЭквайринговыйТерминал,ЭквайринговыеТерминалыОбщие.ЭквайринговыйТерминал)  КАК ЭквайринговыйТерминал,
	|	ЗаявкиНаДоставку.Сумма КАК Сумма
	|ИЗ
	|	ЗаявкиНаДоставкуОбщие КАК ЗаявкиНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДоговоров КАК ДанныеДоговоров
	|		ПО ЗаявкиНаДоставку.Организация = ДанныеДоговоров.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ЭквайринговыеТерминалыДляАгентов КАК ЭквайринговыеТерминалы
	|		ПО ЗаявкиНаДоставку.Организация = ЭквайринговыеТерминалы.Организация и ЗаявкиНаДоставку.Хаб = ЭквайринговыеТерминалы.Хаб и ЗаявкиНаДоставку.ОплатаСБП = ЭквайринговыеТерминалы.ОплатаСБП
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ЭквайринговыеТерминалыДляАгентов КАК ЭквайринговыеТерминалыОбщие
	|		ПО ЗаявкиНаДоставку.Организация = ЭквайринговыеТерминалыОбщие.Организация и ЭквайринговыеТерминалыОбщие.Хаб = Значение(Справочник.Логс_Хабы.Москва) и НЕ ЭквайринговыеТерминалыОбщие.ОплатаСБП";
	                                                                                
	Если Параметры.Свойство("Партнер") Тогда
		Запрос.УстановитьПараметр("Партнер", Параметры.Партнер);
		ТекстОтбораПоПартнеру = "ЗаявкаНаДоставку.Партнер = &Партнер";
	Иначе
		ТекстОтбораПоПартнеру = "ИСТИНА";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтбораПоПартнеру", ТекстОтбораПоПартнеру);
	
	ТаблицаЗаявок = Запрос.Выполнить().Выгрузить();
	ТаблицаЗаявок.Колонки.Добавить("ПринятоОт", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ТаблицаЗаявок.Колонки.Добавить("Основание", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	
	Для каждого СтрокаТаблицы Из ТаблицаЗаявок Цикл
		СтрокаТаблицы.ПринятоОт = СтрШаблон(НСтр("ru='Розничный покупатель. НП за %1'"),
			Формат(СтрокаТаблицы.Период, "ДФ='dd.MM.yyyy""г.""'"));
		//СтрокаТаблицы.ПринятоОт = "Розничный покупатель";
		Если СтрокаТаблицы.МетодПриходования = Перечисления.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс и не СтрокаТаблицы.РеализацияНаРозничного Тогда     
			СтрокаТаблицы.Основание = СтрШаблон(
						НСтр("ru='Наложенный платеж %1 за %2'"),
						СокрЛП(Стрзаменить(Строка(СтрокаТаблицы.Организация), "ООО","")),
						Формат(СтрокаТаблицы.Период, "ДФ='dd.MM.yyyy""г.""'"));
		Иначе
			СтрокаТаблицы.Основание = СтрШаблон(
						НСтр("ru='Поступление наложенного платежа за %1'"),
						Формат(СтрокаТаблицы.Период, "ДФ='dd.MM.yyyy""г.""'"));
				КонецЕсли; 
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗаявок.Период КАК Период,
	|	ТаблицаЗаявок.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаЗаявок.ОрганизацияУпр КАК ОрганизацияУпр,
	|	ТаблицаЗаявок.КонтрагентУпр КАК КонтрагентУпр,
	|	ТаблицаЗаявок.Организация КАК Организация,     
	|	ТаблицаЗаявок.РеализацияНаРозничного КАК РеализацияНаРозничного,     
	|	ТаблицаЗаявок.МетодПриходования КАК МетодПриходования,
	|	ТаблицаЗаявок.Хаб КАК Хаб,
	|	ТаблицаЗаявок.ОплатаНаличные КАК ОплатаНаличные,
	|	ТаблицаЗаявок.ОплатаСБП КАК ОплатаСБП,
	|	ТаблицаЗаявок.Договор КАК Договор,
	|	ТаблицаЗаявок.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаЗаявок.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ТаблицаЗаявок.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ТаблицаЗаявок.Подразделение КАК Подразделение,
	|	ТаблицаЗаявок.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	ТаблицаЗаявок.ПринятоОт КАК ПринятоОт,
	|	ТаблицаЗаявок.Основание КАК Основание,
	|	ТаблицаЗаявок.Сумма КАК Сумма
	|ПОМЕСТИТЬ ЗаявкиНаДоставкуВрем
	|ИЗ
	|	&ТаблицаЗаявок КАК ТаблицаЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаявок.Период КАК Период,
	|	ТаблицаЗаявок.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаЗаявок.ОрганизацияУпр КАК ОрганизацияУпр,
	|	ТаблицаЗаявок.КонтрагентУпр КАК КонтрагентУпр,
	|	ТаблицаЗаявок.Организация КАК Организация,    
	|	ТаблицаЗаявок.РеализацияНаРозничного КАК РеализацияНаРозничного,    
	|	ТаблицаЗаявок.МетодПриходования КАК МетодПриходования,
	|	Выбор когда ТаблицаЗаявок.ОплатаНаличные тогда ТаблицаЗаявок.Хаб иначе Значение(Справочник.Логс_Хабы.Москва) Конец КАК Хаб,
	|	ТаблицаЗаявок.ОплатаНаличные КАК ОплатаНаличные,
	|	ТаблицаЗаявок.ОплатаСБП КАК ОплатаСБП,
	|	ТаблицаЗаявок.Договор КАК Договор,
	|	ТаблицаЗаявок.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаЗаявок.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ТаблицаЗаявок.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ТаблицаЗаявок.Подразделение КАК Подразделение,
	|	ТаблицаЗаявок.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	ТаблицаЗаявок.ПринятоОт КАК ПринятоОт,
	|	ТаблицаЗаявок.Основание КАК Основание,
	|	СУММА(ТаблицаЗаявок.Сумма) КАК Сумма,
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов  
	|ПОМЕСТИТЬ ЗаявкиНаДоставку
	|ИЗ
	|	ЗаявкиНаДоставкуВрем КАК ТаблицаЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		По ОбъектыРасчетов.Объект = ТаблицаЗаявок.Договор
	|		И ОбъектыРасчетов.ТипРасчетов = Значение(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗаявок.КонтрагентУпр,
	|	ТаблицаЗаявок.ЭквайринговыйТерминал,
	|	ТаблицаЗаявок.Договор,
	|	ТаблицаЗаявок.ДатаДокумента,
	|	ТаблицаЗаявок.ПринятоОт,
	|	ТаблицаЗаявок.Основание,
	|	ТаблицаЗаявок.ВалютаВзаиморасчетов,
	|	ТаблицаЗаявок.НалогообложениеНДС,
	|	ТаблицаЗаявок.Подразделение,
	|	ТаблицаЗаявок.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаЗаявок.ОрганизацияУпр,
	|	ТаблицаЗаявок.Организация,    
	|	ТаблицаЗаявок.РеализацияНаРозничного,    
	|	ТаблицаЗаявок.МетодПриходования,
	|	Выбор когда ТаблицаЗаявок.ОплатаНаличные тогда ТаблицаЗаявок.Хаб иначе Значение(Справочник.Логс_Хабы.Москва) Конец,
	|	ТаблицаЗаявок.Период,
	|	ТаблицаЗаявок.ОплатаНаличные,
	|	ТаблицаЗаявок.ОплатаСБП,
	|	ОбъектыРасчетов.Ссылка  
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаДоставку.ДатаДокумента КАК ДатаДокумента,
	|	ЗаявкиНаДоставку.Период КАК Период,
	|	ЗаявкиНаДоставку.Организация КАК Организация,
	|	ЗаявкиНаДоставку.РеализацияНаРозничного КАК РеализацияНаРозничного,    
	|	ЗаявкиНаДоставку.МетодПриходования КАК МетодПриходования,
	|	ЗаявкиНаДоставку.Хаб КАК Хаб,
	|	ЗаявкиНаДоставку.Договор КАК Договор,
	|	ЗаявкиНаДоставку.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЗаявкиНаДоставку.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ЗаявкиНаДоставку.Подразделение КАК Подразделение,
	|	ЗаявкиНаДоставку.ПринятоОт КАК ПринятоОт,
	|	ЗаявкиНаДоставку.Основание КАК Основание,
	|	ЗаявкиНаДоставку.ОплатаНаличные,
	|	ЗаявкиНаДоставку.ОплатаСБП КАК ОплатаСБП,
	|	Кассы.Ссылка КАК Касса,               
	|	ЗаявкиНаДоставку.ОрганизацияУпр, 
	|	ЗаявкиНаДоставку.КонтрагентУпр,
	|	ЗаявкиНаДоставку.Сумма КАК Сумма,  
	|	ЗаявкиНаДоставку.ОбъектРасчетов КАК ОбъектРасчетов  
	|Поместить ВТ_ЗаявкиСКассами
	|ИЗ
	|	ЗаявкиНаДоставку КАК ЗаявкиНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Кассы КАК Кассы
	|		ПО ЗаявкиНаДоставку.ОрганизацияУпр = Кассы.Организация
	|			И ЗаявкиНаДоставку.Хаб = Кассы.Хаб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаДоставку.ОбъектРасчетов КАК ОбъектРасчетов,  
	|	ЗаявкиНаДоставку.ДатаДокумента КАК ДатаДокумента,
	|	ЗаявкиНаДоставку.Период КАК Период,
	|	ЗаявкиНаДоставку.Организация КАК Организация,
	|	ЗаявкиНаДоставку.РеализацияНаРозничного КАК РеализацияНаРозничного,    
	|	ЗаявкиНаДоставку.МетодПриходования КАК МетодПриходования,
	|	ЗаявкиНаДоставку.Хаб КАК Хаб,
	|	ЗаявкиНаДоставку.Договор КАК Договор,
	|	ЗаявкиНаДоставку.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЗаявкиНаДоставку.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ЗаявкиНаДоставку.Подразделение КАК Подразделение,
	|	ЗаявкиНаДоставку.ПринятоОт КАК ПринятоОт,
	|	ЗаявкиНаДоставку.Основание КАК Основание,
	|	ЕСТЬNULL(ПриходныйКассовыйОрдер.Ссылка, НЕОПРЕДЕЛЕНО) КАК ПриходныйКассовыйОрдерСсылка,
	|	ЗаявкиНаДоставку.Касса КАК Касса,
	|	ЗаявкиНаДоставку.Сумма КАК Сумма
	|ИЗ
	|	ВТ_ЗаявкиСКассами КАК ЗаявкиНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|		ПО ЗаявкиНаДоставку.ОрганизацияУпр = ПриходныйКассовыйОрдер.Организация
	|			И ЗаявкиНаДоставку.ОрганизацияУпр.Логс_ГоловноеПодразделение = ПриходныйКассовыйОрдер.Подразделение
	|			И ЗаявкиНаДоставку.КонтрагентУпр = ПриходныйКассовыйОрдер.Контрагент
	|			И ЗаявкиНаДоставку.ПринятоОт = ПриходныйКассовыйОрдер.ПринятоОт
	|			И ЗаявкиНаДоставку.Основание = ПриходныйКассовыйОрдер.Основание
	|			И ЗаявкиНаДоставку.Касса = ПриходныйКассовыйОрдер.Касса
	|			И ЗаявкиНаДоставку.Хаб = ПриходныйКассовыйОрдер.Логс_Хаб
	|			И (ЗаявкиНаДоставку.ДатаДокумента = НАЧАЛОПЕРИОДА(ПриходныйКассовыйОрдер.Дата, ДЕНЬ))
	|			И (ПриходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента))
	|			И (НЕ ПриходныйКассовыйОрдер.ПометкаУдаления)
	|ГДЕ
	|	ЗаявкиНаДоставку.ОплатаНаличные
	|	И &ТекстОтбораПоХабу
	|ИТОГИ ПО
	|	Организация,
	|	Хаб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаДоставку.ОбъектРасчетов КАК ОбъектРасчетов,  
	|	ЗаявкиНаДоставку.ДатаДокумента КАК ДатаДокумента,
	|	ЗаявкиНаДоставку.Период КАК Период,
	|	ЗаявкиНаДоставку.Организация КАК Организация,
	|	ЗаявкиНаДоставку.Хаб КАК Хаб,
	|	ЗаявкиНаДоставку.ОплатаНаличные КАК ОплатаНаличные,
	|	ЗаявкиНаДоставку.ОплатаСБП КАК ОплатаСБП,
	|	ЗаявкиНаДоставку.Договор КАК Договор,
	|	ЗаявкиНаДоставку.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЗаявкиНаДоставку.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ЗаявкиНаДоставку.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ЗаявкиНаДоставку.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(ОперацияПоПлатежнойКарте.Ссылка, НЕОПРЕДЕЛЕНО) КАК ОперацияПоПлатежнойКартеСсылка,
	|	ЗаявкиНаДоставку.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	ЗаявкиНаДоставку.ЭквайринговыйТерминал.Владелец КАК ДоговорЭквайринга,
	|	ЗаявкиНаДоставку.Сумма КАК Сумма
	|ИЗ
	|	ЗаявкиНаДоставку КАК ЗаявкиНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОперацияПоПлатежнойКарте КАК ОперацияПоПлатежнойКарте
	|		ПО ЗаявкиНаДоставку.Организация = ОперацияПоПлатежнойКарте.Организация
	|			И (ЗаявкиНаДоставку.Подразделение = ОперацияПоПлатежнойКарте.Подразделение)
	|			И (ЗаявкиНаДоставку.ДатаДокумента = НАЧАЛОПЕРИОДА(ОперацияПоПлатежнойКарте.Дата, ДЕНЬ))
	|			И (ЗаявкиНаДоставку.ЭквайринговыйТерминал = ОперацияПоПлатежнойКарте.ЭквайринговыйТерминал)
	|			И (ОперацияПоПлатежнойКарте.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель))
	|			И (ОперацияПоПлатежнойКарте.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель))
	|			И (ОперацияПоПлатежнойКарте.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента))
	|			И (НЕ ОперацияПоПлатежнойКарте.ПометкаУдаления)
	|ГДЕ
	|	НЕ ЗаявкиНаДоставку.ОплатаНаличные
	|ИТОГИ ПО
	|	Организация";
	Запрос.УстановитьПараметр("ТаблицаЗаявок", ТаблицаЗаявок);
	
	Если Параметры.Свойство("Хаб") Тогда
		МассивХабов = Новый Массив;
		МассивХабов.Добавить(Параметры.Хаб);
		Если Параметры.Хаб = Справочники.Логс_Хабы.Москва Тогда
			МассивХабов.Добавить(Справочники.Логс_Хабы.ТД);
		КонецЕсли;
		Запрос.УстановитьПараметр("Хаб", МассивХабов);
		ТекстОтбораПоХабу = "И ЗаявкиНаДоставку.Хаб в (&Хаб)";
	Иначе
		ТекстОтбораПоХабу = "";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ТекстОтбораПоХабу", ТекстОтбораПоХабу);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеПоПоступлению = Новый Структура;
	ДанныеПоПоступлению.Вставить("ПКО", РезультатыЗапроса[3]);
	ДанныеПоПоступлению.Вставить("ПлатежныеКарты", РезультатыЗапроса[4]);
	
	Возврат ДанныеПоПоступлению;
	
КонецФункции 
Функция ПолучитьДанныеПоПоступлениюДенежныхСредств(Параметры)
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(Параметры.НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(Параметры.КонецПериода));
	Запрос.УстановитьПараметр("ОрганизацияЛогсис", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ОрганизацияЛогсис());
	Запрос.УстановитьПараметр("ОрганизацияЛССервис", Справочники.Организации.НайтиПоРеквизиту("ИНН", "7734424084"));
	Запрос.УстановитьПараметр("ОрганизацияНЛ", Справочники.Организации.НайтиПоРеквизиту("ИНН", "9725030344"));
	Запрос.УстановитьПараметр("КонтрагентУпр", Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "9721047523"));
	Запрос.УстановитьПараметр("СвойствоФормироватьПКОПоНаложеннымПлатежа",
		Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоОрганизацияФормироватьПКОПоНаложеннымПлатежам());
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(ЗаявкаНаДоставку.Дата, ДЕНЬ) КАК Период,
	|	ЗаявкаНаДоставку.Договор КАК Договор,
	|	ЗаявкаНаДоставку.Организация КАК Организация,
	|	ЗаявкаНаДоставку.Хаб КАК Хаб,
	|	ЗаявкаНаДоставку.Курьер КАК Курьер,
	|	ЗаявкаНаДоставку.ОплатаНаличные КАК ОплатаНаличные,
	|	ЗаявкаНаДоставку.ОплатаСБП КАК ОплатаСБП,
	|	ЗаявкаНаДоставку.ПровайдерЧека КАК ПровайдерЧека,
	|	СУММА(ЗаявкаНаДоставку.НаложенныйПлатеж) КАК Сумма
	|ПОМЕСТИТЬ ВТ_Заявки
	|ИЗ
	|	Документ.Логс_ЗаявкаНаДоставку КАК ЗаявкаНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.ДополнительныеРеквизиты КАК ДопРеквизитыОрганизации
	|		ПО ЗаявкаНаДоставку.Организация = ДопРеквизитыОрганизации.Ссылка
	|			И (ДопРеквизитыОрганизации.Свойство = &СвойствоФормироватьПКОПоНаложеннымПлатежа)
	|ГДЕ
	|	ЗаявкаНаДоставку.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И НЕ(ЗаявкаНаДоставку.ОплатаНаличные
	|				И ЕСТЬNULL(ДопРеквизитыОрганизации.Свойство, ЛОЖЬ) = ЛОЖЬ)
	|	И ЗаявкаНаДоставку.Проведен
	|	И НЕ ЗаявкаНаДоставку.ТДРегион
	|	И НЕ ЗаявкаНаДоставку.Хаб.ЯвляетсяСКС
	|	И НЕ ЗаявкаНаДоставку.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)
	|	И ЗаявкаНаДоставку.НаложенныйПлатеж > 0
	|	И &ТекстОтбораПоПартнеру
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаДоставку.Организация,
	|	ЗаявкаНаДоставку.Хаб,
	|	ЗаявкаНаДоставку.Курьер,
	|	ЗаявкаНаДоставку.Договор,
	|	ЗаявкаНаДоставку.ОплатаНаличные,
	|	ЗаявкаНаДоставку.ОплатаСБП,
	|	ЗаявкаНаДоставку.ПровайдерЧека,
	|	НАЧАЛОПЕРИОДА(ЗаявкаНаДоставку.Дата, ДЕНЬ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаНаДоставку.Период КАК Период,
	|	ЗаявкаНаДоставку.Организация КАК Организация,
	|	ЗаявкаНаДоставку.Хаб КАК Хаб,
	|	ЗаявкаНаДоставку.ОплатаНаличные КАК ОплатаНаличные,
	|	ЗаявкаНаДоставку.ОплатаСБП КАК ОплатаСБП,
	|	Выбор Когда не Логс_МетодПриходованияНПпоЧекам.МетодПриходования есть NULL Тогда   
	|		Выбор Когда Логс_МетодПриходованияНПпоЧекам.МетодПриходования =Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс) Тогда
	|			Ложь
	|		Иначе
	|			Истина
	|		Конец
	|	Иначе Истина Конец КАК РеализацияНаРозничного,
	|	Логс_МетодПриходованияНПпоЧекам.МетодПриходования КАК МетодПриходования,
	|	СУММА(ЗаявкаНаДоставку.Сумма) КАК Сумма
	|ПОМЕСТИТЬ ЗаявкиНаДоставкуОбщие
	|ИЗ
	|	ВТ_Заявки КАК ЗаявкаНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Логс_МетодПриходованияНПпоЧекам КАК Логс_МетодПриходованияНПпоЧекам  
	|		ПО ЗаявкаНаДоставку.ПровайдерЧека = Логс_МетодПриходованияНПпоЧекам.ПровайдерЧека
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаявкаНаДоставку.Организация,
	|	ЗаявкаНаДоставку.Хаб,
	|	ЗаявкаНаДоставку.ОплатаНаличные,
	|	ЗаявкаНаДоставку.ОплатаСБП,
	|	Выбор Когда не Логс_МетодПриходованияНПпоЧекам.МетодПриходования есть NULL Тогда   
	|		Выбор Когда Логс_МетодПриходованияНПпоЧекам.МетодПриходования =Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс) Тогда
	|			Ложь
	|		Иначе
	|			Истина
	|		Конец
	|	Иначе Истина Конец,
	|	Логс_МетодПриходованияНПпоЧекам.МетодПриходования,
	|	ЗаявкаНаДоставку.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ЗаявкиНаДоставку.Организация КАК Ссылка
	|ПОМЕСТИТЬ Организации
	|ИЗ
	|	ЗаявкиНаДоставкуОбщие КАК ЗаявкиНаДоставку
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаявкиНаДоставку.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	МАКСИМУМ(ДоговорыКонтрагентов.Ссылка) КАК Договор
	|ПОМЕСТИТЬ Договоры
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Организации КАК Организации
	|		ПО ДоговорыКонтрагентов.Организация = Организации.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель)
	|	И ДоговорыКонтрагентов.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель)
	|	И ДоговорыКонтрагентов.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту)
	|	И ДоговорыКонтрагентов.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|	И ДоговорыКонтрагентов.ТипДоговора = ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем)
	|	И ДоговорыКонтрагентов.Согласован
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыКонтрагентов.Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Кассы.Владелец КАК Организация,
	|	МАКСИМУМ(Кассы.Ссылка) КАК Ссылка,
	|	ЕСТЬNULL(Логс_ХабыКассы.Ссылка, ЗНАЧЕНИЕ(Справочник.логс_хабы.Москва)) КАК Хаб
	|ПОМЕСТИТЬ Кассы
	|ИЗ
	|	Справочник.Кассы КАК Кассы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Организации КАК Организации
	|		ПО Кассы.Владелец = Организации.Ссылка или кассы.Владелец =  &ОрганизацияЛогсис
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Логс_Хабы.Кассы КАК Логс_ХабыКассы
	|		ПО Логс_ХабыКассы.Касса = Кассы.Ссылка
	|ГДЕ
	|	НЕ Кассы.ПометкаУдаления
	|
	|СГРУППИРОВАТЬ ПО
	|	Кассы.Владелец,
	|	ЕСТЬNULL(Логс_ХабыКассы.Ссылка, ЗНАЧЕНИЕ(Справочник.логс_хабы.Москва))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Организации
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Договоры.Организация КАК Организация,
	|	Договоры.Договор КАК Договор,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДоговорыКонтрагентов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ДоговорыКонтрагентов.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ДоговорыКонтрагентов.Подразделение КАК Подразделение
	|ПОМЕСТИТЬ ДанныеДоговоров
	|ИЗ
	|	Договоры КАК Договоры
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Договоры.Договор = ДоговорыКонтрагентов.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Организация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ Договоры
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаДоставку.Период КАК Период,
	|	ВЫБОР
	|		КОГДА ЗаявкиНаДоставку.ОплатаНаличные
	|				И ((ЗаявкиНаДоставку.МетодПриходования = Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс) и не ЗаявкиНаДоставку.РеализацияНаРозничного) 
	|					или ЗаявкиНаДоставку.Организация=&ОрганизацияЛогсис)
	|			ТОГДА ВЫБОР
	|					КОГДА ДЕНЬНЕДЕЛИ(ДОБАВИТЬКДАТЕ(ЗаявкиНаДоставку.Период, ДЕНЬ, 1)) = 7
	|						ТОГДА ДОБАВИТЬКДАТЕ(ЗаявкиНаДоставку.Период, ДЕНЬ, 1)
	|					ИНАЧЕ ДОБАВИТЬКДАТЕ(ЗаявкиНаДоставку.Период, ДЕНЬ, 1)
	|				КОНЕЦ
	|		ИНАЧЕ ЗаявкиНаДоставку.Период
	|	КОНЕЦ КАК ДатаДокумента,
	|	ВЫБОР
	|		КОГДА ЗаявкиНаДоставку.ОплатаНаличные
	|				И (ЗаявкиНаДоставку.МетодПриходования = Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс) и не ЗаявкиНаДоставку.РеализацияНаРозничного)
	|			ТОГДА &ОрганизацияЛогсис
	|		ИНАЧЕ ЗаявкиНаДоставку.Организация
	|	КОНЕЦ КАК ОрганизацияУпр,
	|	ВЫБОР
	|		КОГДА ЗаявкиНаДоставку.ОплатаНаличные
	|				И (ЗаявкиНаДоставку.МетодПриходования = Значение(Перечисление.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс) и не ЗаявкиНаДоставку.РеализацияНаРозничного)
	|			ТОГДА &КонтрагентУпр
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель)
	|	КОНЕЦ КАК КонтрагентУпр,
	|	ЗаявкиНаДоставку.Организация КАК Организация,
	|	ЗаявкиНаДоставку.РеализацияНаРозничного КАК РеализацияНаРозничного,
	|	ЗаявкиНаДоставку.МетодПриходования КАК МетодПриходования,
	|	ЗаявкиНаДоставку.Хаб КАК Хаб,
	|	ЗаявкиНаДоставку.ОплатаНаличные КАК ОплатаНаличные,
	|	ЗаявкиНаДоставку.ОплатаСБП КАК ОплатаСБП,
	|	ДанныеДоговоров.Договор КАК Договор,
	|	ДанныеДоговоров.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДанныеДоговоров.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ДанныеДоговоров.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ДанныеДоговоров.Подразделение КАК Подразделение,
	|	isnull(ЭквайринговыеТерминалы.ЭквайринговыйТерминал,ЭквайринговыеТерминалыОбщие.ЭквайринговыйТерминал)  КАК ЭквайринговыйТерминал,
	|	ЗаявкиНаДоставку.Сумма КАК Сумма
	|ИЗ
	|	ЗаявкиНаДоставкуОбщие КАК ЗаявкиНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДанныеДоговоров КАК ДанныеДоговоров
	|		ПО ЗаявкиНаДоставку.Организация = ДанныеДоговоров.Организация
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ЭквайринговыеТерминалыДляАгентов КАК ЭквайринговыеТерминалы
	|		ПО ЗаявкиНаДоставку.Организация = ЭквайринговыеТерминалы.Организация и ЗаявкиНаДоставку.Хаб = ЭквайринговыеТерминалы.Хаб и ЗаявкиНаДоставку.ОплатаСБП = ЭквайринговыеТерминалы.ОплатаСБП
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ЭквайринговыеТерминалыДляАгентов КАК ЭквайринговыеТерминалыОбщие
	|		ПО ЗаявкиНаДоставку.Организация = ЭквайринговыеТерминалыОбщие.Организация и ЭквайринговыеТерминалыОбщие.Хаб = Значение(Справочник.Логс_Хабы.Москва) и НЕ ЭквайринговыеТерминалыОбщие.ОплатаСБП";
	                                                                                
	Если Параметры.Свойство("Партнер") Тогда
		Запрос.УстановитьПараметр("Партнер", Параметры.Партнер);
		ТекстОтбораПоПартнеру = "ЗаявкаНаДоставку.Партнер = &Партнер";
	Иначе
		ТекстОтбораПоПартнеру = "ИСТИНА";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтбораПоПартнеру", ТекстОтбораПоПартнеру);
	
	ТаблицаЗаявок = Запрос.Выполнить().Выгрузить();
	ТаблицаЗаявок.Колонки.Добавить("ПринятоОт", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	ТаблицаЗаявок.Колонки.Добавить("Основание", ОбщегоНазначения.ОписаниеТипаСтрока(250));
	
	Для каждого СтрокаТаблицы Из ТаблицаЗаявок Цикл
		СтрокаТаблицы.ПринятоОт = СтрШаблон(НСтр("ru='Розничный покупатель. НП за %1'"),
			Формат(СтрокаТаблицы.Период, "ДФ='dd.MM.yyyy""г.""'"));
		//СтрокаТаблицы.ПринятоОт = "Розничный покупатель";
		Если СтрокаТаблицы.МетодПриходования = Перечисления.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс и не СтрокаТаблицы.РеализацияНаРозничного Тогда     
			СтрокаТаблицы.Основание = СтрШаблон(
						НСтр("ru='Наложенный платеж %1 за %2'"),
						СокрЛП(Стрзаменить(Строка(СтрокаТаблицы.Организация), "ООО","")),
						Формат(СтрокаТаблицы.Период, "ДФ='dd.MM.yyyy""г.""'"));
		Иначе
			СтрокаТаблицы.Основание = СтрШаблон(
						НСтр("ru='Поступление наложенного платежа за %1'"),
						Формат(СтрокаТаблицы.Период, "ДФ='dd.MM.yyyy""г.""'"));
				КонецЕсли; 
	КонецЦикла;
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаЗаявок.Период КАК Период,
	|	ТаблицаЗаявок.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаЗаявок.ОрганизацияУпр КАК ОрганизацияУпр,
	|	ТаблицаЗаявок.КонтрагентУпр КАК КонтрагентУпр,
	|	ТаблицаЗаявок.Организация КАК Организация,     
	|	ТаблицаЗаявок.РеализацияНаРозничного КАК РеализацияНаРозничного,     
	|	ТаблицаЗаявок.МетодПриходования КАК МетодПриходования,
	|	ТаблицаЗаявок.Хаб КАК Хаб,
	|	ТаблицаЗаявок.ОплатаНаличные КАК ОплатаНаличные,
	|	ТаблицаЗаявок.ОплатаСБП КАК ОплатаСБП,
	|	ТаблицаЗаявок.Договор КАК Договор,
	|	ТаблицаЗаявок.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаЗаявок.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ТаблицаЗаявок.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ТаблицаЗаявок.Подразделение КАК Подразделение,
	|	ТаблицаЗаявок.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	ТаблицаЗаявок.ПринятоОт КАК ПринятоОт,
	|	ТаблицаЗаявок.Основание КАК Основание,
	|	ТаблицаЗаявок.Сумма КАК Сумма
	|ПОМЕСТИТЬ ЗаявкиНаДоставкуВрем
	|ИЗ
	|	&ТаблицаЗаявок КАК ТаблицаЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаЗаявок.Период КАК Период,
	|	ТаблицаЗаявок.ДатаДокумента КАК ДатаДокумента,
	|	ТаблицаЗаявок.ОрганизацияУпр КАК ОрганизацияУпр,
	|	ТаблицаЗаявок.КонтрагентУпр КАК КонтрагентУпр,
	|	ТаблицаЗаявок.Организация КАК Организация,    
	|	ТаблицаЗаявок.РеализацияНаРозничного КАК РеализацияНаРозничного,    
	|	ТаблицаЗаявок.МетодПриходования КАК МетодПриходования,
	|	Выбор когда ТаблицаЗаявок.ОплатаНаличные тогда ТаблицаЗаявок.Хаб иначе Значение(Справочник.Логс_Хабы.Москва) Конец КАК Хаб,
	|	ТаблицаЗаявок.ОплатаНаличные КАК ОплатаНаличные,
	|	ТаблицаЗаявок.ОплатаСБП КАК ОплатаСБП,
	|	ТаблицаЗаявок.Договор КАК Договор,
	|	ТаблицаЗаявок.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ТаблицаЗаявок.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ТаблицаЗаявок.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ТаблицаЗаявок.Подразделение КАК Подразделение,
	|	ТаблицаЗаявок.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	ТаблицаЗаявок.ПринятоОт КАК ПринятоОт,
	|	ТаблицаЗаявок.Основание КАК Основание,
	|	СУММА(ТаблицаЗаявок.Сумма) КАК Сумма,
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов  
	|ПОМЕСТИТЬ ЗаявкиНаДоставку
	|ИЗ
	|	ЗаявкиНаДоставкуВрем КАК ТаблицаЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		По ОбъектыРасчетов.Объект = ТаблицаЗаявок.Договор
	|		И ОбъектыРасчетов.ТипРасчетов = Значение(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаЗаявок.КонтрагентУпр,
	|	ТаблицаЗаявок.ЭквайринговыйТерминал,
	|	ТаблицаЗаявок.Договор,
	|	ТаблицаЗаявок.ДатаДокумента,
	|	ТаблицаЗаявок.ПринятоОт,
	|	ТаблицаЗаявок.Основание,
	|	ТаблицаЗаявок.ВалютаВзаиморасчетов,
	|	ТаблицаЗаявок.НалогообложениеНДС,
	|	ТаблицаЗаявок.Подразделение,
	|	ТаблицаЗаявок.СтатьяДвиженияДенежныхСредств,
	|	ТаблицаЗаявок.ОрганизацияУпр,
	|	ТаблицаЗаявок.Организация,    
	|	ТаблицаЗаявок.РеализацияНаРозничного,    
	|	ТаблицаЗаявок.МетодПриходования,
	|	Выбор когда ТаблицаЗаявок.ОплатаНаличные тогда ТаблицаЗаявок.Хаб иначе Значение(Справочник.Логс_Хабы.Москва) Конец,
	|	ТаблицаЗаявок.Период,
	|	ТаблицаЗаявок.ОплатаНаличные,
	|	ТаблицаЗаявок.ОплатаСБП,
	|	ОбъектыРасчетов.Ссылка  
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаДоставку.ДатаДокумента КАК ДатаДокумента,
	|	ЗаявкиНаДоставку.Период КАК Период,
	|	ЗаявкиНаДоставку.Организация КАК Организация,
	|	ЗаявкиНаДоставку.РеализацияНаРозничного КАК РеализацияНаРозничного,    
	|	ЗаявкиНаДоставку.МетодПриходования КАК МетодПриходования,
	|	ЗаявкиНаДоставку.Хаб КАК Хаб,
	|	ЗаявкиНаДоставку.Договор КАК Договор,
	|	ЗаявкиНаДоставку.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЗаявкиНаДоставку.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ЗаявкиНаДоставку.Подразделение КАК Подразделение,
	|	ЗаявкиНаДоставку.ПринятоОт КАК ПринятоОт,
	|	ЗаявкиНаДоставку.Основание КАК Основание,
	|	ЗаявкиНаДоставку.ОплатаНаличные,
	|	ЗаявкиНаДоставку.ОплатаСБП КАК ОплатаСБП,
	|	Кассы.Ссылка КАК Касса,               
	|	ЗаявкиНаДоставку.ОрганизацияУпр, 
	|	ЗаявкиНаДоставку.КонтрагентУпр,
	|	ЗаявкиНаДоставку.Сумма КАК Сумма,  
	|	ЗаявкиНаДоставку.ОбъектРасчетов КАК ОбъектРасчетов  
	|Поместить ВТ_ЗаявкиСКассами
	|ИЗ
	|	ЗаявкиНаДоставку КАК ЗаявкиНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Кассы КАК Кассы
	|		ПО ЗаявкиНаДоставку.ОрганизацияУпр = Кассы.Организация
	|			И ЗаявкиНаДоставку.Хаб = Кассы.Хаб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаДоставку.ОбъектРасчетов КАК ОбъектРасчетов,  
	|	ЗаявкиНаДоставку.ДатаДокумента КАК ДатаДокумента,
	|	ЗаявкиНаДоставку.Период КАК Период,
	|	ЗаявкиНаДоставку.Организация КАК Организация,
	|	ЗаявкиНаДоставку.РеализацияНаРозничного КАК РеализацияНаРозничного,    
	|	ЗаявкиНаДоставку.МетодПриходования КАК МетодПриходования,
	|	ЗаявкиНаДоставку.Хаб КАК Хаб,
	|	ЗаявкиНаДоставку.Договор КАК Договор,
	|	ЗаявкиНаДоставку.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЗаявкиНаДоставку.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ЗаявкиНаДоставку.Подразделение КАК Подразделение,
	|	ЗаявкиНаДоставку.ПринятоОт КАК ПринятоОт,
	|	ЗаявкиНаДоставку.Основание КАК Основание,
	|	ЕСТЬNULL(ПриходныйКассовыйОрдер.Ссылка, НЕОПРЕДЕЛЕНО) КАК ПриходныйКассовыйОрдерСсылка,
	|	ЗаявкиНаДоставку.Касса КАК Касса,
	|	ЗаявкиНаДоставку.Сумма КАК Сумма
	|ИЗ
	|	ВТ_ЗаявкиСКассами КАК ЗаявкиНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|		ПО ЗаявкиНаДоставку.ОрганизацияУпр = ПриходныйКассовыйОрдер.Организация
	|			И ЗаявкиНаДоставку.ОрганизацияУпр.Логс_ГоловноеПодразделение = ПриходныйКассовыйОрдер.Подразделение
	|			И ЗаявкиНаДоставку.КонтрагентУпр = ПриходныйКассовыйОрдер.Контрагент
	|			И ЗаявкиНаДоставку.ПринятоОт = ПриходныйКассовыйОрдер.ПринятоОт
	|			И ЗаявкиНаДоставку.Основание = ПриходныйКассовыйОрдер.Основание
	|			И ЗаявкиНаДоставку.Касса = ПриходныйКассовыйОрдер.Касса
	|			И ЗаявкиНаДоставку.Хаб = ПриходныйКассовыйОрдер.Логс_Хаб
	|			И (ЗаявкиНаДоставку.ДатаДокумента = НАЧАЛОПЕРИОДА(ПриходныйКассовыйОрдер.Дата, ДЕНЬ))
	|			И (ПриходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента))
	|			И (НЕ ПриходныйКассовыйОрдер.ПометкаУдаления)
	|ГДЕ
	|	ЗаявкиНаДоставку.ОплатаНаличные
	|	И &ТекстОтбораПоХабу
	|ИТОГИ ПО
	|	Организация,
	|	Хаб
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкиНаДоставку.ОбъектРасчетов КАК ОбъектРасчетов,  
	|	ЗаявкиНаДоставку.ДатаДокумента КАК ДатаДокумента,
	|	ЗаявкиНаДоставку.Период КАК Период,
	|	ЗаявкиНаДоставку.Организация КАК Организация,
	|	ЗаявкиНаДоставку.Хаб КАК Хаб,
	|	ЗаявкиНаДоставку.ОплатаНаличные КАК ОплатаНаличные,
	|	ЗаявкиНаДоставку.ОплатаСБП КАК ОплатаСБП,
	|	ЗаявкиНаДоставку.Договор КАК Договор,
	|	ЗаявкиНаДоставку.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ЗаявкиНаДоставку.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ЗаявкиНаДоставку.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ЗаявкиНаДоставку.Подразделение КАК Подразделение,
	|	ЕСТЬNULL(ОперацияПоПлатежнойКарте.Ссылка, НЕОПРЕДЕЛЕНО) КАК ОперацияПоПлатежнойКартеСсылка,
	|	ЗаявкиНаДоставку.ЭквайринговыйТерминал КАК ЭквайринговыйТерминал,
	|	ЗаявкиНаДоставку.ЭквайринговыйТерминал.Владелец КАК ДоговорЭквайринга,
	|	ЗаявкиНаДоставку.Сумма КАК Сумма
	|ИЗ
	|	ЗаявкиНаДоставку КАК ЗаявкиНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОперацияПоПлатежнойКарте КАК ОперацияПоПлатежнойКарте
	|		ПО ЗаявкиНаДоставку.Организация = ОперацияПоПлатежнойКарте.Организация
	|			И (ЗаявкиНаДоставку.Подразделение = ОперацияПоПлатежнойКарте.Подразделение)
	|			И (ЗаявкиНаДоставку.ДатаДокумента = НАЧАЛОПЕРИОДА(ОперацияПоПлатежнойКарте.Дата, ДЕНЬ))
	|			И (ЗаявкиНаДоставку.ЭквайринговыйТерминал = ОперацияПоПлатежнойКарте.ЭквайринговыйТерминал)
	|			И (ОперацияПоПлатежнойКарте.Партнер = ЗНАЧЕНИЕ(Справочник.Партнеры.РозничныйПокупатель))
	|			И (ОперацияПоПлатежнойКарте.Контрагент = ЗНАЧЕНИЕ(Справочник.Контрагенты.РозничныйПокупатель))
	|			И (ОперацияПоПлатежнойКарте.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента))
	|			И (НЕ ОперацияПоПлатежнойКарте.ПометкаУдаления)
	|ГДЕ
	|	НЕ ЗаявкиНаДоставку.ОплатаНаличные
	|ИТОГИ ПО
	|	Организация";
	Запрос.УстановитьПараметр("ТаблицаЗаявок", ТаблицаЗаявок);
	
	Если Параметры.Свойство("Хаб") Тогда
		МассивХабов = Новый Массив;
		МассивХабов.Добавить(Параметры.Хаб);
		Если Параметры.Хаб = Справочники.Логс_Хабы.Москва Тогда
			МассивХабов.Добавить(Справочники.Логс_Хабы.ТД);
		КонецЕсли;
		Запрос.УстановитьПараметр("Хаб", МассивХабов);
		ТекстОтбораПоХабу = "И ЗаявкиНаДоставку.Хаб в (&Хаб)";
	Иначе
		ТекстОтбораПоХабу = "";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ТекстОтбораПоХабу", ТекстОтбораПоХабу);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеПоПоступлению = Новый Структура;
	ДанныеПоПоступлению.Вставить("ПКО", РезультатыЗапроса[3]);
	ДанныеПоПоступлению.Вставить("ПлатежныеКарты", РезультатыЗапроса[4]);
	
	Возврат ДанныеПоПоступлению;
	
КонецФункции 

Процедура СоздатьДокументПриходныйКассовыйОрдер(РезультатЗапроса, ТолькоСоздаватьНовые, СписокОшибок)
	
	ОрганизацияЛогсис = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ОрганизацияЛогсис();
	ОрганизацияЛССервис = Справочники.Организации.НайтиПоРеквизиту("ИНН", "7734424084");
	ОрганизацияНЛ = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9725030344");
	ОрганизацияЛГ = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9725007793");
	ОрганизацияОЛ = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9728051543");
	КассаУпр = Справочники.Кассы.НайтиПоНаименованию("Организация Логсис (RUB)");
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Контрагенты.Ссылка КАК Контрагент,
	|	Контрагенты.Партнер КАК Партнер
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ИНН = &ИНН");
	Запрос.УстановитьПараметр("ИНН", "9721047523");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	ПлательщикЛССервис = Выборка.Контрагент;
	ПартнерЛССервис = Выборка.Партнер;
	
	
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
	|	ДоговорыКонтрагентов.Подразделение КАК Подразделение,
	|	ДоговорыКонтрагентов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ОбъектыРасчетов.Ссылка КАК ОбъектРасчетов
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ОбъектыРасчетов КАК ОбъектыРасчетов
	|		По ОбъектыРасчетов.Объект = ДоговорыКонтрагентов.Ссылка
	|		И ОбъектыРасчетов.ТипРасчетов = Значение(Перечисление.ТипыРасчетовСПартнерами.РасчетыСКлиентом)
	|ГДЕ
	|	ДоговорыКонтрагентов.Контрагент = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация
	|	И ДоговорыКонтрагентов.Наименование = &Наименование
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления");
	Запрос.УстановитьПараметр("Контрагент", ПлательщикЛССервис);
	Запрос.УстановитьПараметр("Организация", ОрганизацияЛогсис);
	Запрос.УстановитьПараметр("Наименование", "Поступление ДС от РП ЛСС-Вох");
	
	ДоговорЛССервис = Запрос.Выполнить().Выбрать();
	ДоговорЛССервис.Следующий();
	
	Запрос.УстановитьПараметр("Наименование", "Поступление ДС от РП НЛ-Вох");
	
	ДоговорНЛ = Запрос.Выполнить().Выбрать();
	ДоговорНЛ.Следующий();
	
	Запрос.УстановитьПараметр("Наименование", "Поступление ДС от РП ЛГ-Вох");
	
	ДоговорЛГ = Запрос.Выполнить().Выбрать();
	ДоговорЛГ.Следующий();
	
	Запрос.УстановитьПараметр("Наименование", "Поступление ДС от РП ОРИОН-Вох");
	
	ДоговорОЛ = Запрос.Выполнить().Выбрать();
	ДоговорОЛ.Следующий();
	
	ВыборкаОрганизации = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизации.Следующий() Цикл
	
		ВыборкаХаб = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);   
		Пока ВыборкаХаб.Следующий() Цикл
		    Выборка = ВыборкаХаб.Выбрать();                                                      
			Пока Выборка.Следующий() Цикл
				
				Если ЗначениеЗаполнено(Выборка.ПриходныйКассовыйОрдерСсылка) Тогда
					
					Если ТолькоСоздаватьНовые Тогда
						Продолжить;
					КонецЕсли; 
					
					ПриходныйКассовыйОрдер = Выборка.ПриходныйКассовыйОрдерСсылка.ПолучитьОбъект();
					ПриходныйКассовыйОрдер.РасшифровкаПлатежа.Очистить();
					
				Иначе
					
					ПриходныйКассовыйОрдер = Документы.ПриходныйКассовыйОрдер.СоздатьДокумент();
					ПриходныйКассовыйОрдер.Дата = КонецДня(Выборка.ДатаДокумента);
					
				КонецЕсли; 
				
				Если Выборка.Организация = ОрганизацияЛССервис Тогда  //неактуально
					ПриходныйКассовыйОрдер.Организация = ОрганизацияЛогсис;
					ПриходныйКассовыйОрдер.Касса = КассаУпр;
					ПриходныйКассовыйОрдер.Контрагент = ПлательщикЛССервис;
					ПриходныйКассовыйОрдер.Партнер = ПартнерЛССервис;
					ПриходныйКассовыйОрдер.Подразделение = ДоговорЛССервис.Подразделение;
					ПриходныйКассовыйОрдер.Основание = СтрШаблон(
						НСтр("ru='Наложенный платеж ЛС Сервис за %1'"),
						Формат(Выборка.Период, "ДФ='dd.MM.yyyy""г.""'"));
				//ИначеЕсли Выборка.Организация = ОрганизацияНЛ И Выборка.Период>=Дата(2020,09,01) и не Выборка.РеализацияНаРозничного Тогда     
				ИначеЕсли Выборка.МетодПриходования = Перечисления.Логс_МетодыПриходованияНаложенногоПлатежа.Бокс и не Выборка.РеализацияНаРозничного Тогда     
					ПриходныйКассовыйОрдер.Организация = ОрганизацияЛогсис;
					ПриходныйКассовыйОрдер.Касса = Выборка.Касса;
					ПриходныйКассовыйОрдер.Контрагент = ПлательщикЛССервис;
					ПриходныйКассовыйОрдер.Партнер = ПартнерЛССервис;
					ПриходныйКассовыйОрдер.Подразделение = ДоговорНЛ.Подразделение;
					ПриходныйКассовыйОрдер.Основание = СтрШаблон(
						НСтр("ru='Наложенный платеж %1 за %2'"),
						СокрЛП(Стрзаменить(Строка(Выборка.Организация), "ООО","")),
						Формат(Выборка.Период, "ДФ='dd.MM.yyyy""г.""'"));
				Иначе

					ПриходныйКассовыйОрдер.Организация = Выборка.Организация;
					ПриходныйКассовыйОрдер.Касса = Выборка.Касса;
					ПриходныйКассовыйОрдер.Контрагент = Справочники.Контрагенты.РозничныйПокупатель;
					ПриходныйКассовыйОрдер.Партнер = Справочники.Партнеры.РозничныйПокупатель;
					ПриходныйКассовыйОрдер.Подразделение = Выборка.Подразделение;
					ПриходныйКассовыйОрдер.Основание = СтрШаблон(
						НСтр("ru='Поступление наложенного платежа за %1'"),
						Формат(Выборка.Период, "ДФ='dd.MM.yyyy""г.""'"));
				КонецЕсли; 
				
				//Если ЗначениеЗаполнено(Выборка.Хаб) и НЕ Выборка.Хаб = Справочники.Логс_Хабы.Москва и НЕ Выборка.Хаб = Справочники.Логс_Хабы.ТД Тогда
				//	КассаХаба = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ПолучитьОсновнуюКассуХаба(Выборка.Хаб, Выборка.Организация);
				//	ПриходныйКассовыйОрдер.Касса = ?(ЗначениеЗаполнено(КассаХаба), КассаХаба, ПриходныйКассовыйОрдер.Касса);
				//КонецЕсли;
					
				ПриходныйКассовыйОрдер.СуммаДокумента = Выборка.Сумма;
				ПриходныйКассовыйОрдер.Логс_Хаб = Выборка.Хаб;
				ПриходныйКассовыйОрдер.Логс_ДатаРасчетов = Выборка.Период;
				ПриходныйКассовыйОрдер.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента;
				ПриходныйКассовыйОрдер.ПринятоОт = Выборка.ПринятоОт;
				ПриходныйКассовыйОрдер.Валюта = ВалютаРеглУчета;
				ПриходныйКассовыйОрдер.ВТомЧислеНДС = НСтр("ru='Без налога (НДС)'");
				ПриходныйКассовыйОрдер.Кассир = Пользователи.ТекущийПользователь();
				
				ОтветственныеЛицаСервер.ПриИзмененииСвязанныхРеквизитовДокумента(ПриходныйКассовыйОрдер);
				
				СтрокаПлатежа = ПриходныйКассовыйОрдер.РасшифровкаПлатежа.Добавить();
				
				Если Выборка.Организация = ОрганизацияЛССервис Тогда
					СтрокаПлатежа.Партнер = ПартнерЛССервис;
					СтрокаПлатежа.ОснованиеПлатежа = ДоговорЛССервис.Ссылка;
					СтрокаПлатежа.СтатьяДвиженияДенежныхСредств = ДоговорЛССервис.СтатьяДвиженияДенежныхСредств;
					СтрокаПлатежа.ОбъектРасчетов = ДоговорЛССервис.ОбъектРасчетов;
				ИначеЕсли Выборка.Организация = ОрганизацияНЛ и НЕ Выборка.РеализацияНаРозничного Тогда    //?
					СтрокаПлатежа.Партнер = ПартнерЛССервис;
					СтрокаПлатежа.ОснованиеПлатежа = ДоговорНЛ.Ссылка;
					СтрокаПлатежа.СтатьяДвиженияДенежныхСредств = ДоговорНЛ.СтатьяДвиженияДенежныхСредств;
					СтрокаПлатежа.ОбъектРасчетов = ДоговорНЛ.ОбъектРасчетов;
				ИначеЕсли Выборка.Организация = ОрганизацияОЛ и НЕ Выборка.РеализацияНаРозничного Тогда    //?
					СтрокаПлатежа.Партнер = ПартнерЛССервис;
					СтрокаПлатежа.ОснованиеПлатежа = ДоговорОЛ.Ссылка;
					СтрокаПлатежа.СтатьяДвиженияДенежныхСредств = ДоговорОЛ.СтатьяДвиженияДенежныхСредств;
					СтрокаПлатежа.ОбъектРасчетов = ДоговорОЛ.ОбъектРасчетов;
				ИначеЕсли Выборка.Организация = ОрганизацияЛГ и НЕ Выборка.РеализацияНаРозничного Тогда    //?
					СтрокаПлатежа.Партнер = ПартнерЛССервис;
					СтрокаПлатежа.ОснованиеПлатежа = ДоговорЛГ.Ссылка;
					СтрокаПлатежа.СтатьяДвиженияДенежныхСредств = ДоговорЛГ.СтатьяДвиженияДенежныхСредств;
					СтрокаПлатежа.ОбъектРасчетов = ДоговорЛГ.ОбъектРасчетов;
				Иначе
					СтрокаПлатежа.Партнер = Справочники.Партнеры.РозничныйПокупатель;
					СтрокаПлатежа.ОснованиеПлатежа = Выборка.Договор;
					СтрокаПлатежа.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДвиженияДенежныхСредств;
					СтрокаПлатежа.ОбъектРасчетов = Выборка.ОбъектРасчетов;//СтрокаПлатежа.ОснованиеПлатежа;
				КонецЕсли;
				
				СтрокаПлатежа.Сумма = Выборка.Сумма;
				СтрокаПлатежа.ВалютаВзаиморасчетов = Выборка.ВалютаВзаиморасчетов;
				СтрокаПлатежа.Организация = ПриходныйКассовыйОрдер.Организация;
				//СтрокаПлатежа.СтавкаНДС = Перечисления.СтавкиНДС.БезНДС;
				СтрокаПлатежа.СтавкаНДС = Справочники.СтавкиНДС.БезНДС;
				СтрокаПлатежа.СуммаНДС = 0;
											
				Если ПриходныйКассовыйОрдер.Ссылка.Пустая() Тогда
					ПриходныйКассовыйОрдер.УстановитьНовыйНомер();
					ПриходныйКассовыйОрдер.Записать(РежимЗаписиДокумента.Запись,РежимПроведенияДокумента.Неоперативный);
				КонецЕсли; 

				Попытка
					ПриходныйКассовыйОрдер.Дата = КонецДня(Выборка.ДатаДокумента);
					ПриходныйКассовыйОрдер.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
				Исключение
					ТекстСообщения = СтрШаблон(
						НСтр("ru='Произошла ошибка при записи приходного кассового ордера № %1 от %2: %3'"),
						ПриходныйКассовыйОрдер.Номер, Формат(ПриходныйКассовыйОрдер.Дата, "ДФ=dd.MM.yyyy"),
						КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание приходных кассовых ордеров",
						УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
					СписокОшибок.Добавить(Новый Структура("ТекстОшибки,КлючДанных",
						ТекстСообщения, ПриходныйКассовыйОрдер.Ссылка));
				КонецПопытки;
				
			КонецЦикла; // Периоды
		КонецЦикла; // Хабы
	КонецЦикла; // Организации
	
КонецПроцедуры

Процедура СоздатьДокументОперацияПоПлатежнойКарте(РезультатЗапроса, ТолькоСоздаватьНовые, СписокОшибок)
	СтавкаНДС20 = Константы.Логс_СтавкаНДС20.Получить();
	СтавкаБезНДС = Справочники.СтавкиНДС.БезНДС;
	СтавкаНДС22 = Справочники.СтавкиНДС.НайтиПоНаименованию("22%");
	
	ВалютаРеглУчета = Константы.ВалютаРегламентированногоУчета.Получить();
	
	ВыборкаОрганизации = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаОрганизации.Следующий() Цикл
	
		Выборка = ВыборкаОрганизации.Выбрать();                                                
		Пока Выборка.Следующий() Цикл
			
			Если ЗначениеЗаполнено(Выборка.ОперацияПоПлатежнойКартеСсылка) Тогда
				
				Если ТолькоСоздаватьНовые Тогда
					Продолжить;
				КонецЕсли; 
				
				ОперацияПоПлатежнойКарте = Выборка.ОперацияПоПлатежнойКартеСсылка.ПолучитьОбъект();
				ОперацияПоПлатежнойКарте.РасшифровкаПлатежа.Очистить();
				
			Иначе
				ОперацияПоПлатежнойКарте = Документы.ОперацияПоПлатежнойКарте.СоздатьДокумент();
				//ОперацияПоПлатежнойКарте.Дата = КонецДня(Выборка.Период);
				ОперацияПоПлатежнойКарте.Дата = КонецДня(Выборка.ДатаДокумента);
			КонецЕсли;
			
			ОперацияПоПлатежнойКарте.Организация = Выборка.Организация;
			ОперацияПоПлатежнойКарте.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента;
			ОперацияПоПлатежнойКарте.Валюта = ВалютаРеглУчета;
			ОперацияПоПлатежнойКарте.Контрагент = Справочники.Контрагенты.РозничныйПокупатель;
			ОперацияПоПлатежнойКарте.СуммаДокумента = Выборка.Сумма;
			ОперацияПоПлатежнойКарте.ЭквайринговыйТерминал = Выборка.ЭквайринговыйТерминал;
			ОперацияПоПлатежнойКарте.ДоговорЭквайринга = Выборка.ДоговорЭквайринга;
			ОперацияПоПлатежнойКарте.НомерПлатежнойКарты = "1111111111111111111111";
			ОперацияПоПлатежнойКарте.Ответственный = Пользователи.ТекущийПользователь();
			ОперацияПоПлатежнойКарте.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДвиженияДенежныхСредств;
			ОперацияПоПлатежнойКарте.Партнер = Справочники.Партнеры.РозничныйПокупатель;
			ОперацияПоПлатежнойКарте.Подразделение = Выборка.Подразделение;
				
			СтрокаПлатежа = ОперацияПоПлатежнойКарте.РасшифровкаПлатежа.Добавить();
			СтрокаПлатежа.Партнер = Справочники.Партнеры.РозничныйПокупатель;
			СтрокаПлатежа.СтатьяДвиженияДенежныхСредств = Выборка.СтатьяДвиженияДенежныхСредств;
			СтрокаПлатежа.ОснованиеПлатежа = Выборка.Договор;
			СтрокаПлатежа.ОбъектРасчетов = Выборка.ОбъектРасчетов;
			СтрокаПлатежа.Сумма = Выборка.Сумма;
			СтрокаПлатежа.ВалютаВзаиморасчетов = Выборка.ВалютаВзаиморасчетов;
			
			Если Выборка.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС И ОперацияПоПлатежнойКарте.Дата >= Дата("20260101") Тогда
				СтрокаПлатежа.СтавкаНДС = СтавкаНДС22;
				СтрокаПлатежа.СуммаНДС = СтрокаПлатежа.Сумма * 0.22/1.22;  
			ИначеЕсли Выборка.НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС Тогда
				СтрокаПлатежа.СтавкаНДС = СтавкаНДС20;
				СтрокаПлатежа.СуммаНДС = СтрокаПлатежа.Сумма * 0.2/1.2;

			Иначе
				СтрокаПлатежа.СтавкаНДС = СтавкаБезНДС;
				СтрокаПлатежа.СуммаНДС = 0;
			КонецЕсли; 
										
			Если ОперацияПоПлатежнойКарте.Ссылка.Пустая() Тогда
				ОперацияПоПлатежнойКарте.УстановитьНовыйНомер();
				ОперацияПоПлатежнойКарте.Записать(РежимЗаписиДокумента.Запись);
			КонецЕсли; 

			Попытка
				ОперацияПоПлатежнойКарте.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				ТекстСообщения = СтрШаблон(
					НСтр("ru='Произошла ошибка при записи операции по платежной карте № %1 от %2: %3'"),
					ОперацияПоПлатежнойКарте.Номер, Формат(ОперацияПоПлатежнойКарте.Дата, "ДФ=dd.MM.yyyy"),
					КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				ЗаписьЖурналаРегистрации("УУ Создание регламентированных документов. Создание приходных кассовых ордеров",
					УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
				СписокОшибок.Добавить(Новый Структура("ТекстОшибки,КлючДанных",
					ТекстСообщения, ОперацияПоПлатежнойКарте.Ссылка));
			КонецПопытки;
			
		КонецЦикла; // Периоды
	КонецЦикла; // Организации
	
КонецПроцедуры

#КонецОбласти 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Процедура ПоместитьДоговорыПоДвижениюДенежныхСредствВоВременнуюТаблицу(Параметры, МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Организация", Параметры.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ДоговорыКонтрагентов.Подразделение КАК Подразделение,
	|	ДоговорыКонтрагентов.НалогообложениеНДС КАК НалогообложениеНДС,
	|	ИСТИНА КАК ЦенаВключаетНДС,
	|	ДоговорыКонтрагентов.БанковскийСчет КАК БанковскийСчет,
	|	ДоговорыКонтрагентов.БанковскийСчетКонтрагента КАК БанковскийСчетКонтрагента,
	|	ДоговорыКонтрагентов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК ВалютаВзаиморасчетов,
	|	ДоговорыКонтрагентов.ПорядокРасчетов КАК ПорядокРасчетов,
	|	Неопределено КАК ПорядокОплаты,
	|	Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту КАК ФормаОплатыУслуг,
	|	ДоговорыКонтрагентов.НаименованиеДляПечати КАК Основание,
	|	ДоговорыКонтрагентов.Дата КАК ОснованиеДата,
	|	ДоговорыКонтрагентов.Номер КАК ОснованиеНомер,
	|	ДоговорыКонтрагентов.Логс_ДоговорНаОказаниеУслуг КАК ДоговорНаОказаниеУслуг,
	|	ДоговорыКонтрагентов.Логс_ВидКлиентаCRM КАК ВидКлиента,
	|	ЕСТЬNULL(СкладыОрганизаций.Склад, НЕОПРЕДЕЛЕНО) КАК Склад
	|ПОМЕСТИТЬ СписокДоговоров
	|ИЗ
	|	РегистрСведений.Логс_ИсторияФормыОплатыДоговоров.СрезПоследних КАК Логс_ИсторияФормыОплатыДоговоровСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Логс_СкладыОрганизацийТовараАгента КАК СкладыОрганизаций
	|			ПО ДоговорыКонтрагентов.Организация = СкладыОрганизаций.Организация
	|		ПО Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ДоговорКонтрагентов = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.Логс_ВидКлиентаCRM <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.ПустаяСсылка)
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления  И (ДоговорыКонтрагентов.Организация = &Организация или &Организация = Значение(Справочник.Организации.ПустаяСсылка))
	|	И &ТекстОтбора
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Договор";
	
	ТекстОтбора = "";
	Если Параметры.Свойство("Партнер") Тогда
		ТекстОтбора = "ДоговорыКонтрагентов.Партнер = &Партнер";
		Запрос.УстановитьПараметр("Партнер", Параметры.Партнер);
	КонецЕсли;
	Если Параметры.Свойство("СрокиВыставленияАктовВыполненныхРабот")
			И ЗначениеЗаполнено(Параметры.СрокиВыставленияАктовВыполненныхРабот) Тогда
		
		Если ТекстОтбора <> "" Тогда
			ТекстОтбора = ТекстОтбора + " И ";
		КонецЕсли; 
		
		ТекстОтбора = ТекстОтбора + "ДоговорыКонтрагентов.Логс_СрокВыставленияАктовВыполненныхРабот В(&СрокиВыставленияАктовВыполненныхРабот)";
		
		Запрос.УстановитьПараметр("СрокиВыставленияАктовВыполненныхРабот", Параметры.СрокиВыставленияАктовВыполненныхРабот);
		
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтбора",
		?(ТекстОтбора = "", "ИСТИНА", ТекстОтбора));
		
	Запрос.Выполнить();
	
КонецПроцедуры 

Функция ПолучитьДокументыПриемаНаКомиссиюИзТаблицыСозданныхДокументов(ТаблицаСозданныхДокументов)
	
	ДокументыПриемаНаКомиссию = Новый Массив;
	
	Для каждого СтрокаТаблицы Из ТаблицаСозданныхДокументов Цикл
		Для каждого СтрокаДокумент Из СтрокаТаблицы.ДокументыПриемаНаКомиссию Цикл
			ДокументыПриемаНаКомиссию.Добавить(СтрокаДокумент.Ссылка);
		КонецЦикла;
	КонецЦикла;
	
	Возврат ДокументыПриемаНаКомиссию;
	
КонецФункции 

Функция ПолучитьДокументыРеализацииИзТаблицыСозданныхДокументов(ТаблицаСозданныхДокументов)
	
	ДокументыРеализации = Новый Массив;
	
	Для каждого СтрокаТаблицы Из ТаблицаСозданныхДокументов Цикл
		Для каждого СтрокаДокумент Из СтрокаТаблицы.ДокументыПриемаНаКомиссию Цикл
			Для каждого ДокументРеализации Из СтрокаДокумент.ДокументыРеализации Цикл
				ДокументыРеализации.Добавить(ДокументРеализации.Ссылка);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ДокументыРеализации;
	
КонецФункции 

Функция ПолучитьДокументыДляСчетФактурИзТаблицыСозданныхДокументов(ТаблицаСозданныхДокументов)
	
	МассивДокументов = Новый Массив;
	
	Для каждого СтрокаТаблицы Из ТаблицаСозданныхДокументов Цикл
		Для каждого Документ Из СтрокаТаблицы.ДокументыОтчетовКомитентам Цикл
			МассивДокументов.Добавить(Документ);
		КонецЦикла;
		Для каждого Документ Из СтрокаТаблицы.ДокументыАктовВыполненныхРабот Цикл
			МассивДокументов.Добавить(Документ);
		КонецЦикла;
	КонецЦикла;
	
	Возврат МассивДокументов;
	
КонецФункции 

#Область Прочее

Функция ДеньЯвляетсяРабочим(ДатаКалендаря, ПроизводственныйКалендарь)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДанныеПроизводственногоКалендаря.ВидДня = ЗНАЧЕНИЕ(Перечисление.ВидыДнейПроизводственногоКалендаря.Рабочий) КАК Рабочий
	|ИЗ
	|	РегистрСведений.ДанныеПроизводственногоКалендаря КАК ДанныеПроизводственногоКалендаря
	|ГДЕ
	|	ДанныеПроизводственногоКалендаря.ПроизводственныйКалендарь = &ПроизводственныйКалендарь
	|	И ДанныеПроизводственногоКалендаря.Дата = &Дата");
	Запрос.УстановитьПараметр("ПроизводственныйКалендарь", ПроизводственныйКалендарь);
	Запрос.УстановитьПараметр("Дата", ДатаКалендаря);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(),
		Выборка.Рабочий,
		ДеньНедели(ДатаКалендаря) < 6); // Если нет данных в производственном календаре, то проверяем на выходной день (Сб/Вс).
	
КонецФункции

#КонецОбласти 

#КонецОбласти

#КонецЕсли
