Процедура ОповеститьTMSОСозданииКурьера(Сотрудник, АдресХранилища) Экспорт
	
	//Если ТипЗнч(Сотрудник) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
	//	Возврат;
	//	ОповеститьCRMОСозданииКурьераСамозанятого(Сотрудник, АдресХранилища);
	//КонецЕсли;
	
	ОбменСTMS = УправлениеСвойствами.ЗначениеСвойства(Сотрудник,
		Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоСотрудникОбменСTMS());
	
	ДанныеКурьера = ПолучитьДанныеКурьера(Сотрудник);
	КонтактнаяИнформация = ДанныеКурьера.ФизическоеЛицо.КонтактнаяИнформация;
	Для каждого Строка из КонтактнаяИнформация Цикл
		Если Строка.Вид.Наименование = "Адрес по прописке" Тогда
		 АдресПоПрописке = Строка.Представление;	
		ИначеЕсли Строка.Вид.Наименование = "Адрес места проживания" Тогда
		 ФактичАдрес = Строка.Представление;	
		КонецЕсли;
	КонецЦикла;	
	
	ХабИД = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ПолучитьХабСотрудникаTMS(Сотрудник).ИД;
	
	ФИОФизическогоЛица = ФизическиеЛицаУТ.ФамилияИмяОтчество(ДанныеКурьера.ФизическоеЛицо);
	ФамилияИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИОФизическогоЛица);
	
	ФИОКоротко = "" + СокрЛП(ФИОФизическогоЛица.Фамилия) + " " + СокрЛП(ФИОФизическогоЛица.Имя);
	
		
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("key", "NEEDKEY"); //
	
	Телефон = "";
	Для Сч = 1 По СтрДлина(ДанныеКурьера.Телефон) Цикл
		ТекСимвол = Сред(ДанныеКурьера.Телефон, Сч, 1);
		Если ТекСимвол >= "0" И ТекСимвол <= "9" Тогда
			Телефон = Телефон + ТекСимвол;
		КонецЕсли; 
	КонецЦикла;
	
	ПараметрыЗапроса.Вставить("cr_fullname", ДанныеКурьера.ФИО);
	ПараметрыЗапроса.Вставить("cr_shortname", ФИОКоротко);
	Если Не ЗначениеЗаполнено(ДанныеКурьера.ИдентификаторTMS) Тогда
		ПараметрыЗапроса.Вставить("cr_email", ДанныеКурьера.Email);
		ПараметрыЗапроса.Вставить("cr_dphone", Телефон);
		ПараметрыЗапроса.Вставить("parent_company", ДанныеКурьера.ГоловнаяОрганизация);
	КонецЕсли;
	СерияНомер =ДанныеКурьера.СерияПаспорта+ " "+ ДанныеКурьера.НомерПаспорта;
	ПараметрыЗапроса.Вставить("cr_pass_sn", СерияНомер);
	ПараметрыЗапроса.Вставить("cr_pass_kod", ДанныеКурьера.КодПодразделения);
	ПараметрыЗапроса.Вставить("fact_addr", ФактичАдрес);            //фактический адрес
	ПараметрыЗапроса.Вставить("pass_addr", АдресПоПрописке);   //адрес по прописке
	ПараметрыЗапроса.Вставить("cr_birthday", Формат(ДанныеКурьера.ДатаРождения,"ДЛФ=Д"));
	ПараметрыЗапроса.Вставить("cr_pass_date ", Формат(ДанныеКурьера.ДатаВыдачи,"ДЛФ=Д"));//Дата Выдачи паспрота
	ПараметрыЗапроса.Вставить("cr_pass_kem ", ДанныеКурьера.КемВыдан);   //адрес по прописке
	ПараметрыЗапроса.Вставить("default_hub_id", ХабИД);
	КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина, 
    ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудник), 
    "ДатаУвольнения", ТекущаяДата());
	Если КадровыеДанныеСотрудников[0].ДатаУвольнения = Дата(1,1,1) и ОбменСTMS=Истина Тогда
		ПараметрыЗапроса.Вставить("cr_status", 1);
	Иначе
		ПараметрыЗапроса.Вставить("cr_status", 0);
	КонецЕсли;
	ПараметрыЗапроса.Вставить("is_self_employed", ?(ДанныеКурьера.Логс_Самозанятый и НЕ ДанныеКурьера.Логс_КурьерИП, 1,0));
	ПараметрыЗапроса.Вставить("is_sole_proprietor", ?(ДанныеКурьера.Логс_КурьерИП, 1,0));
	//++ Ким Виктор 01.08.2024
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-14058
	ПараметрыЗапроса.Вставить("is_self_employed_non_resident", ?(ДанныеКурьера.Логс_СамозанятыйНерезидент, 1, 0));
	ПараметрыЗапроса.Вставить("cr_pass_country", ДанныеКурьера.СтранаВыдачи);
	//-- Ким Виктор 01.08.2024
		
	
	ТипКурьераСтрокой = НРег(ДанныеКурьера.ТипКурьера);
	//++ Ким Виктор 18.07.2024
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-13912
	
	// Соответствия типов курьеров.
	//// Авто
	//const CRTYPE_AUTO = 1;
	//// Пеший
	//const CRTYPE_PEDESTRIAN = 2;
	//// Грузовой
	//const CRTYPE_CARGO = 3;
	//// Пятитонник
	//const CRTYPE_FIVE_TON = 4;
	//// Наемник
	//const CRTYPE_HIRE = 5;
	//// Субагент
	//const CRTYPE_FASTZILLA = 6;
	//// Стадол
	//const CRTYPE_STADOL = 7;
	//// Стажер
	//const CRTYPE_STAGER = 8;
	//// ПВЗ
	//const CRTYPE_PVZ = 9;
	//// ПВЗ - Авито
	//const CRTYPE_PVZ_AVITO = 10;

	Если ТипКурьераСтрокой = "авто" Тогда
		ТипКурьера = 1;
	ИначеЕсли ТипКурьераСтрокой = "пеший" Тогда
		ТипКурьера = 2;
	ИначеЕсли ТипКурьераСтрокой = "грузовой" Тогда
		ТипКурьера = 3;
	ИначеЕсли ТипКурьераСтрокой = "пятитонник" Тогда
		Типкурьера = 4;
	ИначеЕсли ТипКурьераСтрокой = "наемник" Тогда
		Типкурьера = 5;
	ИначеЕсли ТипКурьераСтрокой = "субагент" Тогда
		Типкурьера = 6;
	ИначеЕсли ТипКурьераСтрокой = "стадол" Тогда
		Типкурьера = 7;
	ИначеЕсли ТипКурьераСтрокой = "стажер" Тогда
		ТипКурьера = 8;
	ИначеЕсли ТипКурьераСтрокой = "пвз" Тогда
		ТипКурьера = 9;
	ИначеЕсли ТипКурьераСтрокой = "пвз - авито" Тогда
		ТипКурьера = 10;
	Иначе                     
		ТипКурьера = 0;
	КонецЕсли; 

	//-- Ким Виктор 18.07.2024
	
	ПараметрыЗапроса.Вставить("cr_type", ТипКурьера);
	
	РезультатВыполнения = Неопределено;
	ИнформацияОбОшибкеПоследняя = "";
	
	//Возврат;
	
	////брутфорс валидного юзернейма
	Для К = 1 по СтрДлина(ФИОФизическогоЛица.Фамилия) Цикл
		ИмяПользователя = НРег(Лев(ФИОФизическогоЛица.Фамилия, К) + "." + ФИОФизическогоЛица.Имя);
		ИмяПользователя = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(ИмяПользователя);
		
		Если Не ЗначениеЗаполнено(ДанныеКурьера.ИдентификаторTMS) Тогда
			ПараметрыЗапроса.Вставить("update", 0);
			ПараметрыЗапроса.Вставить("userName", ИмяПользователя);
			ПараметрыЗапроса.Вставить("password", "lk" + ИмяПользователя);
		Иначе
			ПараметрыЗапроса.Вставить("update", 1);
			ПараметрыЗапроса.Вставить("courier_id", ДанныеКурьера.ИдентификаторTMS);
		КонецЕсли; 
	
	//	Попытка
			Ответ = ЗапросКСерверуTMS("drivers", ПараметрыЗапроса);
			
			Результат = Ответ.response;
			Если ТипЗнч(Результат) = Тип("Массив") Тогда
				Результат = Результат[0];
			КонецЕсли; 
			
			Если Результат.Свойство("courier_id") Тогда
				СвойствоИдентификатор = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоИдентификаторКурьераTMS();
				
				СотрудникОбъект = Сотрудник.ПолучитьОбъект();
				//Справочники.Сотрудники.ПолучитьСсылку(
				
				СтрокаРеквизита = СотрудникОбъект.ДополнительныеРеквизиты.Найти(СвойствоИдентификатор, "Свойство");
				Если СтрокаРеквизита = Неопределено Тогда
					СтрокаРеквизита = СотрудникОбъект.ДополнительныеРеквизиты.Добавить();
					СтрокаРеквизита.Свойство = СвойствоИдентификатор;
				КонецЕсли; 
				СтрокаРеквизита.Значение = Формат(Результат.courier_id, "ЧГ=");
				СтрокаРеквизита.ТекстоваяСтрока = Строка(СтрокаРеквизита.Значение);
				
				СотрудникОбъект.ОбменДанными.Загрузка = Истина;
				
				Записано = Ложь;
				Для Ы = 1 по 10 Цикл
					Попытка
						СотрудникОбъект.Записать();
						Записано = Истина;
						Прервать
					Исключение  
						Описание = ОписаниеОшибки();
						//ОбщегоНазначенияБТС.Пауза(10);
						
						//Костыль TODO#
						Если Справочники.Сотрудники.ПолучитьСсылку(Сотрудник.УникальныйИдентификатор()).ВерсияДанных <> СотрудникОбъект.ВерсияДанных  Тогда 
							СотрудникОбъект = Справочники.Сотрудники.НайтиПоКоду(Сотрудник.Код).ПолучитьОбъект();	
						КонецЕсли;
						
					КонецПопытки;
				КонецЦикла;
				Если Записано Тогда
					РезультатВыполнения = Новый Структура("Успешно,Идентификатор",
						Истина, Результат.courier_id);
				Иначе
					РезультатВыполнения = Новый Структура("Успешно,Идентификатор",
						Ложь, Результат.courier_id);				
				КонецЕсли;
					
				Прервать; // прервем цикл брутфорса, если информация обновлена
			ИначеЕсли ЗначениеЗаполнено(ДанныеКурьера.ИдентификаторTMS) Тогда
				ТекстОшибки = ?(Результат.Свойство("Error"),
					Результат.Error,
					НСтр("ru='Неизвестная ошибка'"));
				ТекстСообщения = СтрШаблон(
					НСтр("ru='Произошла ошибка при обновлении данных на сервере TMS: %1'"),
					ТекстОшибки);
					
				РезультатВыполнения = Новый Структура("Успешно,ТекстОшибки", Ложь, ТекстСообщения);
					
				ЗаписьЖурналаРегистрации(
					"Обмен с TMS. Оповещение о создании курьера",
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.Сотрудники,
					Сотрудник,
					ТекстСообщения);
					
				Прервать; // прервем цикл брутфорса, если запрос упал, и есть ИД курьера
			КонецЕсли; 
		//Исключение
		//	ИнформацияОбОшибкеПоследняя = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		//КонецПопытки;
	КонецЦикла;
	
	Если РезультатВыполнения = Неопределено Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru='Произошла ошибка при обновлении данных на сервере TMS: %1'"), ИнформацияОбОшибкеПоследняя);
			
			РезультатВыполнения = Новый Структура("Успешно,ТекстОшибки",
				Ложь, ТекстСообщения);
				
			ЗаписьЖурналаРегистрации(
				"Обмен с TMS. Оповещение о создании курьера",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.Сотрудники,
				Сотрудник,
				ТекстСообщения);
	КонецЕсли;

	АдресХранилища=ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
КонецПроцедуры

Процедура ОповеститьTMSСозданииКурьераСамозанятого(Договор, АдресХранилища) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать * из Справочник.ДоговорыКонтрагентов как спр где спр.Ссылка = &Договор";
	Запрос.УстановитьПараметр("Договор", Договор);
	ДанныеДоговора = Запрос.Выполнить().Выбрать();
	ДанныеДоговора.Следующий();
	
	ОбменСCRM = ДанныеДоговора.Логс_ОбменСCRM и (ДанныеДоговора.Логс_ВидКлиентаCRM = Перечисления.Логс_ВидыКлиентовCRM.СамозанятыйКурьер);
	
	Если ОбменСCRM <> Истина Тогда
			
		РезультатВыполнения = Новый Структура("Успешно,ТекстОшибки", Ложь,
			СтрШаблон(НСтр("ru='Сотрудник %1 не используется в обмене с CRM'"), ДанныеДоговора.Контрагент));
			
		ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
		
		Возврат;
		
	КонецЕсли; 
	
	ДанныеКурьера = ПолучитьДанныеСамозанятогоКурьера(Договор);
	КонтактнаяИнформация = ДанныеКурьера.Контрагент.КонтактнаяИнформация;
	Для каждого Строка из КонтактнаяИнформация Цикл
		Если Строка.Вид.Наименование = "Адрес по прописке" Тогда
		 АдресПоПрописке = Строка.Представление;	
		ИначеЕсли Строка.Вид.Наименование = "Адрес места проживания" Тогда
		 ФактичАдрес = Строка.Представление;	
		КонецЕсли;
	КонецЦикла;	
	
	ХабКурьера = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ПолучитьХабСотрудника(Договор); 
	ХабИД = ХабКурьера.ИД;
	
	ФИОФизическогоЛица = ФизическиеЛицаУТ.ФамилияИмяОтчество(ДанныеКурьера.ФИО);
	ФамилияИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИОФизическогоЛица);
	
	ФИОКоротко = "" + СокрЛП(ФИОФизическогоЛица.Фамилия) + " " + СокрЛП(ФИОФизическогоЛица.Имя);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("key", "NEEDKEY");
	
	Телефон = "";
	Для Сч = 1 По СтрДлина(ДанныеКурьера.Телефон) Цикл
		ТекСимвол = Сред(ДанныеКурьера.Телефон, Сч, 1);
		Если ТекСимвол >= "0" И ТекСимвол <= "9" Тогда
			Телефон = Телефон + ТекСимвол;
		КонецЕсли; 
	КонецЦикла;
	
	ПараметрыЗапроса.Вставить("cr_fullname", ДанныеКурьера.ФИО);
	ПараметрыЗапроса.Вставить("cr_shortname", ФИОКоротко);
	Если Не ЗначениеЗаполнено(ДанныеКурьера.ИдентификаторCRM) Тогда
		ПараметрыЗапроса.Вставить("cr_email", ДанныеКурьера.Email);
		ПараметрыЗапроса.Вставить("cr_dphone", Телефон);
		ПараметрыЗапроса.Вставить("parent_company", ДанныеКурьера.ГоловнаяОрганизация);
		
	КонецЕсли;
	СерияНомер =ДанныеКурьера.СерияПаспорта+ " "+ ДанныеКурьера.НомерПаспорта;
	ПараметрыЗапроса.Вставить("cr_pass_sn", СерияНомер);
	ПараметрыЗапроса.Вставить("cr_pass_kod", ДанныеКурьера.КодПодразделения);
	ПараметрыЗапроса.Вставить("fact_addr", ФактичАдрес);            //фактический адрес
	ПараметрыЗапроса.Вставить("pass_addr", АдресПоПрописке);   //адрес по прописке
	ПараметрыЗапроса.Вставить("cr_birthday", Формат(ДанныеКурьера.ДатаРождения,"ДЛФ=Д"));
	ПараметрыЗапроса.Вставить("cr_pass_date ", Формат(ДанныеКурьера.ДатаВыдачи,"ДЛФ=Д"));//Дата Выдачи паспрота
	ПараметрыЗапроса.Вставить("cr_pass_kem ", ДанныеКурьера.КемВыдан);   //адрес по прописке
	ПараметрыЗапроса.Вставить("default_hub_id", ХабИД);
	ПараметрыЗапроса.Вставить("cr_status", ДанныеКурьера.Статус);
	
	
	ТипКурьераСтрокой = НРег(ДанныеКурьера.ТипКурьера);
	Если ТипКурьераСтрокой = "авто" Тогда
		ТипКурьера = 1;
	ИначеЕсли ТипКурьераСтрокой = "пеший" Тогда
		ТипКурьера = 2;
	ИначеЕсли ТипКурьераСтрокой = "грузовой" Тогда
		ТипКурьера = 3;
	ИначеЕсли ТипКурьераСтрокой = "стажер" Тогда
		ТипКурьера = 4;
	Иначе
		ТипКурьера = 0;
	КонецЕсли; 
	
	ПараметрыЗапроса.Вставить("cr_type", ТипКурьера);
	
	Возврат;
	
	РезультатВыполнения = Неопределено;
	ИнформацияОбОшибкеПоследняя = "";
	////брутфорс валидного юзернейма
	Для К = 1 по СтрДлина(ФИОФизическогоЛица.Фамилия) Цикл
		ИмяПользователя = НРег(Лев(ФИОФизическогоЛица.Фамилия, К) + "." + ФИОФизическогоЛица.Имя);
		ИмяПользователя = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(ИмяПользователя);
		
		Если Не ЗначениеЗаполнено(ДанныеКурьера.ИдентификаторCRM) Тогда
			ПараметрыЗапроса.Вставить("update", 0);
			ПараметрыЗапроса.Вставить("userName", ИмяПользователя);
			ПараметрыЗапроса.Вставить("password", "lk" + ИмяПользователя);
		Иначе
			ПараметрыЗапроса.Вставить("update", 1);
			ПараметрыЗапроса.Вставить("courier_id", ДанныеКурьера.ИдентификаторCRM);
		КонецЕсли; 
		
		Возврат;
	
		Попытка
			//Ответ = ЗапросКСерверуCRM("1ccourieradd", ПараметрыЗапроса);
			Ответ = ЗапросКСерверуTMS("drivers", ПараметрыЗапроса);
			
			Результат = Ответ.response;
			Если ТипЗнч(Результат) = Тип("Массив") Тогда
				Результат = Результат[0];
			КонецЕсли; 
			
			Если Результат.Свойство("courier_id") Тогда
				
				//ДоговорОбъект = Договор.ПолучитьОбъект();
				//ДоговорОбъект.Логс_ИдентификаторCRM = Результат.courier_id;
				//ДоговорОбъект.ОбменДанными.Загрузка = Истина;
				//ДоговорОбъект.Записать();
				СтруктураЗаписи = РегистрыСведений.Логс_ПараметрыИнтеграционныхСистем.ПолучитьСтруктуруЗаписи();
				СтруктураЗаписи.Система 	= Справочники.Логс_ВнешниеСистемы.TMS;
				СтруктураЗаписи.Сотрудник 	= Договор.ссылка;
				СтруктураЗаписи.ОбменСTMS 	= Истина;
				СтруктураЗаписи.ИдКурьера   = Результат.courier_id;
				СтруктураЗаписи.ХабКурьера  = ХабКурьера;
				//СтруктураЗаписи.ДатаОбновления = ТекущаяДата();
				РегистрыСведений.Логс_ПараметрыИнтеграционныхСистем.ЗаписатьОбновитьДанныеВРегистр(СтруктураЗаписи);
				
				РезультатВыполнения = Новый Структура("Успешно,Идентификатор",
					Истина, Результат.courier_id);
					
				Прервать; // прервем цикл брутфорса, если информация обновлена
			ИначеЕсли ЗначениеЗаполнено(ДанныеКурьера.ИдентификаторCRM) Тогда
				ТекстОшибки = ?(Результат.Свойство("Error"),
					Результат.Error,
					НСтр("ru='Неизвестная ошибка'"));
				ТекстСообщения = СтрШаблон(
					НСтр("ru='Произошла ошибка при обновлении данных на сервере TMS: %1'"),
					ТекстОшибки);
					
				РезультатВыполнения = Новый Структура("Успешно,ТекстОшибки", Ложь, ТекстСообщения);
					
				ЗаписьЖурналаРегистрации(
					"Обмен с TMS. Оповещение о создании курьера",
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.ДоговорыКонтрагентов,
					Договор,
					ТекстСообщения);
					
				Прервать; // прервем цикл брутфорса, если запрос упал, и есть ИД курьера
			КонецЕсли; 
		Исключение
			ИнформацияОбОшибкеПоследняя = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЦикла;
	
	Если РезультатВыполнения = Неопределено Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru='Произошла ошибка при обновлении данных на сервере TMS: %1'"), ИнформацияОбОшибкеПоследняя);
			
			РезультатВыполнения = Новый Структура("Успешно,ТекстОшибки",
				Ложь, ТекстСообщения);
				
			ЗаписьЖурналаРегистрации(
				"Обмен с TMS. Оповещение о создании курьера",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.ДоговорыКонтрагентов,
				Договор,
				ТекстСообщения);
	КонецЕсли;

	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
КонецПроцедуры

Процедура ОповеститьTMSСозданииДоговора(Договор, Сотрудник, ИдСотрудника, ИдДоговора, АдресХранилища) Экспорт 
	
//{
//    "key": "{{1c_token}}",
//    "courier_id": 1234,
//    "contract_number": "0100-0759", // номер договора
//    "contract_date": "10.12.2024", // дата подписания договора
//    "contract_activation_date": "10.12.2024", // дата начала действия договора
//    "contract_expiry_date": "10.12.2024", // дата окончания действия договора
//    "update": "0"
//}
   	ПараметрыЗапроса = Новый Структура;
	//Ключ дев разработки
	ПараметрыЗапроса.Вставить("key", "NEEDKEY"); //
	ПараметрыЗапроса.Вставить("courier_id", ИдСотрудника);
	ПараметрыЗапроса.Вставить("contract_number", 		  Договор.Номер);
	ПараметрыЗапроса.Вставить("contract_date", 			  Формат(Договор.Дата, "ДЛФ=Д"));
	ПараметрыЗапроса.Вставить("contract_activation_date", Формат(Договор.ДатаНачалаДействия, "ДЛФ=Д"));
	ПараметрыЗапроса.Вставить("contract_expiry_date", 	  Формат(Договор.ДатаОкончанияДействия, "ДЛФ=Д"));
	ПараметрыЗапроса.Вставить("status", 	    		  Строка(Договор.Статус));
	
	// update - 0 создание
	// update - 1 обновление
	Если ЗначениеЗаполнено(ИдДоговора) Тогда 
		ПараметрыЗапроса.Вставить("update", "1"); 
		ПараметрыЗапроса.Вставить("contract_id", ИдДоговора);
	Иначе
		ПараметрыЗапроса.Вставить("update", "0");
	КонецЕсли;
		
	РезультатВыполнения = Неопределено;
	ИнформацияОбОшибкеПоследняя = "";
	СчетчикОтправкиПовторно = 0;  
		
	Ответ = ЗапросКСерверуTMS("driver-contracts", ПараметрыЗапроса);
	
	Если Ответ.Свойство("успешно") И Ответ.успешно = Ложь И Ответ.Свойство("ТекстСообщения")
		И СтрНайти(Ответ.Текстсообщения, "300") > 0 Тогда 
		
		ИнформацияОбОшибкеПоследняя = Ответ.Текстсообщения;
		СчетчикОтправкиПовторно = СчетчикОтправкиПовторно + 1;
		
		Если СчетчикОтправкиПовторно > 1 Тогда
			
		КонецЕсли;
		
	КонецЕсли;   
	
	Результат = Новый Структура;
	Если Ответ.Свойство("response") Тогда 
		Результат = Ответ.response;
		Если ТипЗнч(Результат) = Тип("Массив") Тогда
			Результат = Результат[0];
		КонецЕсли; 
	КонецЕсли;
	
	Если Результат.Свойство("contract_id") Тогда     
		
		НаборЗаписей = РегистрыСведений.Логс_ПараметрыИнтеграционныхСистем.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Система.Установить(Справочники.Логс_ВнешниеСистемы.TMS);
		НаборЗаписей.Отбор.Сотрудник.Установить(Сотрудник);
		НаборЗаписей.Отбор.ДоговорСотрудника.Установить(Договор);
		
		НаборЗаписей.Прочитать();
		Записывать = Ложь;
		Если НаборЗаписей.Количество() Тогда 
			
			ЗаписьТек = НаборЗаписей[0];
			Контракт_ИД = СтрЗаменить(Результат.contract_id, Символы.НПП, "");
			Если ЗаписьТек.ИдДоговора <> Контракт_ИД Тогда 
				ЗаписьТек.ИдДоговора = Контракт_ИД;
				ЗаписьТек.ДатаОбновления = ТекущаяДата();
				Записывать = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
		Если Записывать Тогда 
			НаборЗаписей.Записать();	
		КонецЕсли;
		
		РезультатВыполнения = Новый Структура("Успешно,Идентификатор",
		Истина, Результат.courier_id);
	//ИначеЕсли ЗначениеЗаполнено(ДанныеКурьера.ИдентификаторTMS) Тогда
	ИначеЕсли ЗначениеЗаполнено(ИдДоговора) Тогда 
	
		ТекстОшибки = ?(Результат.Свойство("Error"),
		Результат.Error,
		НСтр("ru='Неизвестная ошибка'"));
		ТекстСообщения = СтрШаблон(
		НСтр("ru='Произошла ошибка при обновлении данных на сервере TMS: %1'"),
		ТекстОшибки);
		
		РезультатВыполнения = Новый Структура("Успешно,ТекстОшибки", Ложь, ТекстСообщения);
		
		ЗаписьЖурналаРегистрации(
		"Обмен с TMS. Оповещение о создании курьера",
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.Справочники.ДоговорыКонтрагентов,
		Договор,
		ТекстСообщения);
		
	КонецЕсли; 
	//Исключение
	//	ИнформацияОбОшибкеПоследняя = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
	//КонецПопытки;
	//КонецЦикла;
	
	Если РезультатВыполнения = Неопределено Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru='Произошла ошибка при обновлении данных на сервере TMS: %1'"), ИнформацияОбОшибкеПоследняя);
		
		РезультатВыполнения = Новый Структура("Успешно,ТекстОшибки",
		Ложь, ТекстСообщения);
		
		ЗаписьЖурналаРегистрации(
		"Обмен с TMS. Оповещение о создании договора",
		УровеньЖурналаРегистрации.Ошибка,
		Метаданные.Справочники.ДоговорыКонтрагентов,
		Договор,
		ТекстСообщения);
	КонецЕсли;
	
	АдресХранилища=ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);

КонецПроцедуры

Функция ПолучитьДанныеСамозанятогоКурьера(Договор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Ссылка КАК Ссылка,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Представление КАК Представление
	|ПОМЕСТИТЬ ВТ_КонтактнаяИнформация
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО КонтактнаяИнформация.Ссылка = Договоры.Контрагент
	|ГДЕ
	|	Договоры.Ссылка = &Договор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДоговора.Ссылка КАК Договор,
	|	ДанныеДоговора.Контрагент КАК Контрагент,
	|	ДанныеДоговора.Контрагент.Наименование КАК ФИО,
	|	ДанныеДоговора.Организация КАК ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА ДанныеДоговора.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Статус,
	|	ДанныеДоговора.Логс_ИдентификаторCRM КАК ИдентификаторCRM,
	|	ДанныеДоговора.Логс_ТипКурьера КАК ТипКурьера,
	|	ЕСТЬNULL(КонтактнаяИнформацияТелефон.Представление, """") КАК Телефон,
	|	ЕСТЬNULL(КонтактнаяИнформацияEmail.Представление, """") КАК Email,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Серия, """") КАК СерияПаспорта,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Номер, """") КАК НомерПаспорта,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.КодПодразделения, """") КАК КодПодразделения,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.КемВыдан, """") КАК КемВыдан,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.ДатаВыдачи, """") КАК ДатаВыдачи,
	|	ЕСТЬNULL(ДанныеДоговора.Партнер.ДатаРождения, """") КАК ДатаРождения
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформация КАК КонтактнаяИнформацияТелефон
	|		ПО ДанныеДоговора.Контрагент = КонтактнаяИнформацияТелефон.Ссылка
	|			И (КонтактнаяИнформацияТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформация КАК КонтактнаяИнформацияEmail
	|		ПО ДанныеДоговора.Контрагент = КонтактнаяИнформацияEmail.Ссылка
	|			И (КонтактнаяИнформацияEmail.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛиц
	|		ПО ДанныеДоговора.Контрагент = ДокументыФизическихЛиц.Физлицо
	|			И (ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ))
	|ГДЕ
	|	ДанныеДоговора.Ссылка = &Договор";

	Запрос.УстановитьПараметр("Ссылка", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции 

Функция ПолучитьДанныеКурьера(Сотрудник)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.Логс_Самозанятый КАК Логс_Самозанятый,
	|	Сотрудники.Логс_КурьерИП КАК Логс_КурьерИП,
	|	ЕСТЬNULL(ДопРеквизитыОрганизации.Значение, """") КАК ГоловнаяОрганизация,
	|	ФизическиеЛица.ФИО КАК ФИО,
	|	ВЫБОР
	|		КОГДА Сотрудники.ВАрхиве
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Статус,
	|	Сотрудники.Логс_СамозанятыйНерезидент КАК Логс_СамозанятыйНерезидент
	|ПОМЕСТИТЬ ДанныеСотрудника
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО Сотрудники.ФизическоеЛицо = ФизическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.ДополнительныеРеквизиты КАК ДопРеквизитыОрганизации
	|		ПО Сотрудники.ГоловнаяОрганизация = ДопРеквизитыОрганизации.Ссылка
	|			И (ДопРеквизитыОрганизации.Свойство = &СвойствоИдентификаторОрганизации)
	|ГДЕ
	|	Сотрудники.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Ссылка КАК Ссылка,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Представление КАК Представление
	|ПОМЕСТИТЬ КонтактнаяИнформация
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеСотрудника.ФизическоеЛицо
	|			ИЗ
	|				ДанныеСотрудника)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиДополнительныеРеквизиты.Ссылка КАК Ссылка,
	|	СотрудникиДополнительныеРеквизиты.Свойство КАК Свойство,
	|	СотрудникиДополнительныеРеквизиты.Значение КАК Значение
	|ПОМЕСТИТЬ ДополнительныеРеквизиты
	|ИЗ
	|	Справочник.Сотрудники.ДополнительныеРеквизиты КАК СотрудникиДополнительныеРеквизиты
	|ГДЕ
	|	СотрудникиДополнительныеРеквизиты.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСотрудника.Ссылка КАК Ссылка,
	|	ДанныеСотрудника.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ДанныеСотрудника.Логс_Самозанятый КАК Логс_Самозанятый,
	|	ДанныеСотрудника.Логс_КурьерИП КАК Логс_КурьерИП,
	|	ДанныеСотрудника.ФИО КАК ФИО,
	|	ДанныеСотрудника.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ЕСТЬNULL(КонтактнаяИнформацияТелефон.Представление, """") КАК Телефон,
	|	ЕСТЬNULL(КонтактнаяИнформацияEmail.Представление, """") КАК Email,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Серия, """") КАК СерияПаспорта,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Номер, """") КАК НомерПаспорта,
	|	ДанныеСотрудника.Статус КАК Статус,
	|	ЕСТЬNULL(ДополнительныеРеквизитыТипКурьера.Значение, """") КАК ТипКурьера,
	|	ЕСТЬNULL(ДополнительныеРеквизитыИдентификаторTMS.Значение, """") КАК ИдентификаторTMS,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.КодПодразделения, """") КАК КодПодразделения,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.КемВыдан, """") КАК КемВыдан,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.ДатаВыдачи, """") КАК ДатаВыдачи,
	|	ЕСТЬNULL(ДанныеСотрудника.ФизическоеЛицо.ДатаРождения, """") КАК ДатаРождения,
	//++ Ким Виктор 30.07.2024
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-14058
	|	ЕСТЬNULL(ДокументыФизическихЛиц.СтранаВыдачи, """") КАК СтранаВыдачи,
	|	ДанныеСотрудника.Логс_СамозанятыйНерезидент КАК Логс_СамозанятыйНерезидент
	//-- Ким Виктор 30.07.2024
	|ИЗ
	|	ДанныеСотрудника КАК ДанныеСотрудника
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтактнаяИнформация КАК КонтактнаяИнформацияТелефон
	|		ПО ДанныеСотрудника.ФизическоеЛицо = КонтактнаяИнформацияТелефон.Ссылка
	|			И (КонтактнаяИнформацияТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтактнаяИнформация КАК КонтактнаяИнформацияEmail
	|		ПО ДанныеСотрудника.ФизическоеЛицо = КонтактнаяИнформацияEmail.Ссылка
	|			И (КонтактнаяИнформацияEmail.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛиц
	|		ПО ДанныеСотрудника.ФизическоеЛицо = ДокументыФизическихЛиц.Физлицо
	|			И (ДокументыФизическихЛиц.ВидДокумента В (ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ), ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ИностранныйПаспорт), ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВидНаЖительство)))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДополнительныеРеквизиты КАК ДополнительныеРеквизитыТипКурьера
	|		ПО ДанныеСотрудника.Ссылка = ДополнительныеРеквизитыТипКурьера.Ссылка
	|			И (ДополнительныеРеквизитыТипКурьера.Свойство = &СвойствоТипКурьера)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДополнительныеРеквизиты КАК ДополнительныеРеквизитыИдентификаторTMS
	|		ПО ДанныеСотрудника.Ссылка = ДополнительныеРеквизитыИдентификаторTMS.Ссылка
	|			И (ДополнительныеРеквизитыИдентификаторTMS.Свойство = &СвойствоИдентификаторTMS)");

	Запрос.УстановитьПараметр("Ссылка", Сотрудник);
	Запрос.УстановитьПараметр("СвойствоТипКурьера", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоСотрудникиТипКурьера());
	Запрос.УстановитьПараметр("СвойствоИдентификаторTMS", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоИдентификаторКурьераTMS());
	Запрос.УстановитьПараметр("СвойствоИдентификаторОрганизации", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоИдентификаторОрганизацииCRM());
	
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции     


Функция ЗапросКСерверуTMS(ИмяМетода, ПараметрыЗапроса) Экспорт
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	//Тестовый URL;
	Возврат ЗапросКСерверу("api-tms-dev.logsis.ru", "api/v1/1c/" + ИмяМетода, ПараметрыЗапроса, Заголовки);
	
						   
КонецФункции                      

Функция ЗапросКСерверу(АдресСервера, АдресРесурса, ПараметрыЗапроса, Заголовки = Неопределено) Экспорт
	
	//Соединение = Новый HTTPСоединение(АдресСервера);
	Соединение = Новый HTTPСоединение(АдресСервера,,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	СтрокаПараметров = СтруктураВПараметрыЗапроса(ПараметрыЗапроса);
	
	Запрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	Запрос.УстановитьТелоИзСтроки(СтрокаПараметров);
	
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru='При обращении к серверу %1 произошла ошибка %2'"), АдресСервера, Ответ.КодСостояния);
			
		ТекстОшибки = "";
		Попытка
			ТекстОшибки = Ответ.response.Error;
		Исключение
		КонецПопытки;
		СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();
		
		Если ТекстОшибки = "" Тогда
			ТекстОшибки = ПолучитьТекстОшибкиИзJSON(СтрокаОтвета) + Символы.ПС + СтрокаОтвета; 
		КонецЕсли;
	
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ТекстСообщения = ТекстСообщения + ": " + ТекстОшибки;
		КонецЕсли; 
		
		ВызватьИсключение ТекстСообщения;
	КонецЕсли; 
	
	Поток = Ответ.ПолучитьТелоКакПоток();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(Поток);
	
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ТипРезультата = Тип(Результат);
	
	ЧтениеJSON.Закрыть();
	Поток.Закрыть();
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураВПараметрыЗапроса(Структура)
	
	ПараметрыЗапроса = "";
	
	Для каждого Параметр Из Структура Цикл
		ПараметрыЗапроса = ПараметрыЗапроса + Параметр.Ключ + "=" + Формат(Параметр.Значение, "ЧН=0; ЧГ=") + "&";
	КонецЦикла;
	
	Если ПараметрыЗапроса <> "" Тогда
		ПараметрыЗапроса = Лев(ПараметрыЗапроса, СтрДлина(ПараметрыЗапроса) - 1);
	КонецЕсли; 
	
	Возврат ПараметрыЗапроса;
		
КонецФункции 

Функция ПолучитьТекстОшибкиИзJSON(СтрокаJSON)
	ТекстОшибки = "";
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Маркер = Ложь;
	Пока ЧтениеJSON.Прочитать() Цикл
		
		Попытка
			Если Маркер Тогда
				ТекстОшибки = ТекстОшибки + ЧтениеJSON.ТекущееЗначение + Символы.ПС;
				Маркер = Ложь;
			ИначеЕсли ВРег(ЧтениеJSON.ТекущееЗначение) = "ERROR" или ВРег(ЧтениеJSON.ТекущееЗначение) = "MESSAGE" Тогда
				Маркер = Истина;
			КонецЕсли;
		Исключение            
		КонецПопытки    
	КонецЦикла;

	
	Возврат СокрЛП(ТекстОшибки)
КонецФункции


