#Область ПрограммныйИнтерфейс

Функция ФормаОплатыУслугАгенту(Договор, Регион, Период = Неопределено) Экспорт
	
	Возврат РегистрыСведений.Логс_ИсторияФормыОплатыДоговоров.ДействующееЗначениеФормыОплаты(Договор, ?(Период = Неопределено, ТекущаяДата(), Период));
	
КонецФункции 

Функция ПериодФормированияСводов(Договор, Регион) Экспорт
	
	Возврат ЗначениеРегиональногоРеквизита(Договор, Регион, "Логс_ПериодФормированияСводовАгента");
	
КонецФункции 

Функция СрокВыставленияСчетаЗаУслугиАгента(Договор, Регион) Экспорт
	
	Возврат ЗначениеРегиональногоРеквизита(Договор, Регион, "Логс_СрокВыставленияСчетаЗаУслугиАгента");
	
КонецФункции 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция ЗначениеРегиональногоРеквизита(Договор, Регион, ИмяРеквизита) Экспорт
	
	ИмяРеквизитаРег = ?(Регион, ИмяРеквизита + "Рег", ИмяРеквизита);
	
	Если ТипЗнч(Договор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, ИмяРеквизитаРег);
	Иначе
		Возврат Договор[ИмяРеквизитаРег];
	КонецЕсли; 
	
КонецФункции 

#КонецОбласти     

//Тест исправления для GIT