#Область ПрограммныйИнтерфейс

#Область HTTPСервис

Функция ПолучитьСписокКлиентов(ИНН, КПП, ВидДоговора, Идентификатор) Экспорт
	
	ТекстУсловияОтбора = "ДоговорыКонтрагентов.Логс_ВидДоговораCRM = &ВидДоговора";
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Если ТекстУсловияОтбора <> "" Тогда
			ТекстУсловияОтбора = ТекстУсловияОтбора + " И ";
		КонецЕсли; 
		ТекстУсловияОтбора = "ДоговорыКонтрагентов.Логс_ИдентификаторCRM = &Идентификатор";
	КонецЕсли; 
	Если ЗначениеЗаполнено(ИНН) Тогда
		Если ТекстУсловияОтбора <> "" Тогда
			ТекстУсловияОтбора = ТекстУсловияОтбора + " И ";
		КонецЕсли; 
		ТекстУсловияОтбора = "Контрагенты.ИНН = &ИНН";
	КонецЕсли; 
	Если ЗначениеЗаполнено(КПП) Тогда
		Если ТекстУсловияОтбора <> "" Тогда
			ТекстУсловияОтбора = ТекстУсловияОтбора + " И ";
		КонецЕсли; 
		ТекстУсловияОтбора = ТекстУсловияОтбора + "Контрагенты.КПП = &КПП";
	КонецЕсли; 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ЕСТЬNULL(Партнеры.Ссылка, ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяСсылка)) КАК Ссылка,
	|	Контрагенты.Наименование КАК Наименование,
	|	Контрагенты.НаименованиеПолное КАК НаименованиеПолное,
	|	Контрагенты.ИНН КАК ИНН,
	|	Контрагенты.КПП КАК КПП,
	|	ДоговорыКонтрагентов.Логс_ИдентификаторCRM КАК Идентификатор,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.Логс_ВидДоговораCRM = ЗНАЧЕНИЕ(Перечисление.Логс_ВидыДоговоровCRM.Агентский)
	|			ТОГДА ""agent""
	|	КОНЕЦ КАК ВидКлиента,
	|	ЕСТЬNULL(Организации.Наименование, """") КАК НаименованиеОрганизации,
	|	ЕСТЬNULL(Организации.ИНН, """") КАК ИННОрганизации
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО ДоговорыКонтрагентов.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК Партнеры
	|		ПО ДоговорыКонтрагентов.Партнер = Партнеры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО ДоговорыКонтрагентов.Организация = Организации.Ссылка
	|ГДЕ
	|	&ТекстУсловияОтбора");
	Запрос.УстановитьПараметр("ИНН", ИНН);
	Запрос.УстановитьПараметр("КПП", КПП);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстУсловияОтбора", ТекстУсловияОтбора);
	
	МассивКлиентов = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОписаниеКлиента = Новый Структура;
		ОписаниеКлиента.Вставить("client_id", Выборка.Идентификатор);
		ОписаниеКлиента.Вставить("uid", Строка(Выборка.Ссылка.УникальныйИдентификатор()));
		ОписаниеКлиента.Вставить("agentName", Выборка.Наименование);
		ОписаниеКлиента.Вставить("agentFullName", Выборка.НаименованиеПолное);
		ОписаниеКлиента.Вставить("inn", Выборка.ИНН);
		ОписаниеКлиента.Вставить("kpp", Выборка.КПП);
		ОписаниеКлиента.Вставить("client_type", Выборка.ВидКлиента);
		ОписаниеКлиента.Вставить("parent_company_name", Выборка.НаименованиеОрганизации);
		ОписаниеКлиента.Вставить("parent_company_inn", Выборка.ИННОрганизации);
		
		МассивКлиентов.Добавить(ОписаниеКлиента);
		
	КонецЦикла; 
	
	Возврат ВебСервисОтвет(200, МассивКлиентов);
	
КонецФункции 

Функция ПолучитьНомераСводовЗаявокНаДоставку(ИдентификаторКлиента = Неопределено, УИДКлиентаСтрока = Неопределено,
			ДатаНачала, ДатаОкончания = Неопределено) Экспорт
	Перем Партнер, Договор;
	
	Если УИДКлиентаСтрока <> Неопределено Тогда
	
		Попытка
			УИДКлиента = Новый УникальныйИдентификатор(УИДКлиентаСтрока);
		Исключение
			Возврат ВебСервисОтвет(400,, НСтр("ru='Передан неверный uid'"));
		КонецПопытки;
	
		Партнер = Справочники.Партнеры.ПолучитьСсылку(УИДКлиента);
		Если Партнер.ПолучитьОбъект() = Неопределено Тогда
			Возврат ВебСервисОтвет(404,, СтрШаблон(НСтр("ru='Не найден агент с uid %1'"), УИДКлиентаСтрока));
		КонецЕсли; 
		
	ИначеЕсли ИдентификаторКлиента <> Неопределено Тогда
		
		Договор = НайтиДоговорАгентаПоИдентификатору(ИдентификаторКлиента);
		Если Договор.Пустая() Тогда
			Возврат ВебСервисОтвет(404,, СтрШаблон(НСтр("ru='Не найден агент с client_id %1'"), ИдентификаторКлиента));
		КонецЕсли; 
		
	КонецЕсли; 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СводЗаявокНаДоставку.Ссылка КАК Ссылка,
	|	СводЗаявокНаДоставку.Номер КАК Номер,
	|	СводЗаявокНаДоставку.Дата КАК Дата,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Логс_ИдентификаторCRM, ""0"") КАК ИдентификаторКлиента,
	|	СводЗаявокНаДоставку.ПолнаяСтоимостьВсего КАК ПолнаяСтоимостьВсего,
	|	СводЗаявокНаДоставку.НаложенныйПлатежВсего КАК НаложенныйПлатежВсего
	|ПОМЕСТИТЬ СводыЗаявок
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку КАК СводЗаявокНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО СводЗаявокНаДоставку.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	&ТекстОтборСводовПоПериоду
	|	И ВЫБОР
	|			КОГДА &ОтборПоПартнеру
	|				ТОГДА СводЗаявокНаДоставку.Партнер = &Партнер
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоДоговору
	|				ТОГДА СводЗаявокНаДоставку.Договор = &Договор
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ СводЗаявокНаДоставку.ПометкаУдаления
	|	И (ЕСТЬNULL(ДоговорыКонтрагентов.Логс_ИдентификаторCRM, ""0"") <> 0  И ЕСТЬNULL(ДоговорыКонтрагентов.Логс_ИдентификаторCRM, ""0"") <> """") 
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СводЗаявокНаДоставкуЗаявки.Ссылка КАК Ссылка,
	|	СводЗаявокНаДоставкуЗаявки.ДатаДоставки КАК ДатаДоставки
	|ПОМЕСТИТЬ Заявки
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку.Заявки КАК СводЗаявокНаДоставкуЗаявки
	|ГДЕ
	|	СводЗаявокНаДоставкуЗаявки.Ссылка В
	|			(ВЫБРАТЬ
	|				СводыЗаявок.Ссылка
	|			ИЗ
	|				СводыЗаявок)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводыЗаявок.Ссылка КАК Ссылка,
	|	СводыЗаявок.Номер КАК Номер,
	|	СводыЗаявок.Дата КАК Дата,
	|	СводыЗаявок.ИдентификаторКлиента КАК ИдентификаторКлиента,
	|	ЕСТЬNULL(Заявки.ДатаДоставки, ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК ДатаДоставки,
	|	СводыЗаявок.ПолнаяСтоимостьВсего КАК ПолнаяСтоимостьВсего,
	|	СводыЗаявок.НаложенныйПлатежВсего КАК НаложенныйПлатежВсего
	|ИЗ
	|	СводыЗаявок КАК СводыЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Заявки КАК Заявки
	|		ПО СводыЗаявок.Ссылка = Заявки.Ссылка
	|ГДЕ
	|	СводыЗаявок.ИдентификаторКлиента <> """"
	|ИТОГИ
	|	МАКСИМУМ(Номер),
	|	МАКСИМУМ(Дата),
	|	МАКСИМУМ(ИдентификаторКлиента),
	|	МАКСИМУМ(ПолнаяСтоимостьВсего),
	|	МАКСИМУМ(НаложенныйПлатежВсего)
	|ПО
	|	Ссылка");
	Запрос.УстановитьПараметр("ОтборПоПартнеру", ЗначениеЗаполнено(Партнер));
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ОтборПоДоговору", ЗначениеЗаполнено(Договор));
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("ДатаНачала", ?(ДатаНачала = Неопределено, '00010101', НачалоДня(ДатаНачала)));
	Запрос.УстановитьПараметр("ДатаОкончания", ?(ДатаОкончания = Неопределено, '00010101', КонецДня(ДатаОкончания)));
	
	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		ТекстОтборСводовПоПериоду = "СводЗаявокНаДоставку.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	ИначеЕсли ЗначениеЗаполнено(ДатаНачала) Тогда
		ТекстОтборСводовПоПериоду = "СводЗаявокНаДоставку.Дата >= &ДатаНачала";
	ИначеЕсли ЗначениеЗаполнено(ДатаОкончания) Тогда
		ТекстОтборСводовПоПериоду = "СводЗаявокНаДоставку.Дата <= &ДатаОкончания";
	Иначе
		ТекстОтборСводовПоПериоду = "ИСТИНА";
	КонецЕсли; 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтборСводовПоПериоду", ТекстОтборСводовПоПериоду);
	
	МассивСводов = Новый Массив;
	
	АдресБазы = Константы.АдресПубликацииИнформационнойБазыВИнтернете.Получить();
	Если Прав(АдресБазы, 1) <> "/" Тогда
		АдресБазы = АдресБазы + "/";
	КонецЕсли; 
	
	ВыборкаСводы = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСводы.Следующий() Цикл
		
		ДанныеСвода = Новый Структура;
		ДанныеСвода.Вставить("client_id", ВыборкаСводы.ИдентификаторКлиента);
		ДанныеСвода.Вставить("order_num", ВыборкаСводы.Номер);
		ДанныеСвода.Вставить("order_total_sum_with_vat", ВыборкаСводы.ПолнаяСтоимостьВсего);
		ДанныеСвода.Вставить("order_total_cod", ВыборкаСводы.НаложенныйПлатежВсего);
		ДанныеСвода.Вставить("order_date", Формат(ВыборкаСводы.Дата, "ДФ=yyyy-MM-dd"));
		ДанныеСвода.Вставить("download_link", АдресБазы +
			"hs/crmexchange/download/agentreports/" +
			Строка(ВыборкаСводы.Ссылка.УникальныйИдентификатор()));
		ДанныеСвода.Вставить("download_report_ext_link", АдресБазы +
			"hs/crmexchange/download/agentreportsext/" +
			Строка(ВыборкаСводы.Ссылка.УникальныйИдентификатор()));
		
		ДатыДоставки = Новый Массив;
		
		Выборка = ВыборкаСводы.Выбрать();
		Пока Выборка.Следующий() Цикл
			ДатыДоставки.Добавить(Формат(Выборка.ДатаДоставки, "ДФ=yyyy-MM-dd"));
		КонецЦикла; 
		
		ДанныеСвода.Вставить("delivery_dates", ДатыДоставки);
		
		МассивСводов.Добавить(ДанныеСвода);
		
	КонецЦикла; 
	
	Возврат ВебСервисОтвет(200, МассивСводов);
	
КонецФункции 

Функция ПолучитьСводыЗаявокНаДоставку(ИдентификаторКлиента = Неопределено, УИДКлиентаСтрока = Неопределено, ДатаНачала, ДатаОкончания = Неопределено) Экспорт
	Перем Партнер, Договор;
	
	Если УИДКлиентаСтрока <> Неопределено Тогда
	
		Попытка
			УИДКлиента = Новый УникальныйИдентификатор(УИДКлиентаСтрока);
		Исключение
			Возврат ВебСервисОтвет(400,, НСтр("ru='Передан неверный uid'"));
		КонецПопытки;
	
		Партнер = Справочники.Партнеры.ПолучитьСсылку(УИДКлиента);
		Если Партнер.ПолучитьОбъект() = Неопределено Тогда
			Возврат ВебСервисОтвет(404,, СтрШаблон(НСтр("ru='Не найден агент с uid %1'"), УИДКлиентаСтрока));
		КонецЕсли; 
		
	ИначеЕсли ИдентификаторКлиента <> Неопределено Тогда
		
		Договор = НайтиДоговорАгентаПоИдентификатору(ИдентификаторКлиента);
		Если Договор.Пустая() Тогда
			Возврат ВебСервисОтвет(404,, СтрШаблон(НСтр("ru='Не найден агент с client_id %1'"), ИдентификаторКлиента));
		КонецЕсли; 
		
	КонецЕсли; 
	
	МассивСводов = Новый Массив;
	
	АдресБазы = Константы.АдресПубликацииИнформационнойБазыВИнтернете.Получить();
	Если Прав(АдресБазы, 1) <> "/" Тогда
		АдресБазы = АдресБазы + "/";
	КонецЕсли; 
	
	СтруктураПоиска = Новый Структура("СводЗаявок");
	
	ДанныеСводов = ПолучитьДанныеСводовЗаявокНаДоставку(Партнер, Договор, ДатаНачала, ДатаОкончания);
	
	ВыборкаСводы    = ДанныеСводов.Своды;
	ВыборкаПлатежки = ДанныеСводов.ПлатежныеПоручения;
	ВыборкаСчета    = ДанныеСводов.СчетаНаОплату;
	
	Пока ВыборкаСводы.Следующий() Цикл
		
		// Основные данные
		
		СуммаУслуг = ?(ВыборкаСводы.ФормаОплаты = Перечисления.Логс_ФормыОплатыУслугАгенту.Оплата100,
						ВыборкаСводы.ПолнаяСтоимость,
						-ВыборкаСводы.КПеречислению);
		СуммаОплачено = ВыборкаСводы.СуммаОплаченныхУслуг;
		
		Если СуммаОплачено > 0 И СуммаУслуг > 0 Тогда
			СтатусУслуг = ?(СуммаОплачено < СуммаУслуг, "Част. оплачен", "Оплачен");
		Иначе	
			СтатусУслуг = "Не оплачен";
		КонецЕсли; 
		
		ДанныеСвода = Новый Структура;
		ДанныеСвода.Вставить("client_id", ВыборкаСводы.ИдентификаторКлиента);
		ДанныеСвода.Вставить("report_num", ВыборкаСводы.Номер);
		ДанныеСвода.Вставить("report_date", Формат(ВыборкаСводы.Дата, "ДФ=yyyy-MM-dd"));
		ДанныеСвода.Вставить("price_client", Формат(ВыборкаСводы.НаложенныйПлатеж, "ЧЦ=15; ЧДЦ=2"));
		ДанныеСвода.Вставить("pd_full", Формат(ВыборкаСводы.ПолнаяСтоимость, "ЧЦ=15; ЧДЦ=2"));
		ДанныеСвода.Вставить("sum2p", Формат(ВыборкаСводы.КПеречислению, "ЧЦ=15; ЧДЦ=2"));
		
		ДанныеСвода.Вставить("f_price_client", Формат(ВыборкаСводы.НаложенныйПлатеж, "ЧРД=.; ЧГ=0"));
		ДанныеСвода.Вставить("f_pd_full", Формат(ВыборкаСводы.ПолнаяСтоимость, "ЧРД=.; ЧГ=0"));
		ДанныеСвода.Вставить("f_sum2p", Формат(ВыборкаСводы.КПеречислению, "ЧРД=.; ЧГ=0"));
		
		ДанныеСвода.Вставить("payment_type",
			?(ВыборкаСводы.ФормаОплаты = Перечисления.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом,
				"without_delivery", "full"
			));
		ДанныеСвода.Вставить("payment_status", СтатусУслуг);
		
		СтруктураПоиска.СводЗаявок = ВыборкаСводы.Ссылка;
		
		// Перечисление НП
		
		ПлатежныеПоручения = Новый Массив;
		
		Если ВыборкаПлатежки.НайтиСледующий(СтруктураПоиска) Тогда
			
			СуммаПеречислено = ВыборкаПлатежки.Сумма;
			
			Выборка = ВыборкаПлатежки.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				ПлатежноеПоручение = Новый Структура;
				ПлатежноеПоручение.Вставить("num", Выборка.Номер);
				ПлатежноеПоручение.Вставить("date", Формат(Выборка.Дата, "ДФ=yyyy-MM-dd"));
				ПлатежноеПоручение.Вставить("sum", Формат(Выборка.Сумма, "ЧЦ=15; ЧДЦ=2"));    
				ПлатежноеПоручение.Вставить("f_sum", Формат(Выборка.Сумма, "ЧРД=.; ЧГ=0"));    
				
				ПлатежныеПоручения.Добавить(ПлатежноеПоручение);
				
			КонецЦикла; 
			
			ВыборкаПлатежки.Сбросить();
		Иначе
			
			СуммаПеречислено = 0;
			
		КонецЕсли; 
		
		СуммаНП = ?(ВыборкаСводы.ФормаОплаты = Перечисления.Логс_ФормыОплатыУслугАгенту.Оплата100,
					ВыборкаСводы.НаложенныйПлатеж,
					ВыборкаСводы.КПеречислению);
		Если СуммаПеречислено > 0 И СуммаНП > 0 Тогда
			СтатусНП = ?(СуммаПеречислено < СуммаНП, "Част. переведен", "Переведен");
		Иначе
			СтатусНП = "Не переведен";
		КонецЕсли; 
		
		ДанныеСвода.Вставить("np_status", СтатусНП);
		ДанныеСвода.Вставить("payment_orders", ПлатежныеПоручения);
		
		// Счета на оплату
		
		Счета = Новый Массив;
		
		Если ВыборкаСчета.НайтиСледующий(СтруктураПоиска) Тогда
			
			Выборка = ВыборкаСчета.Выбрать();
			Пока Выборка.Следующий() Цикл
				
				Счет = Новый Структура;
				Счет.Вставить("num", Выборка.Номер);
				Счет.Вставить("date", Формат(Выборка.Дата, "ДФ=yyyy-MM-dd"));
				Счет.Вставить("download_link", АдресБазы +
					"hs/crmexchange/download/bill/" +
					Строка(Выборка.Ссылка.УникальныйИдентификатор()));
					
				Счета.Добавить(Счет);
				
			КонецЦикла; 
			
		КонецЕсли; 
		
		ДанныеСвода.Вставить("req_for_pay", Счета);
		
		ДанныеСвода.Вставить("download_link", АдресБазы +
			"hs/crmexchange/download/agentreports/" +
			Строка(ВыборкаСводы.Ссылка.УникальныйИдентификатор()));
		ДанныеСвода.Вставить("download_report_ext_link", АдресБазы +
			"hs/crmexchange/download/agentreportsext/" +
			Строка(ВыборкаСводы.Ссылка.УникальныйИдентификатор()));
		
		МассивСводов.Добавить(ДанныеСвода);
		
	КонецЦикла; 
	
	Возврат ВебСервисОтвет(200, МассивСводов);
	
КонецФункции 

Функция ПолучитьДанныеСводовЗаявокНаДоставку(Партнер, Договор, ДатаНачала, ДатаОкончания)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СводЗаявокНаДоставку.Ссылка КАК Ссылка,
	|	СводЗаявокНаДоставку.Номер КАК Номер,
	|	СводЗаявокНаДоставку.Дата КАК Дата,
	|	СводЗаявокНаДоставку.ФормаОплаты КАК ФормаОплаты,
	|	СводЗаявокНаДоставку.НаложенныйПлатежВсего КАК НаложенныйПлатеж,
	|	СводЗаявокНаДоставку.ПолнаяСтоимостьВсего КАК ПолнаяСтоимость,
	|	СводЗаявокНаДоставку.КПеречислениюВсего КАК КПеречислению,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Логс_ИдентификаторCRM, ""0"") КАК ИдентификаторКлиента
	|ПОМЕСТИТЬ СводыЗаявок
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку КАК СводЗаявокНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО СводЗаявокНаДоставку.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	&ТекстОтборСводовПоПериоду
	|	И ВЫБОР
	|			КОГДА &ОтборПоПартнеру
	|				ТОГДА СводЗаявокНаДоставку.Партнер = &Партнер
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоДоговору
	|				ТОГДА СводЗаявокНаДоставку.Договор = &Договор
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И НЕ СводЗаявокНаДоставку.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасчетыПоУслугамЗаДоставку.СводЗаявок КАК СводЗаявок,
	|	СУММА(-РасчетыПоУслугамЗаДоставку.СуммаОборот) КАК Сумма
	|ПОМЕСТИТЬ ОплатаУслуг
	|ИЗ
	|	РегистрНакопления.Логс_РасчетыПоУслугамЗаДоставку.Обороты(
	|			,
	|			,
	|			Регистратор,
	|			СводЗаявок В
	|				(ВЫБРАТЬ
	|					СводыЗаявок.Ссылка
	|				ИЗ
	|					СводыЗаявок)) КАК РасчетыПоУслугамЗаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
	|		ПО РасчетыПоУслугамЗаДоставку.Регистратор = ПоступлениеБезналичныхДенежныхСредств.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РасчетыПоУслугамЗаДоставку.СводЗаявок
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СводЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СводыЗаявок.Ссылка КАК Ссылка,
	|	СводыЗаявок.Номер КАК Номер,
	|	СводыЗаявок.Дата КАК Дата,
	|	СводыЗаявок.ФормаОплаты КАК ФормаОплаты,
	|	СводыЗаявок.НаложенныйПлатеж КАК НаложенныйПлатеж,
	|	СводыЗаявок.ПолнаяСтоимость КАК ПолнаяСтоимость,
	|	СводыЗаявок.КПеречислению КАК КПеречислению,
	|	ЕСТЬNULL(ОплатаУслуг.Сумма, 0) КАК СуммаОплаченныхУслуг,
	|	СводыЗаявок.ИдентификаторКлиента КАК ИдентификаторКлиента
	|ИЗ
	|	СводыЗаявок КАК СводыЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ ОплатаУслуг КАК ОплатаУслуг
	|		ПО СводыЗаявок.Ссылка = ОплатаУслуг.СводЗаявок
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок КАК СводЗаявок,
	|	СписаниеБезналичныхДенежныхСредств.НомерВходящегоДокумента КАК Номер,
	|	СписаниеБезналичныхДенежныхСредств.ДатаВходящегоДокумента КАК Дата,
	|	СУММА(РаспределениеПоСводамЗаявокНаДоставку.Сумма) КАК Сумма
	|ИЗ
	|	Документ.СписаниеБезналичныхДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК РаспределениеПоСводамЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеБезналичныхДенежныхСредств
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.Ссылка = СписаниеБезналичныхДенежныхСредств.Ссылка
	|ГДЕ
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок В
	|			(ВЫБРАТЬ
	|				СводыЗаявок.Ссылка
	|			ИЗ
	|				СводыЗаявок)
	|	И СписаниеБезналичныхДенежныхСредств.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок,
	|	СписаниеБезналичныхДенежныхСредств.НомерВходящегоДокумента,
	|	СписаниеБезналичныхДенежныхСредств.ДатаВходящегоДокумента
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок,
	|	РасходныйКассовыйОрдер.Номер,
	|	РасходныйКассовыйОрдер.Дата,
	|	СУММА(РаспределениеПоСводамЗаявокНаДоставку.Сумма)
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК РаспределениеПоСводамЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.Ссылка = РасходныйКассовыйОрдер.Ссылка
	|ГДЕ
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок В
	|			(ВЫБРАТЬ
	|				СводыЗаявок.Ссылка
	|			ИЗ
	|				СводыЗаявок)
	|	И РасходныйКассовыйОрдер.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок,
	|	РасходныйКассовыйОрдер.Номер,
	|	РасходныйКассовыйОрдер.Дата
	|
	|УПОРЯДОЧИТЬ ПО
	|	СводЗаявок
	|ИТОГИ
	|	СУММА(Сумма)
	|ПО
	|	СводЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СчетНаОплатуКлиентуРаспределениеПоСводам.СводЗаявок КАК СводЗаявок,
	|	СчетНаОплатуКлиентуРаспределениеПоСводам.Ссылка КАК Ссылка,
	|	СчетНаОплатуКлиенту.Дата КАК Дата,
	|	СчетНаОплатуКлиенту.Номер КАК Номер
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК СчетНаОплатуКлиентуРаспределениеПоСводам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
	|		ПО СчетНаОплатуКлиентуРаспределениеПоСводам.Ссылка = СчетНаОплатуКлиенту.Ссылка
	|ГДЕ
	|	СчетНаОплатуКлиентуРаспределениеПоСводам.СводЗаявок В
	|			(ВЫБРАТЬ
	|				СводыЗаявок.Ссылка
	|			ИЗ
	|				СводыЗаявок)
	|	И СчетНаОплатуКлиенту.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	СводЗаявок
	|ИТОГИ ПО
	|	СводЗаявок");
	Запрос.УстановитьПараметр("ОтборПоПартнеру", ЗначениеЗаполнено(Партнер));
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ОтборПоДоговору", ЗначениеЗаполнено(Договор));
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("ДатаНачала", ?(ДатаНачала = Неопределено, '00010101', НачалоДня(ДатаНачала)));
	Запрос.УстановитьПараметр("ДатаОкончания", ?(ДатаОкончания = Неопределено, '00010101', КонецДня(ДатаОкончания)));
	
	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		ТекстОтборСводовПоПериоду = "СводЗаявокНаДоставку.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	ИначеЕсли ЗначениеЗаполнено(ДатаНачала) Тогда
		ТекстОтборСводовПоПериоду = "СводЗаявокНаДоставку.Дата >= &ДатаНачала";
	ИначеЕсли ЗначениеЗаполнено(ДатаОкончания) Тогда
		ТекстОтборСводовПоПериоду = "СводЗаявокНаДоставку.Дата <= &ДатаОкончания";
	Иначе
		ТекстОтборСводовПоПериоду = "ИСТИНА";
	КонецЕсли; 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтборСводовПоПериоду", ТекстОтборСводовПоПериоду);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеСводов = Новый Структура;
	ДанныеСводов.Вставить("Своды", РезультатЗапроса[2].Выбрать());
	ДанныеСводов.Вставить("ПлатежныеПоручения", РезультатЗапроса[3].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	ДанныеСводов.Вставить("СчетаНаОплату", РезультатЗапроса[4].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам));
	
	Возврат ДанныеСводов;
	
КонецФункции 

Функция ПолучитьСчетФактурыАгентов(ИдентификаторКлиента = Неопределено, УИДКлиентаСтрока = Неопределено, ДатаНачала, ДатаОкончания = Неопределено) Экспорт
	Перем Партнер, Договор;
	
	Если УИДКлиентаСтрока <> Неопределено Тогда
	
		Попытка
			УИДКлиента = Новый УникальныйИдентификатор(УИДКлиентаСтрока);
		Исключение
			Возврат ВебСервисОтвет(400,, НСтр("ru='Передан неверный uid'"));
		КонецПопытки;
	
		Партнер = Справочники.Партнеры.ПолучитьСсылку(УИДКлиента);
		Если Партнер.ПолучитьОбъект() = Неопределено Тогда
			Возврат ВебСервисОтвет(404,, СтрШаблон(НСтр("ru='Не найден агент с uid %1'"), УИДКлиентаСтрока));
		КонецЕсли; 
		
	ИначеЕсли ИдентификаторКлиента <> Неопределено Тогда
		
		Договор = НайтиДоговорАгентаПоИдентификатору(ИдентификаторКлиента);
		Если Договор.Пустая() Тогда
			Возврат ВебСервисОтвет(404,, СтрШаблон(НСтр("ru='Не найден агент с client_id %1'"), ИдентификаторКлиента));
		КонецЕсли; 
		
	КонецЕсли; 
	
	АдресБазы = Константы.АдресПубликацииИнформационнойБазыВИнтернете.Получить();
	Если Прав(АдресБазы, 1) <> "/" Тогда
		АдресБазы = АдресБазы + "/";
	КонецЕсли; 
	
	МассивСчетФактур = Новый Массив;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СчетФактура.Ссылка КАК Ссылка,
	|	СчетФактура.Дата КАК Дата,
	|	СчетФактура.Номер КАК Номер
	|ИЗ
	|	Документ.АктВыполненныхРабот КАК СчетФактура
	|ГДЕ
	|	&ТекстОтборПоПериоду
	|	И ВЫБОР
	|			КОГДА &ОтборПоПартнеру
	|				ТОГДА СчетФактура.Партнер = &Партнер
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоДоговору
	|				ТОГДА СчетФактура.Договор = &Договор
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И СчетФактура.Проведен
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СчетФактура.Ссылка,
	|	СчетФактура.Дата,
	|	СчетФактура.Номер
	|ИЗ
	|	Документ.ОтчетКомитенту КАК СчетФактура
	|ГДЕ
	|	&ТекстОтборПоПериоду
	|	И ВЫБОР
	|			КОГДА &ОтборПоПартнеру
	|				ТОГДА СчетФактура.Партнер = &Партнер
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И ВЫБОР
	|			КОГДА &ОтборПоДоговору
	|				ТОГДА СчетФактура.Договор = &Договор
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ
	|	И СчетФактура.Проведен");
	Запрос.УстановитьПараметр("ОтборПоПартнеру", ЗначениеЗаполнено(Партнер));
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ОтборПоДоговору", ЗначениеЗаполнено(Договор));
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("ДатаНачала", ?(ДатаНачала = Неопределено, '00010101', НачалоДня(ДатаНачала)));
	Запрос.УстановитьПараметр("ДатаОкончания", ?(ДатаОкончания = Неопределено, '00010101', КонецДня(ДатаОкончания)));
	
	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		ТекстОтборПоПериоду = "СчетФактура.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	ИначеЕсли ЗначениеЗаполнено(ДатаНачала) Тогда
		ТекстОтборПоПериоду = "СчетФактура.Дата >= &ДатаНачала";
	ИначеЕсли ЗначениеЗаполнено(ДатаОкончания) Тогда
		ТекстОтборПоПериоду = "СчетФактура.Дата <= &ДатаОкончания";
	Иначе
		ТекстОтборПоПериоду = "ИСТИНА";
	КонецЕсли; 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтборПоПериоду", ТекстОтборПоПериоду);
	
	СчетФактуры = Новый Массив;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		СчетФактура = Новый Структура;
		СчетФактура.Вставить("date", Формат(Выборка.Дата, "ДФ=yyyy-MM-dd"));
		СчетФактура.Вставить("num", Выборка.Номер);
		СчетФактура.Вставить("download_link", АдресБазы +
			"hs/crmexchange/download/invoice/" +
			Строка(Выборка.Ссылка.УникальныйИдентификатор()));
			
		СчетФактуры.Добавить(СчетФактура);
		
	КонецЦикла;
	
	Возврат ВебСервисОтвет(200, СчетФактуры);
	
КонецФункции

//++ Ким Виктор 29.04.2025
//Получить детали свода заявок на доставку по номеру отчета агента.         

Функция ПолучитьСводыЗаявокНаДоставкуДетальный(НомерОтчетаАгента = Неопределено, ДатаНачала = Неопределено, ДатаОкончания = Неопределено) Экспорт
 
	Если НомерОтчетаАгента = Неопределено ИЛИ Не ЗначениеЗаполнено(НомерОтчетаАгента) Тогда 
		
		Возврат ВебСервисОтвет(400,, НСтр("ru='Передан неверный номер отчета агента 1С'"));
		
	//ИначеЕсли НомерЗаявкиНаДоставку = Неопределено ИЛИ Не ЗначениеЗаполнено(НомерЗаявкиНаДоставку) Тогда 
	//	
	//	Возврат ВебСервисОтвет(400,, НСтр("ru='Передан неверный номер заявки на доставку'"));
		
	КонецЕсли;
	
	МассивСводов = Новый Массив;
	
	СтруктураПоиска = Новый Структура("СводЗаявок");
	
	Данные = ПолучитьДетальныеДанныеСводыЗаявокНаДоставку(НомерОтчетаАгента, ДатаНачала, ДатаОкончания);
	
	ВыборкаСводы = Данные.Своды;
	
	Пока ВыборкаСводы.Следующий() Цикл
		
		ДанныеСвода = Новый Структура;
		ДанныеСвода.Вставить("client_id", 	ВыборкаСводы.ИдентификаторКлиента);
		ДанныеСвода.Вставить("report_num", 	ВыборкаСводы.НомерЗаявкиНаДоставку);
		ДанныеСвода.Вставить("report_date", Формат(ВыборкаСводы.Дата, "ДФ=yyyy-MM-dd"));
		ДанныеСвода.Вставить("price_client",Формат(ВыборкаСводы.НаложенныйПлатеж, "ЧЦ=15; ЧДЦ=2"));
		ДанныеСвода.Вставить("pd_full", 	Формат(ВыборкаСводы.ПолнаяСтоимость, "ЧЦ=15; ЧДЦ=2"));
		ДанныеСвода.Вставить("sum_to_pay", 	Формат(ВыборкаСводы.КПеречислению, "ЧЦ=15; ЧДЦ=2"));
		ДанныеСвода.Вставить("status_lead", ВыборкаСводы.Статус);
		
		//ДанныеСвода.Вставить("f_price_client", Формат(ВыборкаСводы.НаложенныйПлатеж, "ЧРД=.; ЧГ=0"));
		//ДанныеСвода.Вставить("f_pd_full", Формат(ВыборкаСводы.ПолнаяСтоимость, "ЧРД=.; ЧГ=0"));
		//ДанныеСвода.Вставить("f_sum2p", Формат(ВыборкаСводы.КПеречислению, "ЧРД=.; ЧГ=0"));
		
		//ДанныеСвода.Вставить("payment_type",
		//	?(ВыборкаСводы.ФормаОплаты = Перечисления.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом,
		//		"without_delivery", "full"
		//	));
		
		
		МассивСводов.Добавить(ДанныеСвода);
		
	КонецЦикла; 
	
	Возврат ВебСервисОтвет(200, МассивСводов);

	
КонецФункции    

Функция ПолучитьСводЗаявкиНаДоставкуПоНомеруЗаявки(НомерЗаявкиНаДоставку = Неопределено, ДатаНачала = Неопределено, ДатаОкончания = Неопределено) Экспорт
 
	Если НомерЗаявкиНаДоставку = Неопределено ИЛИ Не ЗначениеЗаполнено(НомерЗаявкиНаДоставку) Тогда 
		
		Возврат ВебСервисОтвет(400,, НСтр("ru='Передан неверный номер заявки на доставку'"));
		
	КонецЕсли;
	
	МассивСводов = Новый Массив;
	
	СтруктураПоиска = Новый Структура("СводЗаявок");
	
	Данные = ПолучитьСводЗаявокНаДоставкуПоНомеруЗаявки(НомерЗаявкиНаДоставку, ДатаНачала, ДатаОкончания);
	
	ВыборкаСводы = Данные.Своды;
	
	Пока ВыборкаСводы.Следующий() Цикл
		
		ДанныеСвода = Новый Структура;
		ДанныеСвода.Вставить("client_id", 			ВыборкаСводы.ИдентификаторКлиента);
		ДанныеСвода.Вставить("report_agent_num", 	ВыборкаСводы.НомерОтчетаАгента);
		ДанныеСвода.Вставить("report_date", 		Формат(ВыборкаСводы.Дата, "ДФ=yyyy-MM-dd"));
		ДанныеСвода.Вставить("price_client",		Формат(ВыборкаСводы.НаложенныйПлатеж, "ЧЦ=15; ЧДЦ=2"));
		ДанныеСвода.Вставить("pd_full", 			Формат(ВыборкаСводы.ПолнаяСтоимость, "ЧЦ=15; ЧДЦ=2"));
		ДанныеСвода.Вставить("sum_to_pay", 			Формат(ВыборкаСводы.КПеречислению, "ЧЦ=15; ЧДЦ=2"));
		ДанныеСвода.Вставить("hub", 				ВыборкаСводы.НаименованиеХаба);
		
		//ДанныеСвода.Вставить("f_price_client", Формат(ВыборкаСводы.НаложенныйПлатеж, "ЧРД=.; ЧГ=0"));
		//ДанныеСвода.Вставить("f_pd_full", Формат(ВыборкаСводы.ПолнаяСтоимость, "ЧРД=.; ЧГ=0"));
		//ДанныеСвода.Вставить("f_sum2p", Формат(ВыборкаСводы.КПеречислению, "ЧРД=.; ЧГ=0"));
		
		//ДанныеСвода.Вставить("payment_type",
		//	?(ВыборкаСводы.ФормаОплаты = Перечисления.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом,
		//		"without_delivery", "full"
		//	));
		
		
		МассивСводов.Добавить(ДанныеСвода);
		
	КонецЦикла; 
	
	Возврат ВебСервисОтвет(200, МассивСводов);

	
КонецФункции

Функция ПолучитьДетальныеДанныеСводыЗаявокНаДоставку(НомерОтчетаАгента = Неопределено, ДатаНачала = Неопределено, ДатаОкончания = Неопределено) 
	
	Запрос = новый Запрос;
	Запрос.Текст =  ( "ВЫБРАТЬ
	                  |	Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.Дата КАК Дата,
	                  |	Логс_СводЗаявокНаДоставкуЗаявки.Статус КАК Статус,
	                  |	ЕСТЬNULL(ДоговорыКонтрагентов.Логс_ИдентификаторCRM, ""0"") КАК ИдентификаторКлиента,
	                  |	Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.Номер КАК НомерОтчетаАгента,
	                  |	Логс_СводЗаявокНаДоставкуЗаявки.НомерЗаказа КАК НомерЗаявкиНаДоставку,
	                  |	Логс_СводЗаявокНаДоставкуЗаявки.НаложенныйПлатеж КАК НаложенныйПлатеж,
	                  |	Логс_СводЗаявокНаДоставкуЗаявки.КПеречислению КАК КПеречислению,
	                  |	Логс_СводЗаявокНаДоставкуЗаявки.ПолнаяСтоимость КАК ПолнаяСтоимость
	                  |ИЗ
	                  |	Документ.Логс_СводЗаявокНаДоставку.Заявки КАК Логс_СводЗаявокНаДоставкуЗаявки
	                  |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                  |		ПО Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
	                  |ГДЕ
	                  |	&ТекстОтборСводовПоПериоду
	                  |	И ВЫБОР
	                  |			КОГДА &НомерОтчетАгентаЗаполнен
	                  |				ТОГДА Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.Номер = &НомерОтчетаАгента
	                  |			ИНАЧЕ ИСТИНА
	                  |		КОНЕЦ
	                  |	И НЕ Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.ПометкаУдаления");
	
	Запрос.УстановитьПараметр("НомерОтчетАгентаЗаполнен", ЗначениеЗаполнено(НомерОтчетаАгента));
	Запрос.УстановитьПараметр("НомерОтчетаАгента", НомерОтчетаАгента);
	Запрос.УстановитьПараметр("ДатаНачала", ?(ДатаНачала = Неопределено, '00010101', НачалоДня(ДатаНачала)));
	Запрос.УстановитьПараметр("ДатаОкончания", ?(ДатаОкончания = Неопределено, '00010101', КонецДня(ДатаОкончания)));
	
	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		ТекстОтборСводовПоПериоду = "Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	ИначеЕсли ЗначениеЗаполнено(ДатаНачала) Тогда
		ТекстОтборСводовПоПериоду = "Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.Дата >= &ДатаНачала";
	ИначеЕсли ЗначениеЗаполнено(ДатаОкончания) Тогда
		ТекстОтборСводовПоПериоду = "Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.Дата <= &ДатаОкончания";
	Иначе
		ТекстОтборСводовПоПериоду = "ИСТИНА";
	КонецЕсли; 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтборСводовПоПериоду", ТекстОтборСводовПоПериоду);
	
	РезультатЗапроса = Запрос.Выполнить();   
	
	ДанныеСводов = Новый Структура;
	ДанныеСводов.Вставить("Своды", РезультатЗапроса.Выбрать());
	
	Возврат ДанныеСводов; 
	
КонецФункции

Функция ПолучитьСводЗаявокНаДоставкуПоНомеруЗаявки(НомерЗаявкиНаДоставку = Неопределено, ДатаНачала = Неопределено, ДатаОкончания = Неопределено) 
	
	Запрос = новый Запрос;
	Запрос.Текст =  ( "ВЫБРАТЬ
	                  |	Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.Дата КАК Дата,
	                  |	ЕСТЬNULL(ДоговорыКонтрагентов.Логс_ИдентификаторCRM, ""0"") КАК ИдентификаторКлиента,
	                  |	Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.Хаб.Наименование КАК НаименованиеХаба,
	                  |	Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.Номер КАК НомерОтчетаАгента,
	                  |	Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.НаложенныйПлатежВсего КАК НаложенныйПлатеж,
	                  |	Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.КПеречислениюВсего КАК КПеречислению,
	                  |	Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.ПолнаяСтоимостьВсего КАК ПолнаяСтоимость
	                  |ИЗ
	                  |	Документ.Логс_ЗаявкаНаДоставку КАК Логс_ЗаявкаНаДоставку
	                  |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку.Заявки КАК Логс_СводЗаявокНаДоставкуЗаявки
	                  |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	                  |			ПО Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.Договор = ДоговорыКонтрагентов.Ссылка
	                  |		ПО Логс_ЗаявкаНаДоставку.Ссылка = Логс_СводЗаявокНаДоставкуЗаявки.ЗаявкаНаДоставку
	                  |ГДЕ
	                  |	&ТекстОтборСводовПоПериоду
	                  |	И НЕ Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.ПометкаУдаления
	                  |	И Логс_ЗаявкаНаДоставку.Номер = &НомерЗаявкиНаДоставку");
	
	Запрос.УстановитьПараметр("НомерЗаявкиНаДоставку", НомерЗаявкиНаДоставку);
	Запрос.УстановитьПараметр("ДатаНачала", ?(ДатаНачала = Неопределено, '00010101', НачалоДня(ДатаНачала)));
	Запрос.УстановитьПараметр("ДатаОкончания", ?(ДатаОкончания = Неопределено, '00010101', КонецДня(ДатаОкончания)));
	
	Если ЗначениеЗаполнено(ДатаНачала) И ЗначениеЗаполнено(ДатаОкончания) Тогда
		ТекстОтборСводовПоПериоду = "Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";
	ИначеЕсли ЗначениеЗаполнено(ДатаНачала) Тогда
		ТекстОтборСводовПоПериоду = "Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.Дата >= &ДатаНачала";
	ИначеЕсли ЗначениеЗаполнено(ДатаОкончания) Тогда
		ТекстОтборСводовПоПериоду = "Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.Дата <= &ДатаОкончания";
	Иначе
		ТекстОтборСводовПоПериоду = "ИСТИНА";
	КонецЕсли; 
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтборСводовПоПериоду", ТекстОтборСводовПоПериоду);
	
	РезультатЗапроса = Запрос.Выполнить();   
	
	ДанныеСводов = Новый Структура;
	ДанныеСводов.Вставить("Своды", РезультатЗапроса.Выбрать());
	
	Возврат ДанныеСводов; 
	
КонецФункции


//-- Ким Виктор 29.04.2025


#КонецОбласти 

Функция ПолучитьДоговораИзСРМ(Параметры)
	
	МассивИДДоговора = Новый Массив;		
		
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("key", "bc47ef070acd827b5f2f8b3f202a31b6");
	ПараметрыЗапроса.Вставить("client_id", "");
	ПараметрыЗапроса.Вставить("date_beg", Формат(Параметры.НачалоПериода, "ДФ=yyyy-MM-dd"));
	ПараметрыЗапроса.Вставить("date_end", Формат(Параметры.КонецПериода, "ДФ=yyyy-MM-dd"));
	ПараметрыЗапроса.Вставить("detail", "1");
		
	Ответ = Логс_ОбменСCRM.ЗапросКСерверуCRM("clientsprices", ПараметрыЗапроса);
			
	Если Не Ответ.Свойство("response") Тогда
		ВызватьИсключение НСтр("ru='Неверный ответ от сервера CRM или ответ содержит ошибку'");
		Возврат МассивИДДоговора;
	КонецЕсли; 			
			
	Для каждого Элемент Из Ответ.response Цикл
		Если МассивИДДоговора.Найти(Элемент.cli_ag_dog) <> Неопределено Тогда
			Продолжить;
		КонецЕсли;	
		МассивИДДоговора.Добавить(Элемент.cli_ag_dog);
	КонецЦикла;
			
	Возврат МассивИДДоговора;	
	
КонецФункции	


//НЕ используется
Функция ЗагрузитьЗаявкиНаДоставку(Параметры, СписокОшибок) Экспорт
	Перем Партнер, НомерЗаявки, ТДРегион;
	
	НачалоПериода = Параметры.НачалоПериода;
	КонецПериода = Параметры.КонецПериода;
	ОбновлятьСуществующие = Параметры.ОбновлятьСуществующие;
	Параметры.Свойство("Партнер", Партнер);
	Параметры.Свойство("НомерЗаявки", НомерЗаявки);
	Параметры.Свойство("ТДРегион", ТДРегион); 
	
	СписокОшибок = Новый Массив;
	МассивДоговоров = Новый Массив;
	ТаблицаЗаявок = СоздатьТаблицуЗаявок();
	
	// если чтоит фильтр по контрагенту, то оставляем старый алгоритм
	Если ЗначениеЗаполнено(Партнер) Тогда
		СписокАгентов = ПолучитьСписокАгентовДляЗагрузкиЗаявокНаДоставку(Партнер);
	// если идет запрос по всем, то меняем алгоритм - сначала получаем список договоров, по которым есть заявки
	Иначе
		МассивНомерДоговор = ПолучитьДоговораИзСРМ(Параметры);
	    СписокАгентов = ПолучитьСписокАгентовДляЗагрузкиЗаявокНаДоставку(Партнер, МассивНомерДоговор);
	КонецЕсли;
	
	Для каждого ДанныеАгента Из СписокАгентов Цикл
		
		Попытка
			
			СводЗаявок = ПолучитьСводЗаявокНаДоставку(ДанныеАгента.ИдентификаторКлиента, НачалоПериода, КонецПериода, НомерЗаявки, ТДРегион);
			
		Исключение
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru='Произошла ошибка при получении заявок агента %1 из CRM: %2'"),
				ДанныеАгента.Партнер, КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			ЗаписьЖурналаРегистрации("Обмен с CRM. Загрузка заявок", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			СписокОшибок.Добавить(Новый Структура("ТекстОшибки,КлючДанных", ТекстСообщения, Неопределено));
			
			Продолжить;
			
		КонецПопытки;
		
		ДобавитьМассивЗаявокВТаблицуЗначений(ТаблицаЗаявок, СводЗаявок, ДанныеАгента,, ТДРегион);
		
		МассивДоговоров.Добавить(ДанныеАгента.Договор);
		
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Заявки.ДатаДоставки, ДЕНЬ) КАК ДатаДоставки,
	|	Заявки.ДатаДоставкиПлан КАК ДатаДоставкиПлан,
	|	Заявки.НомерЗаказа КАК НомерЗаказа,
	|	Заявки.ИдентификаторКлиента КАК ИдентификаторКлиента,
	|	Заявки.Организация КАК Организация,
	|	Заявки.Партнер КАК Партнер,
	|	Заявки.Контрагент КАК Контрагент,
	|	Заявки.Договор КАК Договор,
	|	Заявки.НалогообложениеНДС КАК НалогообложениеНДС,
	|	Заявки.ФормаОплаты КАК ФормаОплаты,
	|	Заявки.Валюта КАК Валюта,
	|	Заявки.СтавкаНДС КАК СтавкаНДС,
	|	Заявки.ИдентификаторКурьера КАК ИдентификаторКурьера,
	|	Заявки.Статус КАК Статус,
	|	Заявки.РегиональнаяЗаявка КАК РегиональнаяЗаявка,
	|	Заявки.IDЗона КАК IDЗона,
	|	Заявки.КодРегиона КАК КодРегиона,
	|	Заявки.Приоритет КАК Приоритет,
	|	Заявки.ТипКурьера КАК ТипКурьера,
	|	Заявки.НомерЗаказаКлиента КАК НомерЗаказаКлиента,
	|	Заявки.Вес КАК Вес,
	|	Заявки.РасстояниеОтМКАД КАК РасстояниеОтМКАД,
	|	Заявки.ОценочнаяСтоимость КАК ОценочнаяСтоимость,
	|	Заявки.НаложенныйПлатеж КАК НаложенныйПлатеж,
	|	Заявки.Тариф КАК Тариф,
	|	Заявки.ПовторнаяДоставка КАК ПовторнаяДоставка,
	|	Заявки.КассовоеОбслуживание КАК КассовоеОбслуживание,
	|	Заявки.Эквайринг КАК Эквайринг,
	|	Заявки.Страхование КАК Страхование,
	|	Заявки.Комплектация КАК Комплектация,
	|	Заявки.Упаковка КАК Упаковка,
	|	Заявки.Этикирование КАК Этикирование,
	|	Заявки.Прозвон КАК Прозвон,
	|	Заявки.СМС КАК СМС,
	|	Заявки.ОбработкаВозврата КАК ОбработкаВозврата,
	|	Заявки.Обмен КАК Обмен,
	|	Заявки.ЗаносКГТ КАК ЗаносКГТ,
	|	Заявки.ВозвратныеДокументы КАК ВозвратныеДокументы,
	|	Заявки.ПолнаяСтоимость КАК ПолнаяСтоимость,
	|	Заявки.ПолнаяСтоимостьНДС КАК ПолнаяСтоимостьНДС,
	|	Заявки.ПолнаяСтоимостьСНДС КАК ПолнаяСтоимостьСНДС,
	|	Заявки.КПеречислению КАК КПеречислению,
	|	Заявки.ОплатаНаличные КАК ОплатаНаличные,
	|	Заявки.ВозвратНаличные КАК ВозвратНаличные,
	|	Заявки.СтоимостьЗаказа КАК СтоимостьЗаказа,
	|	Заявки.ДатаЗабора КАК ДатаЗабора,
	|	Заявки.ДатаВозврата КАК ДатаВозврата,
	|	Заявки.СуммаВозврата КАК СуммаВозврата,
	|	Заявки.СтоимостьЗаказаПолная КАК СтоимостьЗаказаПолная,
	|	Заявки.СтоимостьДоставкиПринципала КАК СтоимостьДоставкиПринципала,
	|	Заявки.ЧастичныйВозвратОтКлиента КАК ЧастичныйВозвратОтКлиента,
	|	Заявки.ОбработкаЧастичногоВыкупа КАК ОбработкаЧастичногоВыкупа,	
	|	Заявки.СУДСНДС КАК СУДСНДС,
	|	Заявки.СУДС_СНДС КАК СУДС_СНДС,
	|	Заявки.Город КАК Город,
	|	Заявки.ТДРегион КАК ТДРегион,
	|	Заявки.АгентРегион КАК АгентРегион
	|ПОМЕСТИТЬ ТаблицаЗаявок
	|ИЗ
	|	&ТаблицаЗаявок КАК Заявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заявки.ДатаДоставки КАК ДатаДоставки,
	|	Заявки.ДатаДоставкиПлан КАК ДатаДоставкиПлан,
	|	Заявки.НомерЗаказа КАК НомерЗаказа,
	|	Заявки.ИдентификаторКлиента КАК ИдентификаторКлиента,
	|	Заявки.Организация КАК Организация,
	|	Заявки.Партнер КАК Партнер,
	|	Заявки.Контрагент КАК Контрагент,
	|	Заявки.Договор КАК Договор,
	|	Заявки.НалогообложениеНДС КАК НалогообложениеНДС,
	|	Заявки.ФормаОплаты КАК ФормаОплаты,
	|	Заявки.СтавкаНДС КАК СтавкаНДС,
	|	Заявки.Валюта КАК Валюта,
	|	Заявки.Статус КАК Статус,
	|	Заявки.IDЗона КАК IDЗона,
	|	Заявки.КодРегиона КАК КодРегиона,
	|	Заявки.РегиональнаяЗаявка КАК РегиональнаяЗаявка,
	|	Заявки.Приоритет КАК Приоритет,
	|	Заявки.ТипКурьера КАК ТипКурьера,
	|	Заявки.НомерЗаказаКлиента КАК НомерЗаказаКлиента,
	|	Заявки.Вес КАК Вес,
	|	Заявки.РасстояниеОтМКАД КАК РасстояниеОтМКАД,
	|	Заявки.ОценочнаяСтоимость КАК ОценочнаяСтоимость,
	|	Заявки.НаложенныйПлатеж КАК НаложенныйПлатеж,
	|	Заявки.Тариф КАК Тариф,
	|	Заявки.ПовторнаяДоставка КАК ПовторнаяДоставка,
	|	Заявки.КассовоеОбслуживание КАК КассовоеОбслуживание,
	|	Заявки.Эквайринг КАК Эквайринг,
	|	Заявки.Страхование КАК Страхование,
	|	Заявки.Комплектация КАК Комплектация,
	|	Заявки.Упаковка КАК Упаковка,
	|	Заявки.Этикирование КАК Этикирование,
	|	Заявки.Прозвон КАК Прозвон,
	|	Заявки.СМС КАК СМС,
	|	Заявки.ОбработкаВозврата КАК ОбработкаВозврата,
	|	Заявки.Обмен КАК Обмен,
	|	Заявки.ЗаносКГТ КАК ЗаносКГТ,
	|	Заявки.ВозвратныеДокументы КАК ВозвратныеДокументы,
	|	Заявки.ПолнаяСтоимость КАК ПолнаяСтоимость,
	|	Заявки.ПолнаяСтоимостьНДС КАК ПолнаяСтоимостьНДС,
	|	Заявки.ПолнаяСтоимостьСНДС КАК ПолнаяСтоимостьСНДС,
	|	Заявки.КПеречислению КАК КПеречислению,
	|	Заявки.ОплатаНаличные КАК ОплатаНаличные,
	|	Заявки.ВозвратНаличные КАК ВозвратНаличные,
	|	Заявки.СтоимостьЗаказа КАК СтоимостьЗаказа,
	|	Заявки.ДатаЗабора КАК ДатаЗабора,
	|	Заявки.ДатаВозврата КАК ДатаВозврата,
	|	Заявки.СуммаВозврата КАК СуммаВозврата,
	|	Заявки.СтоимостьЗаказаПолная КАК СтоимостьЗаказаПолная,
	|	Заявки.СтоимостьДоставкиПринципала КАК СтоимостьДоставкиПринципала,
	|	Заявки.ЧастичныйВозвратОтКлиента КАК ЧастичныйВозвратОтКлиента,
	|	Заявки.ОбработкаЧастичногоВыкупа КАК ОбработкаЧастичногоВыкупа,
	|	ЕСТЬNULL(Курьеры.Ссылка, НЕОПРЕДЕЛЕНО) КАК Курьер,
	|	ЕСТЬNULL(ЗагруженныеЗаявки.Ссылка, НЕОПРЕДЕЛЕНО) КАК Ссылка,
	|	Заявки.СУДСНДС КАК СУДСНДС,
	|	Заявки.СУДС_СНДС КАК СУДС_СНДС,
	|	Заявки.Город КАК Город,
	|	Заявки.ТДРегион КАК ТДРегион,
	|	Заявки.АгентРегион КАК АгентРегион	
	|ПОМЕСТИТЬ Заявки
	|ИЗ
	|	ТаблицаЗаявок КАК Заявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.ДополнительныеРеквизиты КАК Курьеры
	|		ПО Заявки.ИдентификаторКурьера = Курьеры.Значение
	|			И (Заявки.ИдентификаторКурьера <> """")
	|			И (Курьеры.Свойство = &СвойствоИдентификатор)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Логс_ЗаявкаНаДоставку КАК ЗагруженныеЗаявки
	|		ПО Заявки.НомерЗаказа = ЗагруженныеЗаявки.Номер
	|ГДЕ
	|	Заявки.ДатаДоставки МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заявки.ДатаДоставки КАК ДатаДоставки,
	|	Заявки.ДатаДоставкиПлан КАК ДатаДоставкиПлан,
	|	Заявки.НомерЗаказа КАК НомерЗаказа,
	|	Заявки.ИдентификаторКлиента КАК ИдентификаторКлиента,
	|	Заявки.Организация КАК Организация,
	|	Заявки.Партнер КАК Партнер,
	|	Заявки.Контрагент КАК Контрагент,
	|	Заявки.Договор КАК Договор,
	|	Заявки.НалогообложениеНДС КАК НалогообложениеНДС,
	|	Заявки.ФормаОплаты КАК ФормаОплаты,
	|	Заявки.СтавкаНДС КАК СтавкаНДС,
	|	Заявки.Валюта КАК Валюта,
	|	Заявки.IDЗона КАК IDЗона,
	|	Заявки.КодРегиона КАК КодРегиона,
	|	Заявки.РегиональнаяЗаявка КАК РегиональнаяЗаявка,
	|	Заявки.Приоритет КАК Приоритет,
	|	Заявки.ТипКурьера КАК ТипКурьера,
	|	Заявки.Статус КАК Статус,
	|	Заявки.НомерЗаказаКлиента КАК НомерЗаказаКлиента,
	|	Заявки.Вес КАК Вес,
	|	Заявки.РасстояниеОтМКАД КАК РасстояниеОтМКАД,
	|	Заявки.ОценочнаяСтоимость КАК ОценочнаяСтоимость,
	|	Заявки.НаложенныйПлатеж КАК НаложенныйПлатеж,
	|	Заявки.Тариф КАК Тариф,
	|	Заявки.ПовторнаяДоставка КАК ПовторнаяДоставка,
	|	Заявки.КассовоеОбслуживание КАК КассовоеОбслуживание,
	|	Заявки.Эквайринг КАК Эквайринг,
	|	Заявки.Страхование КАК Страхование,
	|	Заявки.Комплектация КАК Комплектация,
	|	Заявки.Упаковка КАК Упаковка,
	|	Заявки.Этикирование КАК Этикирование,
	|	Заявки.Прозвон КАК Прозвон,
	|	Заявки.СМС КАК СМС,
	|	Заявки.ОбработкаВозврата КАК ОбработкаВозврата,
	|	Заявки.Обмен КАК Обмен,
	|	Заявки.ЗаносКГТ КАК ЗаносКГТ,
	|	Заявки.ВозвратныеДокументы КАК ВозвратныеДокументы,
	|	Заявки.ПолнаяСтоимость КАК ПолнаяСтоимость,
	|	Заявки.ПолнаяСтоимостьНДС КАК ПолнаяСтоимостьНДС,
	|	Заявки.ПолнаяСтоимостьСНДС КАК ПолнаяСтоимостьСНДС,
	|	Заявки.КПеречислению КАК КПеречислению,
	|	Заявки.ОплатаНаличные КАК ОплатаНаличные,
	|	Заявки.ВозвратНаличные КАК ВозвратНаличные,
	|	Заявки.СтоимостьЗаказа КАК СтоимостьЗаказа,
	|	Заявки.ДатаЗабора КАК ДатаЗабора,
	|	Заявки.ДатаВозврата КАК ДатаВозврата,
	|	Заявки.СуммаВозврата КАК СуммаВозврата,
	|	Заявки.СтоимостьЗаказаПолная КАК СтоимостьЗаказаПолная,
	|	Заявки.СтоимостьДоставкиПринципала КАК СтоимостьДоставкиПринципала,
	|	Заявки.ЧастичныйВозвратОтКлиента КАК ЧастичныйВозвратОтКлиента,
	|	Заявки.ОбработкаЧастичногоВыкупа КАК ОбработкаЧастичногоВыкупа,
	|	Заявки.Курьер КАК Курьер,
	|	Заявки.Ссылка КАК Ссылка,
	|	Заявки.СУДСНДС КАК СУДСНДС,
	|	Заявки.СУДС_СНДС КАК СУДС_СНДС,
	|	Заявки.Город КАК Город,
	|	Заявки.ТДРегион КАК ТДРегион,
	|	Заявки.АгентРегион КАК АгентРегион
	|ИЗ
	|	Заявки КАК Заявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаНаДоставку.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Логс_ЗаявкаНаДоставку КАК ЗаявкаНаДоставку
	|ГДЕ
	|	ЗаявкаНаДоставку.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И ЗаявкаНаДоставку.Договор В(&МассивДоговоров)
	|	И НЕ ЗаявкаНаДоставку.Ссылка В
	|				(ВЫБРАТЬ
	|					Заявки.Ссылка
	|				ИЗ
	|					Заявки)
	|	И НЕ ЗаявкаНаДоставку.ПометкаУдаления");
	Запрос.УстановитьПараметр("ТаблицаЗаявок", ТаблицаЗаявок);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	Запрос.УстановитьПараметр("МассивДоговоров", МассивДоговоров);
	Запрос.УстановитьПараметр("СвойствоИдентификатор",
		Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоИдентификаторКурьераCRM());
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			Если Не ОбновлятьСуществующие Тогда
				Продолжить;
			КонецЕсли; 
			
			ЗаявкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЗаявкаОбъект.ПометкаУдаления = Ложь;
		Иначе
			ЗаявкаОбъект = Документы.Логс_ЗаявкаНаДоставку.СоздатьДокумент();
			ЗаявкаОбъект.Номер = Выборка.НомерЗаказа;
		КонецЕсли; 
		
		ЗаявкаОбъект.Дата = НачалоДня(Выборка.ДатаДоставки);
		ЗаполнитьЗначенияСвойств(ЗаявкаОбъект, Выборка,, "Ссылка");
		
		ЗаявкаОбъект.ЗаполнитьДатуФормированияСвода();
		
		Если ЗаявкаОбъект.Договор.Логс_ЗагружатьТоварыВЗаявке Тогда
		
			Попытка
				ТоварыЗаявки = ПолучитьТоварыЗаявки(Выборка.НомерЗаказа);
			Исключение
				ТоварыЗаявки = Неопределено;
			КонецПопытки;
			
			Если ТоварыЗаявки <> Неопределено Тогда
				ЗаявкаОбъект.Товары.Очистить();
				
				Для каждого ДанныеТовара Из ТоварыЗаявки Цикл
					СтрокаТовар = ЗаявкаОбъект.Товары.Добавить();
					//СтрокаТовар.КодТовара = ДанныеТовара.artname;
					СтрокаТовар.КодТовара = ДанныеТовара.articul;
					//СтрокаТовар.СтатусПередачи = ДанныеТовара.goodStatus;
					СтрокаТовар.СтатусПередачи = ?(ДанныеТовара.is_cancel = "1",
						НСтр("ru='Возвращен'"), НСтр("ru='Вручен'"));
					СтрокаТовар.Стоимость = Число(ДанныеТовара.price) * Число(ДанныеТовара.Count);
					//СтрокаТовар.НаложенныйПлатеж = ДанныеТовара.price_client;
					Если ДанныеТовара.is_cancel = "1" Тогда
						СтрокаТовар.ЧастичныйВозврат = СтрокаТовар.Стоимость;
					Иначе
						Если ЗаявкаОбъект.НаложенныйПлатеж <> 0 Тогда
							СтрокаТовар.НаложенныйПлатеж = СтрокаТовар.Стоимость;
						КонецЕсли;	
					КонецЕсли;	
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;	

		Если ЗаявкаОбъект.ЭтоНовый() Тогда
			ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Запись);
		КонецЕсли; 
		
		Попытка
			
			ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		Исключение
			
			ТекстСообщения = СтрШаблон(
				НСтр("ru='Произошла ошибка при проведении заявки № %1 от %2: %3'"),
				ЗаявкаОбъект.Номер, ЗаявкаОбъект.Дата,
				КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			ЗаписьЖурналаРегистрации("Обмен с CRM. Загрузка заявок",
				УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
			СписокОшибок.Добавить(Новый Структура("ТекстОшибки,КлючДанных",
				ТекстСообщения, ЗаявкаОбъект.Ссылка));
			
			Продолжить;
			
		КонецПопытки;
		
	КонецЦикла; 
	
	// Удаление заявок, отсутствующих в загрузке (в CRM изменился статус на НЕ конечный).
	Если Не ЗначениеЗаполнено(НомерЗаявки) И ТДРегион = Неопределено Тогда
		Выборка = РезультатЗапроса[4].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ЗаявкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			Попытка
				
				ЗаявкаОбъект.УстановитьПометкуУдаления(Истина);
				
			Исключение
				
				ТекстСообщения = СтрШаблон(
					НСтр("ru='Произошла ошибка при пометке на удаление заявки № %1 от %2: %3'"),
					ЗаявкаОбъект.Номер, ЗаявкаОбъект.Дата,
					КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					
				ЗаписьЖурналаРегистрации("Обмен с CRM. Загрузка заявок", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
				СписокОшибок.Добавить(Новый Структура("ТекстОшибки,КлючДанных", ТекстСообщения, ЗаявкаОбъект.Ссылка));
				
			КонецПопытки;
			
		КонецЦикла;
	КонецЕсли;	
	
	Возврат СписокОшибок.Количество() = 0;
	
КонецФункции


Процедура ЗагрузкаЗаявокНаДоставкуВФоне(ПараметрыЗагрузки, АдресХранилища) Экспорт
	Перем Партнер, СписокОшибок;
	
	БылиОшибки = НЕ ЗагрузитьЗаявкиНаДоставку(ПараметрыЗагрузки, СписокОшибок);
	
	Результат = Новый Структура("Успешно,СписокОшибок", Не БылиОшибки, СписокОшибок);
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры 

#Область Загрузка_Заявок_Версия2
Процедура ЗагрузкаЗаявокНаДоставкуВФонеВерсия2(ПараметрыЗагрузки, АдресХранилища) Экспорт
	Перем Партнер, СписокОшибок, Изменения, ДатаЗагрузки;
	
	БылиОшибки = НЕ ЗагрузитьЗаявкиНаДоставкуВерсия2(ПараметрыЗагрузки, СписокОшибок);
	
	ПараметрыЗагрузки.Свойство("ДатаЗагрузки", ДатаЗагрузки);
	Результат = Новый Структура("Успешно,СписокОшибок,ДатаЗагрузки", Не БылиОшибки, СписокОшибок, ДатаЗагрузки);
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры 

Функция ЗагрузитьЗаявкиНаДоставкуВерсия2(Параметры, СписокОшибок) Экспорт

	//++ Ким Виктор 06.02.2025
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15674
	Перем Партнер, НомерЗаявки, ТДРегион, ДатаЗагрузки, Хаб, ИДХаба, Договор;
	//-- Ким Виктор 06.02.2025
	
	НачалоПериода = Параметры.НачалоПериода;
	КонецПериода = Параметры.КонецПериода;
	ОбновлятьСуществующие = Параметры.ОбновлятьСуществующие;
	Параметры.Свойство("Партнер", Партнер);
	Параметры.Свойство("НомерЗаявки", НомерЗаявки);
	Параметры.Свойство("ТДРегион", ТДРегион); 
	Параметры.Свойство("ДатаЗагрузки", ДатаЗагрузки);
	Параметры.Свойство("Хаб", Хаб);
	//++ Ким Виктор 06.02.2025
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15674
	Параметры.Свойство("Договор", Договор);
	//-- Ким Виктор 06.02.2025
	
	
	ИдХаба = ?(ЗначениеЗаполнено(Хаб), Хаб.ИД, Неопределено);
	
	
	Если НЕ ЗначениеЗаполнено(ДатаЗагрузки) Тогда
		ДатаЗагрузки = ТекущаяДата();
	КонецЕсли;
	
	Коллизии = РегистрыСведений.Логс_ИзмененияПриЗагрузкеЗаявок.СоздатьНаборЗаписей();
	Коллизии.Отбор.ДатаЗагрузки.Установить(ДатаЗагрузки);
	
	//++ ставки НДС
	СтавкиНДС = Новый Соответствие;
	Выборка = Справочники.Организации.Выбрать();
	Пока Выборка.Следующий() Цикл
		тСтавка = УправлениеСвойствами.ЗначениеСвойства(Выборка.Ссылка, 
		Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоСтавкаНДСОрганизацииCRM());
		Если ЗначениеЗаполнено(тСтавка) Тогда 
			//++ Ким Виктор 17.12.2024
			//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15273
			//Если НачалоДня(ТекущаяДата()) < ЗапускМеханизмаСтавкиНДСОрионЛогистика()  Тогда 
			Если НачалоДня(КонецПериода) < ЗапускМеханизмаСтавкиНДСОрионЛогистика()  Тогда 
				СтавкиНДС.Вставить(Выборка.Ссылка, ?(тСтавка.Наименование = "20%", Перечисления.СтавкиНДС.НДС20, Перечисления.СтавкиНДС.БезНДС));
			Иначе
				
				//ПроверитьОбъектОрганизацияОрион(Выборка.Ссылка, тСтавка);
				
				Если тСтавка.Наименование = "5%" Тогда 
					СтавкиНДС.Вставить(Выборка.Ссылка, Перечисления.СтавкиНДС.НДС5);
				Иначе
					СтавкиНДС.Вставить(Выборка.Ссылка, ?(тСтавка.Наименование = "20%", Перечисления.СтавкиНДС.НДС20, Перечисления.СтавкиНДС.БезНДС));	
				КонецЕсли;
			КонецЕсли;
			//-- Ким Виктор 17.12.2024
		КонецЕсли;
		//Если ЗначениеЗаполнено(тСтавка) Тогда 
		//	СтавкиНДС.Вставить(Выборка.Ссылка, ?(тСтавка.Наименование = "20%", Перечисления.СтавкиНДС.НДС20, Перечисления.СтавкиНДС.БезНДС));
		//КонецЕсли; 
		
	КонецЦикла;      
			
	//-- ставки НДС	
	
	СписокОшибок = Новый Массив;
	МассивДоговоров = Новый Массив;
	Изменения = Новый Массив;
	ТаблицаЗаявок = СоздатьТаблицуЗаявок();
	
	ЗаполнитьТаблицуЗаявок(ТаблицаЗаявок, Партнер, НачалоПериода, КонецПериода, НомерЗаявки, ТДРегион, ИДХаба, Договор);
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(Заявки.ДатаДоставки, ДЕНЬ) КАК ДатаДоставки,
	|	Заявки.ТипЗаявки КАК ТипЗаявки,
	|	Заявки.ЭтоЗабор КАК ЭтоЗабор,
	|	Заявки.ДатаДоставкиПлан КАК ДатаДоставкиПлан,
	|	Заявки.НомерЗаказа КАК НомерЗаказа,
	|	Заявки.ИдентификаторКлиента КАК ИдентификаторКлиента,
	|	Заявки.Организация КАК Организация,
	|	Заявки.Партнер КАК Партнер,
	|	Заявки.Контрагент КАК Контрагент,
	|	Заявки.Договор КАК Договор,
	|	Заявки.НалогообложениеНДС КАК НалогообложениеНДС,
	|	Заявки.ФормаОплаты КАК ФормаОплаты,
	|	Заявки.Валюта КАК Валюта,
	|	Заявки.СтавкаНДС КАК СтавкаНДС,
	|	Заявки.ИдентификаторКурьера КАК ИдентификаторКурьера,
	|	Заявки.Статус КАК Статус,
	|	Заявки.РегиональнаяЗаявка КАК РегиональнаяЗаявка,
	|	Заявки.IDЗона КАК IDЗона,
	|	Заявки.КодРегиона КАК КодРегиона,
	|	Заявки.Приоритет КАК Приоритет,
	|	Заявки.ТипКурьера КАК ТипКурьера,
	|	Заявки.НомерЗаказаКлиента КАК НомерЗаказаКлиента,
	|	Заявки.Вес КАК Вес,
	|	Заявки.КоличествоМест КАК КоличествоМест,
	|	Заявки.ОбъемныйВес КАК ОбъемныйВес,
	|	Заявки.РасстояниеОтМКАД КАК РасстояниеОтМКАД,
	|	Заявки.ОценочнаяСтоимость КАК ОценочнаяСтоимость,
	|	Заявки.НаложенныйПлатеж КАК НаложенныйПлатеж,
	|	Заявки.Тариф КАК Тариф,
	|	Заявки.ПовторнаяДоставка КАК ПовторнаяДоставка,
	|	Заявки.КоличествоПопытокДоставки КАК КоличествоПопытокДоставки,
	|	Заявки.КассовоеОбслуживание КАК КассовоеОбслуживание,
	|	Заявки.Эквайринг КАК Эквайринг,
	|	Заявки.Страхование КАК Страхование,
	|	Заявки.Комплектация КАК Комплектация,
	|	Заявки.Упаковка КАК Упаковка,
	|	Заявки.Этикирование КАК Этикирование,
	|	Заявки.Прозвон КАК Прозвон,
	|	Заявки.СМС КАК СМС,
	|	Заявки.ОбработкаВозврата КАК ОбработкаВозврата,
	|	Заявки.Обмен КАК Обмен,
	|	Заявки.ЗаносКГТ КАК ЗаносКГТ,
	|	Заявки.ВозвратныеДокументы КАК ВозвратныеДокументы,
	|	Заявки.ПолнаяСтоимость КАК ПолнаяСтоимость,
	|	Заявки.ПолнаяСтоимостьНДС КАК ПолнаяСтоимостьНДС,
	|	Заявки.ПолнаяСтоимостьСНДС КАК ПолнаяСтоимостьСНДС,
	|	Заявки.КПеречислению КАК КПеречислению,
	|	Заявки.ОплатаНаличные КАК ОплатаНаличные,
	|	Заявки.ОплатаСБП КАК ОплатаСБП,
	|	Заявки.ВозвратНаличные КАК ВозвратНаличные,
	|	Заявки.СтоимостьЗаказа КАК СтоимостьЗаказа,
	|	Заявки.ДатаЗабора КАК ДатаЗабора,
	|	Заявки.ДатаВозврата КАК ДатаВозврата,
	|	Заявки.СуммаВозврата КАК СуммаВозврата,
	|	Заявки.СтоимостьЗаказаПолная КАК СтоимостьЗаказаПолная,
	|	Заявки.СтоимостьДоставкиПринципала КАК СтоимостьДоставкиПринципала,
	|	Заявки.ЧастичныйВозвратОтКлиента КАК ЧастичныйВозвратОтКлиента,
	|	Заявки.ОбработкаЧастичногоВыкупа КАК ОбработкаЧастичногоВыкупа,
	|	Заявки.СуммаКлиентскогоВозврата КАК СуммаКлиентскогоВозврата,
	|	Заявки.СуммаКлиентскогоОбмена КАК СуммаКлиентскогоОбмена,
	|	Заявки.МагистральноеПеремещение КАК МагистральноеПеремещение,
	|	Заявки.Хранение КАК Хранение,
	//++ Ким Виктор 31.03.2025
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-16074
	|	Заявки.СортировкаАгента КАК СортировкаАгента,
	|	Заявки.НадбавкаАгента КАК НадбавкаАгента,
	|	Заявки.ГарантированнаяДоставка КАК ГарантированнаяДоставка,
	|	Заявки.ОжиданиеКурьера КАК ОжиданиеКурьера,
	|	Заявки.ОплатаПарковкиАгента КАК ОплатаПарковкиАгента,
	//-- Ким Виктор 31.03.2025
	|	Заявки.СУДСНДС КАК СУДСНДС,
	|	Заявки.СУДС_СНДС КАК СУДС_СНДС,
	|	Заявки.Город КАК Город,
	|	Заявки.ТДРегион КАК ТДРегион,
	|	Заявки.АгентРегион КАК АгентРегион,
	|	Заявки.Хаб КАК Хаб,
	|	Заявки.ТипДоставки,
	|	Заявки.ЗонаДоставки КАК ЗонаДоставки,
	|	Заявки.АдресДоставки КАК АдресДоставки,
	|	Заявки.ФИОКонтактногоЛицаЗаказчика КАК ФИОКонтактногоЛицаЗаказчика,
	|	Заявки.ДатаПоступленияНаСклад КАК ДатаПоступленияНаСклад,
	|	Заявки.ИнтервалДоставкиНачало КАК ИнтервалДоставкиНачало,
	|	Заявки.ИнтервалДоставкиОкончание КАК ИнтервалДоставкиОкончание,
	|	Заявки.ПриемДСпоСБП КАК ПриемДСпоСБП,
	|	Заявки.ОжиданиеНаАдресе КАК ОжиданиеНаАдресе, 
	|	Заявки.ОплатаПарковки КАК ОплатаПарковки, 
	|	Заявки.ДатаЧека КАК ДатаЧека, 
	|	Заявки.ПровайдерЧека КАК ПровайдерЧека,  
	|	Заявки.АдресСкладаОтправителя КАК АдресСкладаОтправителя,  
	|	Заявки.Ошибка КАК Ошибка,   
	//++ Ким Виктор 03.02.2026
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-18411
	|   Заявки.ХабОтправителя КАК ХабОтправителя,
	|	Заявки.ХабПолучателя КАК ХабПолучателя,
	|   Заявки.ЛыжиИлиНеЛыжи КАК ЛыжиИлиНеЛыжи  
	//-- Ким Виктор 03.02.2026
	|
	|ПОМЕСТИТЬ ТаблицаЗаявок
	|ИЗ
	|	&ТаблицаЗаявок КАК Заявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заявки.ДатаДоставки КАК ДатаДоставки,
	|	Заявки.ТипЗаявки КАК ТипЗаявки,
	|	Заявки.ЭтоЗабор КАК ЭтоЗабор,
	|	Заявки.ДатаДоставкиПлан КАК ДатаДоставкиПлан,
	|	Заявки.НомерЗаказа КАК НомерЗаказа,
	|	Заявки.ИдентификаторКлиента КАК ИдентификаторКлиента,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Партнер КАК Партнер,
	|	ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	//++ Ким Виктор 18.12.2024
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15273
	|	ВЫБОР
	|		КОГДА &ТекущаяДата >= &ДатаВключенияМеханизма
	|				И ДоговорыКонтрагентов.Организация = &ОрионЛогистика
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|		КОГДА УчетнаяПолитикаОрганизацийСрезПоследних.ПрименяетсяУСНДоходыМинусРасходы
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|	КОНЕЦ КАК НалогообложениеНДС,
	//-- Ким Виктор 18.12.2024
	//|	ВЫБОР
	//|		КОГДА //УчетнаяПолитикаОрганизацийСрезПоследних.ПрименяетсяУСН  ИЛИ
	//|				 УчетнаяПолитикаОрганизацийСрезПоследних.ПрименяетсяУСНДоходыМинусРасходы
	//|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	//|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	//|	КОНЕЦ КАК НалогообложениеНДС,
	|	ДоговорыКонтрагентов.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.ВалютаВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА &ВалютаУпрУчета
	|		ИНАЧЕ ДоговорыКонтрагентов.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК Валюта,
	|	Заявки.ФормаОплаты КАК ФормаОплаты,           
	|	isnull(ДоговорыКонтрагентов.Логс_ЗагружатьТоварыВЗаявке, false) КАК Логс_ЗагружатьТоварыВЗаявке,           
	|	Заявки.Статус КАК Статус,
	|	Заявки.IDЗона КАК IDЗона,
	|	Заявки.КодРегиона КАК КодРегиона,
	|	Заявки.РегиональнаяЗаявка КАК РегиональнаяЗаявка,
	|	Заявки.Приоритет КАК Приоритет,
	|	Заявки.ТипКурьера КАК ТипКурьера,
	|	Заявки.НомерЗаказаКлиента КАК НомерЗаказаКлиента,
	|	Заявки.Вес КАК Вес,
	|	Заявки.КоличествоМест КАК КоличествоМест,
	|	Заявки.ОбъемныйВес КАК ОбъемныйВес,
	|	Заявки.РасстояниеОтМКАД КАК РасстояниеОтМКАД,
	|	Заявки.ОценочнаяСтоимость КАК ОценочнаяСтоимость,
	|	Заявки.НаложенныйПлатеж КАК НаложенныйПлатеж,
	|	Заявки.Тариф КАК Тариф,
	|	Заявки.ПовторнаяДоставка КАК ПовторнаяДоставка,
	|	Заявки.КоличествоПопытокДоставки КАК КоличествоПопытокДоставки,
	|	Заявки.КассовоеОбслуживание КАК КассовоеОбслуживание,
	|	Заявки.Эквайринг КАК Эквайринг,
	|	Заявки.Страхование КАК Страхование,
	|	Заявки.Комплектация КАК Комплектация,
	|	Заявки.Упаковка КАК Упаковка,
	|	Заявки.Этикирование КАК Этикирование,
	|	Заявки.Прозвон КАК Прозвон,
	|	Заявки.СМС КАК СМС,
	|	Заявки.ОбработкаВозврата КАК ОбработкаВозврата,
	|	Заявки.Обмен КАК Обмен,
	|	Заявки.ЗаносКГТ КАК ЗаносКГТ,
	|	Заявки.ВозвратныеДокументы КАК ВозвратныеДокументы,
	|	Заявки.ПолнаяСтоимость КАК ПолнаяСтоимость,
	|	Заявки.ПолнаяСтоимостьНДС КАК ПолнаяСтоимостьНДС,
	|	Заявки.ПолнаяСтоимостьСНДС КАК ПолнаяСтоимостьСНДС,
	|	Заявки.КПеречислению КАК КПеречислению,
	|	Заявки.ОплатаНаличные КАК ОплатаНаличные,
	|	Заявки.ОплатаСБП КАК ОплатаСБП,
	|	Заявки.ВозвратНаличные КАК ВозвратНаличные,
	|	Заявки.СтоимостьЗаказа КАК СтоимостьЗаказа,
	|	Заявки.ДатаЗабора КАК ДатаЗабора,
	|	Заявки.ДатаВозврата КАК ДатаВозврата,
	|	Заявки.СуммаВозврата КАК СуммаВозврата,
	|	Заявки.СтоимостьЗаказаПолная КАК СтоимостьЗаказаПолная,
	|	Заявки.СтоимостьДоставкиПринципала КАК СтоимостьДоставкиПринципала,
	|	Заявки.ЧастичныйВозвратОтКлиента КАК ЧастичныйВозвратОтКлиента,
	|	Заявки.ОбработкаЧастичногоВыкупа КАК ОбработкаЧастичногоВыкупа,
	|	Заявки.СуммаКлиентскогоВозврата КАК СуммаКлиентскогоВозврата,
	|	Заявки.СуммаКлиентскогоОбмена КАК СуммаКлиентскогоОбмена,
	|	Заявки.МагистральноеПеремещение КАК МагистральноеПеремещение,
	|	Заявки.Хранение КАК Хранение,
	//++ Ким Виктор 31.03.2025
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-16074
	|	Заявки.СортировкаАгента КАК СортировкаАгента,
	|	Заявки.НадбавкаАгента КАК НадбавкаАгента,
	|	Заявки.ГарантированнаяДоставка КАК ГарантированнаяДоставка,
	|	Заявки.ОжиданиеКурьера КАК ОжиданиеКурьера,
	|	Заявки.ОплатаПарковкиАгента КАК ОплатаПарковкиАгента,
	//-- Ким Виктор 31.03.2025
	|	ЕСТЬNULL(КурьерыСЗ.Ссылка, isnull(Курьеры.Ссылка, Неопределено)) КАК Курьер,
	|	ЕСТЬNULL(ЗагруженныеЗаявки.Ссылка, НЕОПРЕДЕЛЕНО) КАК Ссылка,
	|	Заявки.СУДСНДС КАК СУДСНДС,
	|	Заявки.СУДС_СНДС КАК СУДС_СНДС,
	|	Заявки.Город КАК Город,
	|	Заявки.ТДРегион КАК ТДРегион,
	|	Заявки.АгентРегион КАК АгентРегион,
	|	Заявки.Хаб КАК Хаб,
	|	Заявки.ТипДоставки,
	|	Заявки.ЗонаДоставки КАК ЗонаДоставки,
	|	Заявки.АдресДоставки КАК АдресДоставки,
	|	Заявки.ФИОКонтактногоЛицаЗаказчика КАК ФИОКонтактногоЛицаЗаказчика,
	|	Заявки.ДатаПоступленияНаСклад КАК ДатаПоступленияНаСклад,
	|	Заявки.ИнтервалДоставкиНачало КАК ИнтервалДоставкиНачало,
	|	Заявки.ИнтервалДоставкиОкончание КАК ИнтервалДоставкиОкончание,
	|	Заявки.ПриемДСпоСБП КАК ПриемДСпоСБП,
	|	Заявки.ОжиданиеНаАдресе КАК ОжиданиеНаАдресе,
	|	Заявки.ОплатаПарковки КАК ОплатаПарковки, 
	|	Заявки.ДатаЧека КАК ДатаЧека, 
	|	Заявки.ПровайдерЧека КАК ПровайдерЧека, 
	|	Заявки.АдресСкладаОтправителя КАК АдресСкладаОтправителя,  
	|	ДоговорыКонтрагентов.Логс_РассчитыватьНДСВРазрезеТарифов КАК Логс_РассчитыватьНДСВРазрезеТарифов,  
	|	ДоговорыКонтрагентов.Логс_ЗагружатьДополнительныеПоляЗаявок КАК Логс_ЗагружатьДополнительныеПоляЗаявок,  
	|	Выбор когда ЗагруженныеЗаявки.Номер есть null или ЗагруженныеЗаявки.Дата=Заявки.ДатаДоставки тогда Ложь иначе Истина конец КАК ОбрабатыватьВнеТранзакции,
	|	Заявки.Ошибка КАК Ошибка,
	//++ Ким Виктор 03.02.2026
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-18411
	|   Заявки.ХабОтправителя КАК ХабОтправителя,
	|	Заявки.ХабПолучателя КАК ХабПолучателя,
	|   Заявки.ЛыжиИлиНеЛыжи КАК ЛыжиИлиНеЛыжи  
	//-- Ким Виктор 03.02.2026
	|ПОМЕСТИТЬ Заявки
	|ИЗ
	|	ТаблицаЗаявок КАК Заявки
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.ДополнительныеРеквизиты КАК Курьеры
	|		ПО Заявки.ИдентификаторКурьера = Курьеры.Значение
	|			И (Заявки.ИдентификаторКурьера <> """")
	|			И (Курьеры.Свойство = &СвойствоИдентификатор)
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК КурьерыСЗ
	|		ПО Заявки.ИдентификаторКурьера = КурьерыСЗ.Логс_ИдКурьера
	|			И Заявки.Организация = КурьерыСЗ.Организация
	|			И КурьерыСЗ.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|			И КурьерыСЗ.Логс_ВидКлиентаCRM = ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.СамозанятыйКурьер)
	|			И (Заявки.ИдентификаторКурьера <> """")
	
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Логс_ЗаявкаНаДоставку КАК ЗагруженныеЗаявки
	|		ПО Заявки.НомерЗаказа = ЗагруженныеЗаявки.Номер
	|			И (ЗагруженныеЗаявки.Дата МЕЖДУ &НачалоПериодаПоиска И &КонецПериода)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Заявки.ИдентификаторКлиента = ДоговорыКонтрагентов.Логс_ИдентификаторCRM
	|			И (ДоговорыКонтрагентов.Логс_ОбменСCRM)
	|			И (ДоговорыКонтрагентов.Логс_ВидДоговораCRM = ЗНАЧЕНИЕ(Перечисление.Логс_ВидыДоговоровCRM.Агентский)
	|			И ((НЕ Заявки.ЭтоЗабор и НЕ ДоговорыКонтрагентов.Логс_НеЗагружатьЗаявки) ИЛИ (Заявки.ЭтоЗабор и НЕ ДоговорыКонтрагентов.Логс_НеЗагружатьЗаборы)))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиУчетаУСН.СрезПоследних КАК УчетнаяПолитикаОрганизацийСрезПоследних
	|		ПО (ДоговорыКонтрагентов.Организация = УчетнаяПолитикаОрганизацийСрезПоследних.Организация)
	|ГДЕ
	|	Заявки.ДатаДоставки МЕЖДУ &НачалоПериода И &КонецПериода
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаЗаявок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заявки.ТипЗаявки КАК ТипЗаявки,
	|	Заявки.ДатаДоставки КАК ДатаДоставки,
	|	Заявки.ДатаДоставкиПлан КАК ДатаДоставкиПлан,
	|	Заявки.НомерЗаказа КАК НомерЗаказа,
	|	Заявки.ИдентификаторКлиента КАК ИдентификаторКлиента,
	|	Заявки.Организация КАК Организация,
	|	Заявки.Партнер КАК Партнер,
	|	Заявки.Контрагент КАК Контрагент,
	|	Заявки.Договор КАК Договор,
	|	Заявки.Договор.Логс_ПриемДСвУПДОтдельнойСтрокой КАК Логс_ПриемДСвУПДОтдельнойСтрокой,
	|	Заявки.НалогообложениеНДС КАК НалогообложениеНДС,
	|	Заявки.ФормаОплаты КАК ФормаОплаты,
	|	Заявки.СтавкаНДС КАК СтавкаНДС,
	|	Заявки.Валюта КАК Валюта,
	|	Заявки.IDЗона КАК IDЗона,
	|	Заявки.КодРегиона КАК КодРегиона,
	|	Заявки.РегиональнаяЗаявка КАК РегиональнаяЗаявка,
	|	Заявки.Приоритет КАК Приоритет,
	|	Заявки.ТипКурьера КАК ТипКурьера,
	|	Заявки.Статус КАК Статус,
	|	Заявки.НомерЗаказаКлиента КАК НомерЗаказаКлиента,
	|	Заявки.Вес КАК Вес,
	|	Заявки.КоличествоМест КАК КоличествоМест,
	|	Заявки.ОбъемныйВес КАК ОбъемныйВес,
	|	Заявки.РасстояниеОтМКАД КАК РасстояниеОтМКАД,
	|	Заявки.ОценочнаяСтоимость КАК ОценочнаяСтоимость,
	|	Заявки.НаложенныйПлатеж КАК НаложенныйПлатеж,
	|	Заявки.Тариф КАК Тариф,
	|	Заявки.КоличествоПопытокДоставки КАК КоличествоПопытокДоставки,
	|	Заявки.ПовторнаяДоставка КАК ПовторнаяДоставка,
	|	Заявки.КассовоеОбслуживание КАК КассовоеОбслуживание,
	|	Заявки.Эквайринг КАК Эквайринг,
	|	Заявки.Страхование КАК Страхование,
	|	Заявки.Комплектация КАК Комплектация,
	|	Заявки.Упаковка КАК Упаковка,
	|	Заявки.Этикирование КАК Этикирование,
	|	Заявки.Прозвон КАК Прозвон,
	|	Заявки.СМС КАК СМС,
	|	Заявки.ОбработкаВозврата КАК ОбработкаВозврата,
	|	Заявки.Обмен КАК Обмен,
	|	Заявки.ЗаносКГТ КАК ЗаносКГТ,
	|	Заявки.ВозвратныеДокументы КАК ВозвратныеДокументы,
	|	Заявки.ПолнаяСтоимость КАК ПолнаяСтоимость,
	|	Заявки.ПолнаяСтоимостьНДС КАК ПолнаяСтоимостьНДС,
	|	Заявки.ПолнаяСтоимостьСНДС КАК ПолнаяСтоимостьСНДС,
	|	Заявки.КПеречислению КАК КПеречислению,
	|	Заявки.ОплатаНаличные КАК ОплатаНаличные,
	|	Заявки.ОплатаСБП КАК ОплатаСБП,
	|	Заявки.ВозвратНаличные КАК ВозвратНаличные,
	|	Заявки.СтоимостьЗаказа КАК СтоимостьЗаказа,
	|	Заявки.ДатаЗабора КАК ДатаЗабора,
	|	Заявки.ДатаВозврата КАК ДатаВозврата,
	|	Заявки.СуммаВозврата КАК СуммаВозврата,
	|	Заявки.СтоимостьЗаказаПолная КАК СтоимостьЗаказаПолная,
	|	Заявки.СтоимостьДоставкиПринципала КАК СтоимостьДоставкиПринципала,
	|	Заявки.ЧастичныйВозвратОтКлиента КАК ЧастичныйВозвратОтКлиента,
	|	Заявки.ОбработкаЧастичногоВыкупа КАК ОбработкаЧастичногоВыкупа,
	|	Заявки.СуммаКлиентскогоВозврата КАК СуммаКлиентскогоВозврата,
	|	Заявки.СуммаКлиентскогоОбмена КАК СуммаКлиентскогоОбмена,
	|	Заявки.МагистральноеПеремещение КАК МагистральноеПеремещение,
	|	Заявки.Хранение КАК Хранение,
	//++ Ким Виктор 31.03.2025
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-16074
	|	Заявки.СортировкаАгента КАК СортировкаАгента,
	|	Заявки.НадбавкаАгента КАК НадбавкаАгента,
	|	Заявки.ГарантированнаяДоставка КАК ГарантированнаяДоставка,
	|	Заявки.ОжиданиеКурьера КАК ОжиданиеКурьера,
	|	Заявки.ОплатаПарковкиАгента КАК ОплатаПарковкиАгента,
	//-- Ким Виктор 31.03.2025
	|	Заявки.Курьер КАК Курьер,
	|	Заявки.Ссылка КАК Ссылка,
	|	Заявки.СУДСНДС КАК СУДСНДС,
	|	Заявки.СУДС_СНДС КАК СУДС_СНДС,
	|	Заявки.Город КАК Город,
	|	Заявки.ЭтоЗабор КАК ЭтоЗабор,
	|	Заявки.ТДРегион КАК ТДРегион,
	|	Заявки.АгентРегион КАК АгентРегион,
	|	Заявки.Хаб КАК Хаб,       
	|	Заявки.ТипДоставки,
	|	Заявки.Логс_ЗагружатьТоварыВЗаявке КАК Логс_ЗагружатьТоварыВЗаявке,       
	|	Заявки.ЗонаДоставки КАК ЗонаДоставки,
	|	Заявки.АдресДоставки КАК АдресДоставки,
	|	Заявки.ФИОКонтактногоЛицаЗаказчика КАК ФИОКонтактногоЛицаЗаказчика,
	|	Заявки.ДатаПоступленияНаСклад КАК ДатаПоступленияНаСклад,
	|	Заявки.ИнтервалДоставкиНачало КАК ИнтервалДоставкиНачало,
	|	Заявки.ИнтервалДоставкиОкончание КАК ИнтервалДоставкиОкончание,
	|	Заявки.ПриемДСпоСБП КАК ПриемДСпоСБП,
	|	Заявки.ОжиданиеНаАдресе КАК ОжиданиеНаАдресе, 
	|	Заявки.ОплатаПарковки КАК ОплатаПарковки, 
	|	Заявки.ДатаЧека КАК ДатаЧека, 
	|	Заявки.ПровайдерЧека КАК ПровайдерЧека, 
	|	Заявки.АдресСкладаОтправителя КАК АдресСкладаОтправителя,  
	|	Заявки.Логс_РассчитыватьНДСВРазрезеТарифов КАК Логс_РассчитыватьНДСВРазрезеТарифов,
	|	Заявки.Логс_ЗагружатьДополнительныеПоляЗаявок КАК Логс_ЗагружатьДополнительныеПоляЗаявок,  
	|	Заявки.ОбрабатыватьВнеТранзакции КАК ОбрабатыватьВнеТранзакции, 
	|	Заявки.Ошибка КАК Ошибка,
	//++ Ким Виктор 03.02.2026
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-18411
	|   Заявки.ХабОтправителя КАК ХабОтправителя,
	|	Заявки.ХабПолучателя КАК ХабПолучателя,
	|   Заявки.ЛыжиИлиНеЛыжи КАК ЛыжиИлиНеЛыжи  
	//-- Ким Виктор 03.02.2026

	|ИЗ
	|	Заявки КАК Заявки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаНаДоставку.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Логс_ЗаявкаНаДоставку КАК ЗаявкаНаДоставку
	|ГДЕ
	|	ЗаявкаНаДоставку.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И &ФильтрУдаляемых
	|	И НЕ ЗаявкаНаДоставку.Ссылка В
	|				(ВЫБРАТЬ
	|					Заявки.Ссылка
	|				ИЗ
	|					Заявки)
	|	И НЕ ЗаявкаНаДоставку.ПометкаУдаления");
	Запрос.УстановитьПараметр("ТаблицаЗаявок", ТаблицаЗаявок);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
//	Запрос.УстановитьПараметр("НачалоПериодаПоиска", Макс(НачалоДня(НачалоПериода-30*24*60*60), НачалоГода(НачалоПериода))); //поиск заявок на глубину 30 дней но только в текущем году
    Запрос.УстановитьПараметр("НачалоПериодаПоиска", НачалоПериода-30*24*60*60);
	Запрос.УстановитьПараметр("СвойствоИдентификатор",
		Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоИдентификаторКурьераCRM());
	Запрос.УстановитьПараметр("ВалютаУпрУчета", Константы.ВалютаУправленческогоУчета.Получить());
	
	//поправим текст запроса на удаление заявок в соответствие с отбором:
	тФильтр = "";
	Если ЗначениеЗаполнено(Партнер) Тогда
		тФильтр = тФильтр + " И ЗаявкаНаДоставку.Партнер = &Партнер ";
		Запрос.УстановитьПараметр("Партнер", Партнер);
		//++ Ким Виктор 06.02.2025
		//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15674
		Если ЗначениеЗаполнено(Договор) Тогда 
			тФильтр = тФильтр + " И ЗаявкаНаДоставку.Договор = &Договор	";	
			Запрос.УстановитьПараметр("Договор", Договор)
		КонецЕсли;
		//-- Ким Виктор 06.02.2025
	КонецЕсли;
	Если ЗначениеЗаполнено(НомерЗаявки) Тогда
		тФильтр = тФильтр + " И ЗаявкаНаДоставку.Номер = &НомерЗаявки ";
		Запрос.УстановитьПараметр("НомерЗаявки", НомерЗаявки);
	КонецЕсли;
	Если ТДРегион <> Неопределено Тогда
		тФильтр = тФильтр + " И ЗаявкаНаДоставку.ТДРегион = &ТДРегион ";
		Запрос.УстановитьПараметр("ТДРегион", ТДРегион);
	КонецЕсли;
	Если Хаб <> Неопределено Тогда
		тФильтр = тФильтр + " И ЗаявкаНаДоставку.Хаб = &Хаб ";
		Запрос.УстановитьПараметр("Хаб", Хаб);
	КонецЕсли;
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И &ФильтрУдаляемых", тФильтр);
	//++ Ким Виктор 18.12.2024
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15273
	//Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ТекущаяДата", НачалоДня(КонецПериода));
	Запрос.УстановитьПараметр("ДатаВключенияМеханизма", ЗапускМеханизмаСтавкиНДСОрионЛогистика());
	Запрос.УстановитьПараметр("ОрионЛогистика", Справочники.Организации.НайтиПоРеквизиту("ИНН", "9728051543"));
	//-- Ким Виктор 18.12.2024	
	//////
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	РазмерТранзакции = 666;
	ТекущееКоличествоВТранзакции = 0; 
	ОрганизацияЛГ = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9725007793"); 
	ОрганизацияОЛ = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9728051543");
	
	Выборка = РезультатЗапроса[3].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если НЕ ЗначениеЗаполнено(Выборка.Партнер) Тогда
				//ТекстСообщения = СтрШаблон(
				//	НСтр("ru='Произошла ошибка при записи заявки № %1 от %2: %3'"),
				//	Выборка.НомерЗаказа, Выборка.ДатаДоставки,
				//	"Заявка не загружена - тестовая // не найден агент");
				//	                             
				//ЗаписьЖурналаРегистрации("Обмен с CRM. Загрузка заявок",
				//	УровеньЖурналаРегистрации.Предупреждение,,, ТекстСообщения);
			Продолжить; // не загружаем заявки с ненайденым в 1С партнером (считаются тестовыми)
		КонецЕсли;
		Если ЗначениеЗаполнено(Выборка.Ошибка) Тогда
			
				ТекстСообщения = СтрШаблон(
					НСтр("ru='Произошла ошибка при записи заявки № %1 от %2: %3'"),
					Выборка.НомерЗаказа, Выборка.ДатаДоставки,
					"Ошибка в реквизитах:"+Выборка.Ошибка);
					                             
				ЗаписьЖурналаРегистрации("Обмен с CRM. Загрузка заявок",
					УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
				СписокОшибок.Добавить(Новый Структура("ТекстОшибки,КлючДанных",
					ТекстСообщения, Неопределено));
			Продолжить;
		КонецЕсли;
			
		СтруктураЗаписиКоллизии = Новый Структура();
		Если ЗначениеЗаполнено(Выборка.Ссылка) Тогда
			Если Не ОбновлятьСуществующие Тогда
				Продолжить;
			КонецЕсли; 
			
			ЗаявкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ЗаявкаОбъект.ПометкаУдаления = Ложь;
			
			/////Обработка коллизий
			Если ЗаявкаОбъект.ТДРегион <> Выборка.ТДРегион Тогда
				СтруктураЗаписиКоллизии.Вставить("СтарыйТДРегион",ЗаявкаОбъект.ТДРегион);
				СтруктураЗаписиКоллизии.Вставить("НовыйТДРегион",Выборка.ТДРегион);
			КонецЕсли;
			Если ЗаявкаОбъект.Курьер <> Выборка.Курьер и (ЗначениеЗаполнено(ЗаявкаОбъект.Курьер) ИЛИ ЗначениеЗаполнено(Выборка.Курьер)) Тогда
				СтруктураЗаписиКоллизии.Вставить("СтарыйКурьер",ЗаявкаОбъект.Курьер);
				СтруктураЗаписиКоллизии.Вставить("НовыйКурьер",Выборка.Курьер);
			КонецЕсли;
			Если ЗаявкаОбъект.НаложенныйПлатеж <> Выборка.НаложенныйПлатеж Тогда
				СтруктураЗаписиКоллизии.Вставить("СтараяСуммаНП",ЗаявкаОбъект.НаложенныйПлатеж);
				СтруктураЗаписиКоллизии.Вставить("НоваяСуммаНП",Выборка.НаложенныйПлатеж);
			КонецЕсли;
			Если ЗаявкаОбъект.ПровайдерЧека <> Выборка.ПровайдерЧека Тогда
				СтруктураЗаписиКоллизии.Вставить("СтарыйПровайдерЧека",ЗаявкаОбъект.ПровайдерЧека);
				СтруктураЗаписиКоллизии.Вставить("НовыйПровайдерЧека",Выборка.ПровайдерЧека);
			КонецЕсли;
		Иначе
			ЗаявкаОбъект = Документы.Логс_ЗаявкаНаДоставку.СоздатьДокумент();
			ЗаявкаОбъект.Номер = Выборка.НомерЗаказа;
		КонецЕсли; 
		
		/////Обработка коллизий
		Если Выборка.КодРегиона = "" и НЕ Выборка.ЭтоЗабор Тогда
			СтруктураЗаписиКоллизии.Вставить("ПустойКодРегиона",Истина);
		КонецЕсли;
		
		ЗаявкаОбъект.Дата = (Выборка.ДатаДоставки);
		ЗаполнитьЗначенияСвойств(ЗаявкаОбъект, Выборка,, "Ссылка");
		ЗаявкаОбъект.ФормаОплаты = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ФормаОплатыУслугАгенту(Выборка.Договор, Выборка.РегиональнаяЗаявка, ЗаявкаОбъект.Дата);
		
		//// ++пофикшено - теперь ставка ндс зависит только от организациии, а не от договора  
		//++ Ким Виктор 22.12.2025
		//Новая ставка НДС;
		//Если ЗаявкаОбъект.Дата < Дата("20260101") И ЗаявкаОбъект.Организация = ОрганизацияЛГ  Тогда
		//	ЗаявкаОбъект.СтавкаНДС = СтавкиНДС[ЗаявкаОбъект.Организация]; 	
		Если ЗаявкаОбъект.Дата >= Дата("20260101") И (ЗаявкаОбъект.Организация = ОрганизацияЛГ ИЛИ ЗаявкаОбъект.Организация = ОрганизацияОЛ)  Тогда 
			ЗаявкаОбъект.СтавкаНДС = Перечисления.СтавкиНДС.НДС22;  
		Иначе
			ЗаявкаОбъект.СтавкаНДС = СтавкиНДС[ЗаявкаОбъект.Организация];
		КонецЕсли;
		//-- Ким Виктор 22.12.2025
       
		//СтавкаНДСЧисло = УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(Выборка.СтавкаНДС);	
		СтавкаНДСЧисло = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ПолучитьСтавкуНДС(ЗаявкаОбъект.СтавкаНДС);	  
		//// --
		
		Если Выборка.Хаб = Справочники.Логс_Хабы.ПустаяСсылка() Тогда
			ЗаявкаОбъект.Хаб = Справочники.Логс_Хабы.Москва; // Хаб по умолчанию
		КонецЕсли;
		
		////пока оставим 15,09,2022
		//Если НЕ Выборка.ЭтоЗабор Тогда
		//	Если Выборка.Логс_РассчитыватьНДСВРазрезеТарифов Тогда
		//		ЗаявкаОбъект.РассчитатьНДСВРазрезеТарифов();
		//	Иначе
		//		ЗаявкаОбъект.АгентскоеДоставка = ЗаявкаОбъект.ПолнаяСтоимость - (ЗаявкаОбъект.КассовоеОбслуживание + ЗаявкаОбъект.Эквайринг);
		//		ЗаявкаОбъект.АгентскоеДоставкаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
		//			ЗаявкаОбъект.АгентскоеДоставка,
		//			СтавкаНДСЧисло,
		//			Ложь);
		//		ЗаявкаОбъект.АгентскоеДоставкаСНДС = ЗаявкаОбъект.АгентскоеДоставка + ЗаявкаОбъект.АгентскоеДоставкаНДС;
		//		
		//		ЗаявкаОбъект.СУДСНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
		//			Выборка.КассовоеОбслуживание + Выборка.Эквайринг,
		//			СтавкаНДСЧисло,
		//			Ложь);
		//		ЗаявкаОбъект.СУДС_СНДС = Выборка.КассовоеОбслуживание + Выборка.Эквайринг + ЗаявкаОбъект.СУДСНДС;		

		//		Если Выборка.Логс_ПриемДСвУПДОтдельнойСтрокой Тогда
		//			ЗаявкаОбъект.ПолнаяСтоимостьНДС = ЗаявкаОбъект.СУДСНДС + ЗаявкаОбъект.АгентскоеДоставкаНДС;
		//			ЗаявкаОбъект.ПолнаяСтоимостьСНДС = ЗаявкаОбъект.ПолнаяСтоимость + ЗаявкаОбъект.ПолнаяСтоимостьНДС;
		//		Иначе
		//			ЗаявкаОбъект.ПолнаяСтоимостьНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
		//				Выборка.ПолнаяСтоимость,
		//				СтавкаНДСЧисло,
		//				Ложь);
		//			ЗаявкаОбъект.ПолнаяСтоимостьСНДС = ЗаявкаОбъект.ПолнаяСтоимость + ЗаявкаОбъект.ПолнаяСтоимостьНДС;
		//		КонецЕсли;
		//	КонецЕсли;	
		//		
		//	ЗаявкаОбъект.КПеречислению =
		//		?(ЗаявкаОбъект.ФормаОплаты = Перечисления.Логс_ФормыОплатыУслугАгенту.Оплата100,
		//			Выборка.НаложенныйПлатеж,
		//			Выборка.НаложенныйПлатеж - ЗаявкаОбъект.ПолнаяСтоимостьСНДС
		//		);
		//Иначе
		//	Если Выборка.Логс_РассчитыватьНДСВРазрезеТарифов Тогда
		//		ЗаявкаОбъект.РассчитатьНДСВРазрезеТарифов();
		//	Иначе
		//		ЗаявкаОбъект.ПолнаяСтоимостьНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
		//			ЗаявкаОбъект.ПолнаяСтоимость,
		//			Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ПолучитьСтавкуНДС(ЗаявкаОбъект.СтавкаНДС),
		//			Ложь);
		//		ЗаявкаОбъект.ПолнаяСтоимостьСНДС = ЗаявкаОбъект.ПолнаяСтоимость + ЗаявкаОбъект.ПолнаяСтоимостьНДС;

		//		ЗаявкаОбъект.КПеречислению =
		//			?(ЗаявкаОбъект.ФормаОплаты = Перечисления.Логс_ФормыОплатыУслугАгенту.Оплата100,
		//				0,
		//				-ЗаявкаОбъект.ПолнаяСтоимостьСНДС
		//			);
		//	КонецЕсли;
		//		
		//КонецЕсли;
		
		Если Выборка.Логс_РассчитыватьНДСВРазрезеТарифов Тогда
			//++ Ким Виктор 16.04.2025
			//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-16074
			//Если Выборка.СортировкаАгента <> 0 или Выборка.НадбавкаАгента <> 0 или 
			//	Выборка.ГарантированнаяДоставка <> 0 или Выборка.ОжиданиеКурьера <> 0 или 
			//	Выборка.ОплатаПарковкиАгента <> 0 Тогда 
			Если  Выборка.Статус <> "Отмена" И Выборка.Статус <> "Полный отказ" 
				//ШОП ТВ ООО (Справочник.Контрагенты) 
				И Выборка.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("0fef8649-2b0e-11eb-810c-000c29986c98")) Тогда
				
				СтруктураЗаписи = РегистрыСведений.Логс_РеквизитыЗаявкиНаДоставку.ПолучитьСтруктуруЗаписи();	
				
				ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Выборка, "СортировкаАгента, НадбавкаАгента, 
				| ГарантированнаяДоставка, ОжиданиеКурьера, ОплатаПарковкиАгента" );
				//СтруктураЗаписи.ЗаявкаНаДоставку = ЗаявкаОбъект.Ссылка;
				//СтруктураЗаписи.СтавкаНДСЧисло = СтавкаНДСЧисло;
				ЗаявкаОбъект.РассчитатьНДСВРазрезеТарифов(СтруктураЗаписи);
			Иначе
				ЗаявкаОбъект.РассчитатьНДСВРазрезеТарифов();
			КонецЕсли;
			//-- Ким Виктор  16.04.2025
			
		Иначе
			ЗаявкаОбъект.АгентскоеДоставка = ЗаявкаОбъект.ПолнаяСтоимость - (ЗаявкаОбъект.КассовоеОбслуживание + ЗаявкаОбъект.Эквайринг + ЗаявкаОбъект.ПриемДСпоСБП);
			ЗаявкаОбъект.АгентскоеДоставкаНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
				ЗаявкаОбъект.АгентскоеДоставка,
				СтавкаНДСЧисло,
				Ложь);
			ЗаявкаОбъект.АгентскоеДоставкаСНДС = ЗаявкаОбъект.АгентскоеДоставка + ЗаявкаОбъект.АгентскоеДоставкаНДС;
			
			Если НЕ Выборка.ЭтоЗабор Тогда
				ЗаявкаОбъект.СУДСНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
					Выборка.КассовоеОбслуживание + Выборка.Эквайринг,
					СтавкаНДСЧисло,
					Ложь);
				ЗаявкаОбъект.СУДС_СНДС = Выборка.КассовоеОбслуживание + Выборка.Эквайринг + ЗаявкаОбъект.ПриемДСпоСБП + ЗаявкаОбъект.СУДСНДС;		
			КонецЕсли; 
				
			Если Выборка.Логс_ПриемДСвУПДОтдельнойСтрокой Тогда
				ЗаявкаОбъект.ПолнаяСтоимостьНДС = ЗаявкаОбъект.СУДСНДС + ЗаявкаОбъект.АгентскоеДоставкаНДС;
				ЗаявкаОбъект.ПолнаяСтоимостьСНДС = ЗаявкаОбъект.ПолнаяСтоимость + ЗаявкаОбъект.ПолнаяСтоимостьНДС;
			Иначе
				ЗаявкаОбъект.ПолнаяСтоимостьНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
					Выборка.ПолнаяСтоимость,
					СтавкаНДСЧисло,
					Ложь);
				ЗаявкаОбъект.ПолнаяСтоимостьСНДС = ЗаявкаОбъект.ПолнаяСтоимость + ЗаявкаОбъект.ПолнаяСтоимостьНДС;
			КонецЕсли;
		КонецЕсли;	
			
		ЗаявкаОбъект.КПеречислению =
			?(ЗаявкаОбъект.ФормаОплаты = Перечисления.Логс_ФормыОплатыУслугАгенту.Оплата100,
				Выборка.НаложенныйПлатеж,
				Выборка.НаложенныйПлатеж - ЗаявкаОбъект.ПолнаяСтоимостьСНДС
			);
		
		//ЗаявкаОбъект.ЗаполнитьДатуФормированияСвода();
		ЗаявкаОбъект.ДатаФормированияСвода = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.РассчитатьДатуФормированияСвода(ЗаявкаОбъект.Договор, ЗаявкаОбъект.РегиональнаяЗаявка, ЗаявкаОбъект.Дата, ЗаявкаОбъект.Статус, ЗаявкаОбъект.ПолнаяСтоимость>0);
		
		Если НЕ Выборка.ЭтоЗабор и (Выборка.Логс_ЗагружатьТоварыВЗаявке или Выборка.Логс_ЗагружатьДополнительныеПоляЗаявок) Тогда
			Попытка
				ДеталиЗаявки = ПолучитьДеталиЗаявки(Выборка.НомерЗаказа);
			Исключение
				ДеталиЗаявки = Новый Структура;
			КонецПопытки;
		КонецЕсли;
		
		//Если ЗаявкаОбъект.Договор.Логс_ЗагружатьТоварыВЗаявке Тогда
		Если Выборка.Логс_ЗагружатьТоварыВЗаявке и НЕ Выборка.ЭтоЗабор и ДеталиЗаявки.Свойство("Товары") Тогда
		
			//Попытка
			//	ТоварыЗаявки = ПолучитьТоварыЗаявки(Выборка.НомерЗаказа);
			//Исключение
			//	ТоварыЗаявки = Неопределено;
			//КонецПопытки;
			
			//Если ТоварыЗаявки <> Неопределено Тогда
				ЗаявкаОбъект.Товары.Очистить();
				
				Для каждого ДанныеТовара Из ДеталиЗаявки.Товары Цикл
					СтрокаТовар = ЗаявкаОбъект.Товары.Добавить();
					//СтрокаТовар.КодТовара = ДанныеТовара.artname;
					СтрокаТовар.КодТовара = ДанныеТовара.articul;
					//СтрокаТовар.СтатусПередачи = ДанныеТовара.goodStatus;
					СтрокаТовар.СтатусПередачи = ?(ДанныеТовара.is_cancel = 1 или ДанныеТовара.is_cancel = "1",
						НСтр("ru='Возвращен'"), НСтр("ru='Вручен'"));
					СтрокаТовар.Стоимость = Число(ДанныеТовара.price) * Число(ДанныеТовара.Count);
					СтрокаТовар.Цена = Число(ДанныеТовара.price);
					СтрокаТовар.Количество = Число(ДанныеТовара.Count);
					СтрокаТовар.НаименованиеТовара = ДанныеТовара.artname;
					//СтрокаТовар.НаложенныйПлатеж = ДанныеТовара.price_client;
					Если ДанныеТовара.is_cancel = 1 или ДанныеТовара.is_cancel = "1" Тогда
						СтрокаТовар.ЧастичныйВозврат = СтрокаТовар.Стоимость;
					Иначе
						Если ЗаявкаОбъект.НаложенныйПлатеж <> 0 Тогда
							СтрокаТовар.НаложенныйПлатеж = СтрокаТовар.Стоимость;
						КонецЕсли;	
					КонецЕсли;	
				КонецЦикла;
			//КонецЕсли;
		КонецЕсли;	
		
		Если Выборка.Логс_ЗагружатьДополнительныеПоляЗаявок и НЕ Выборка.ЭтоЗабор и ДеталиЗаявки.Свойство("КлиентскиеПоля") Тогда
			Если ДеталиЗаявки.КлиентскиеПоля.Количество()>0 Тогда
				ЗаявкаОбъект.СкладОтправителя = ДеталиЗаявки.КлиентскиеПоля.short_name_factory;
			КонецЕсли;
		КонецЕсли;
		Если Выборка.Логс_ЗагружатьДополнительныеПоляЗаявок и НЕ Выборка.ЭтоЗабор и ДеталиЗаявки.Свойство("Адреса") Тогда
			ЗаполнитьЗначенияСвойств(ЗаявкаОбъект, ДеталиЗаявки.Адреса, "АдресСкладаОтправителя,ГородСкладаОтправителя,ГородСкладаОтправителя,ГородДоставки,РегионДоставки");
		КонецЕсли;

		//работа с транзакцией
		Если НЕ ТекущееКоличествоВТранзакции = 0 И Выборка.ОбрабатыватьВнеТранзакции Тогда
			ЗафиксироватьТранзакцию();
			ТекущееКоличествоВТранзакции = 0;
		КонецЕсли;			
		
		Если ТекущееКоличествоВТранзакции = 0 И НЕ Выборка.ОбрабатыватьВнеТранзакции Тогда
			НачатьТранзакцию();
		КонецЕсли;
		
		                  //этот мутный код зачем-то сначала записывал новый док, а потом проводил
		Если ЗаявкаОбъект.ЭтоНовый() Тогда
			Попытка
				ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
			Исключение
				
				ТекстСообщения = СтрШаблон(
					НСтр("ru='Произошла ошибка при импорте заявки № %1 от %2: %3'"),
					ЗаявкаОбъект.Номер, ЗаявкаОбъект.Дата,
					КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					
				ЗаписьЖурналаРегистрации("Обмен с CRM. Загрузка заявок",
					УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
				СписокОшибок.Добавить(Новый Структура("ТекстОшибки,КлючДанных",
					ТекстСообщения, ЗаявкаОбъект.Ссылка));
				
				Продолжить;
				
			КонецПопытки;
		Иначе
			Попытка
				
				ЗаявкаОбъект.Записать(РежимЗаписиДокумента.Проведение);
				
			Исключение
				
				ТекстСообщения = СтрШаблон(
					НСтр("ru='Произошла ошибка при обновлении данных заявки № %1 от %2: %3'"),
					ЗаявкаОбъект.Номер, ЗаявкаОбъект.Дата,
					КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					
				ЗаписьЖурналаРегистрации("Обмен с CRM. Загрузка заявок",
					УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
				СписокОшибок.Добавить(Новый Структура("ТекстОшибки,КлючДанных",
					ТекстСообщения, ЗаявкаОбъект.Ссылка));
				
				Продолжить;
				
			КонецПопытки;
		КонецЕсли;
		
		//++ Ким Виктор 31.03.2025
		//Запишем новые реквизиты в регистр сведений
		//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-16074
		//Если Выборка.СортировкаАгента <> 0 или Выборка.НадбавкаАгента <> 0 или 
		//	Выборка.ГарантированнаяДоставка <> 0 или Выборка.ОжиданиеКурьера <> 0 или 
		//	Выборка.ОплатаПарковкиАгента <> 0 Тогда 
		Если  Выборка.Статус <> "Отмена" и Выборка.Статус <> "Полный отказ" 
			//ШОП ТВ ООО (Справочник.Контрагенты) 
			И Выборка.Контрагент = Справочники.Контрагенты.ПолучитьСсылку(Новый УникальныйИдентификатор("0fef8649-2b0e-11eb-810c-000c29986c98")) Тогда
			
			СтруктураЗаписи = РегистрыСведений.Логс_РеквизитыЗаявкиНаДоставку.ПолучитьСтруктуруЗаписи();	
			
			ЗаполнитьЗначенияСвойств(СтруктураЗаписи, Выборка, "СортировкаАгента, НадбавкаАгента, 
			| ГарантированнаяДоставка, ОжиданиеКурьера, ОплатаПарковкиАгента" );
			СтруктураЗаписи.ЗаявкаНаДоставку = ЗаявкаОбъект.Ссылка;
			СтруктураЗаписи.СтавкаНДСЧисло = СтавкаНДСЧисло;
			ЗаписатьНовыйРеквизиты(СтруктураЗаписи);
			
		КонецЕсли;
		//-- Ким Виктор 31.03.2025
		
		//++ Ким Виктор 29.01.2026
		//Доработка расшифровки отчета агента для СМ(Остин)
		Если  Выборка.Партнер.Логс_ГруппаКомпанийКлиента = Справочники.Логс_ГруппыКомпанийКлиентов.ПолучитьСсылку(Новый УникальныйИдентификатор("36dccc0e-5282-11ec-9403-00505696b95d")) Тогда 
			
			СтрукутраЗаписиСпецРеквизитов = РегистрыСведений.Логс_СпецифическиеРеквизитыЗаявкиНаДоставку.ПолучитьСтруктуруЗаписи();   
			ЗаполнитьЗначенияСвойств(СтрукутраЗаписиСпецРеквизитов, Выборка, "ХабОтправителя, ХабПолучателя, ЛыжиИлиНеЛыжи");
			СтрукутраЗаписиСпецРеквизитов.ЗаявкаНаДоставку = ЗаявкаОбъект.Ссылка;
			ЗаписатьНовыеСпецифическиеРеквизиты(СтрукутраЗаписиСпецРеквизитов);
			
		КонецЕсли;
		//-- Ким Виктор 29.01.2026
				
		Если НЕ Выборка.ОбрабатыватьВнеТранзакции Тогда
			ТекущееКоличествоВТранзакции = ТекущееКоличествоВТранзакции+1;
		КонецЕсли;	
			
		Если ТекущееКоличествоВТранзакции = РазмерТранзакции Тогда
			ЗафиксироватьТранзакцию();
			ТекущееКоличествоВТранзакции = 0;
		КонецЕсли;
		
		Если СтруктураЗаписиКоллизии.Количество()>0 Тогда
			НоваяКоллизия = Коллизии.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяКоллизия, СтруктураЗаписиКоллизии);
			НоваяКоллизия.Заявка = ЗаявкаОбъект.Ссылка;
			НоваяКоллизия.ДатаЗагрузки = ДатаЗагрузки;
		КонецЕсли;
			
	КонецЦикла; 
	
	Если ТекущееКоличествоВТранзакции >0 Тогда
		ЗафиксироватьТранзакцию();
		ТекущееКоличествоВТранзакции = 0;
	КонецЕсли;
	
	Если Коллизии.Количество()>0 Тогда
		Коллизии.Записать(Истина);
	КонецЕсли;
	
	// Удаление заявок, отсутствующих в загрузке (в CRM изменился статус на НЕ конечный).
	Если Не ЗначениеЗаполнено(НомерЗаявки) И ТДРегион = Неопределено Тогда
		Выборка = РезультатЗапроса[4].Выбрать();
		Пока Выборка.Следующий() Цикл
			
			ЗаявкаОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			Попытка
				
				ЗаявкаОбъект.УстановитьПометкуУдаления(Истина);
				
			Исключение
				
				ТекстСообщения = СтрШаблон(
					НСтр("ru='Произошла ошибка при пометке на удаление заявки № %1 от %2: %3'"),
					ЗаявкаОбъект.Номер, ЗаявкаОбъект.Дата,
					КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					
				ЗаписьЖурналаРегистрации("Обмен с CRM. Загрузка заявок", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
				СписокОшибок.Добавить(Новый Структура("ТекстОшибки,КлючДанных", ТекстСообщения, ЗаявкаОбъект.Ссылка));
				
			КонецПопытки;
			
		КонецЦикла;
	КонецЕсли;	
	
	Возврат СписокОшибок.Количество() = 0;
	
КонецФункции

Функция СоздатьТаблицуЗаявок()
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ТипЗаявки", Новый ОписаниеТипов("ПеречислениеСсылка.Логс_ТипыЗаявокНаДоставку"));
	Таблица.Колонки.Добавить("ИдентификаторКлиента", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(20)));
	Таблица.Колонки.Добавить("Организация", Новый ОписаниеТипов("СправочникСсылка.Организации"));
	Таблица.Колонки.Добавить("Партнер", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	Таблица.Колонки.Добавить("Контрагент", Новый ОписаниеТипов("СправочникСсылка.Контрагенты"));
	Таблица.Колонки.Добавить("Договор", Новый ОписаниеТипов("СправочникСсылка.ДоговорыКонтрагентов"));
	Таблица.Колонки.Добавить("НалогообложениеНДС", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыНалогообложенияНДС"));
	Таблица.Колонки.Добавить("ФормаОплаты", Новый ОписаниеТипов("ПеречислениеСсылка.Логс_ФормыОплатыУслугАгенту"));
	Таблица.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	Таблица.Колонки.Добавить("ИдентификаторКурьера", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(20)));
	Таблица.Колонки.Добавить("ДатаДоставки", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Таблица.Колонки.Добавить("ДатаДоставкиПлан", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Таблица.Колонки.Добавить("НомерЗаказа", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(20)));
	Таблица.Колонки.Добавить("НомерЗаказаКлиента", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(50)));
	Таблица.Колонки.Добавить("Статус", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(20)));
	Таблица.Колонки.Добавить("IDЗона", ОбщегоНазначения.ОписаниеТипаСтрока(3));
	Таблица.Колонки.Добавить("КодРегиона", ОбщегоНазначения.ОписаниеТипаСтрока(3));
	Таблица.Колонки.Добавить("РегиональнаяЗаявка", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("Приоритет", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	Таблица.Колонки.Добавить("ТипКурьера", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	Таблица.Колонки.Добавить("Вес", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	Таблица.Колонки.Добавить("КоличествоМест", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3,0)));
	Таблица.Колонки.Добавить("РасстояниеОтМКАД", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ОценочнаяСтоимость", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("НаложенныйПлатеж", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("Тариф", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ПовторнаяДоставка", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("КассовоеОбслуживание", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("Эквайринг", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("Страхование", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("Комплектация", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("Этикирование", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("Прозвон", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("СМС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ОбработкаВозврата", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("Обмен", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ЗаносКГТ", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ВозвратныеДокументы", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ПолнаяСтоимость", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("СтавкаНДС", Новый ОписаниеТипов("ПеречислениеСсылка.СтавкиНДС"));
	Таблица.Колонки.Добавить("ПолнаяСтоимостьНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ПолнаяСтоимостьСНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("КПеречислению", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ОплатаНаличные", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ОплатаСБП", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ВозвратНаличные", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("СтоимостьЗаказа", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ДатаЗабора", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Таблица.Колонки.Добавить("ДатаВозврата", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Таблица.Колонки.Добавить("СуммаВозврата", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("СтоимостьЗаказаПолная", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("СтоимостьДоставкиПринципала", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ЧастичныйВозвратОтКлиента", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ОбработкаЧастичногоВыкупа", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ПриемДСпоСБП", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ОжиданиеНаАдресе", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ОплатаПарковки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("СУДСНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("СУДС_СНДС", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("Город", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Таблица.Колонки.Добавить("ТДРегион", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("ЭтоЗабор", Новый ОписаниеТипов("Булево"));
	Таблица.Колонки.Добавить("АгентРегион", Новый ОписаниеТипов("СправочникСсылка.Партнеры"));
	Таблица.Колонки.Добавить("ОбъемныйВес", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
	Таблица.Колонки.Добавить("КоличествоПопытокДоставки", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3,0)));
	Таблица.Колонки.Добавить("Ошибка", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(250)));
	Таблица.Колонки.Добавить("Хаб", Новый ОписаниеТипов("СправочникСсылка.Логс_Хабы"));
	Таблица.Колонки.Добавить("ЗонаДоставки", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(200)));
	Таблица.Колонки.Добавить("АдресДоставки", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки()));
	Таблица.Колонки.Добавить("ФИОКонтактногоЛицаЗаказчика", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(250)));
	Таблица.Колонки.Добавить("ДатаПоступленияНаСклад", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Таблица.Колонки.Добавить("СуммаКлиентскогоВозврата", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("СуммаКлиентскогоОбмена", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ПроверкаПоврежденийТовара", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ИнтервалДоставкиНачало", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2,0)));
	Таблица.Колонки.Добавить("ИнтервалДоставкиОкончание", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(2,0)));
	Таблица.Колонки.Добавить("ПровайдерЧека", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки(250)));
	Таблица.Колонки.Добавить("ДатаЧека", Новый ОписаниеТипов("Дата",,, Новый КвалификаторыДаты(ЧастиДаты.Дата)));
	Таблица.Колонки.Добавить("АдресСкладаОтправителя", Новый ОписаниеТипов("Строка",, Новый КвалификаторыСтроки()));
	//++ Ким Виктор 03.06.2024
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-13505
	Таблица.Колонки.Добавить("ТипДоставки", Новый ОписаниеТипов("СправочникСсылка.Логс_ТипыДоставок"));
	//-- Ким Виктор 03.06.2024  
	//++ Ким Виктор 22.07.2024
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-13948
	Таблица.Колонки.Добавить("МагистральноеПеремещение", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("Хранение", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	//-- Ким Виктор 22.07.2024  
	
	//++ Ким Виктор 31.03.2025
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-16074
	Таблица.Колонки.Добавить("СортировкаАгента", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("НадбавкаАгента", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ГарантированнаяДоставка", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ОжиданиеКурьера", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	Таблица.Колонки.Добавить("ОплатаПарковкиАгента", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,2)));
	//-- Ким Виктор 31.03.2025 
	
	//++ Ким Виктор 30.01.2026
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-18411
	Таблица.Колонки.Добавить("ХабОтправителя", Новый ОписаниеТипов("СправочникСсылка.Логс_Хабы"));
	Таблица.Колонки.Добавить("ХабПолучателя",  Новый ОписаниеТипов("СправочникСсылка.Логс_Хабы"));
	Таблица.Колонки.Добавить("ЛыжиИлиНеЛыжи",  Новый ОписаниеТипов("Булево"));
    //-- Ким Виктор 30.01.2026
		
	     
	Возврат Таблица;
КонецФункции 

Процедура ДобавитьМассивЗаявокВТаблицуЗначенийВерсия2(ТаблицаЗаявок, СводЗаявок)
	//ПартнерИЛ = Справочники.Партнеры.НайтиПоНаименованию("ИНТЕРНЕТ ЛОГИСТИКА ООО", Истина);
	//ПартнерКГТ = Справочники.Партнеры.НайтиПоНаименованию("КГТ Доставка ООО", Истина);
	ТипыЗаявок = Новый Соответствие;
	ТипыЗаявок.Вставить(0, Перечисления.Логс_ТипыЗаявокНаДоставку.Доставка);
	ТипыЗаявок.Вставить(1, Перечисления.Логс_ТипыЗаявокНаДоставку.Обмен);
	ТипыЗаявок.Вставить(2, Перечисления.Логс_ТипыЗаявокНаДоставку.Возврат);
	
	
	//Если НЕ ЗначениеЗаполнено(ПартнерКГТ) Тогда
	//	КонтрагентКГТ = Справочники.Контрагенты.НайтиПоРеквизиту("ИНН", "7727468725");
	//	Если ЗначениеЗаполнено(КонтрагентКГТ) Тогда
	//		ПартнерКГТ = КонтрагентКГТ.Партнер;
	//	КонецЕсли;
	//КонецЕсли;       
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать Хабы.Ссылка как Хаб, Хабы.Агент как Агент из Справочник.Логс_Хабы как Хабы ГДЕ Хабы.ЯвляетсяСКС";
	СоответствиеТД = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СоответствиеТД.Вставить(Выборка.Хаб, Выборка.Агент);
	КонецЦикла;
	
	Для каждого Заявки Из СводЗаявок.Своды Цикл
		
		// если есть отбор по ТД регион
		Если Заявки.is_regional <> "0" и Заявки.is_regional <> 0 Тогда
			ТДРегионСРМ = Истина;
		Иначе	
			ТДРегионСРМ = Ложь;	
		КонецЕсли;
		СтрокаЗаявка = ТаблицаЗаявок.Добавить();
		СтрокаЗаявка.ЭтоЗабор = Ложь;
		
		СтрокаЗаявка.ОплатаСБП = ?(Заявки.is_SBP = Истина или Заявки.is_SBP = "true", Истина, Ложь);
		//ВключенаТарификацияСБП = (Заявки.has_sbp_tariffication = 1 или has_sbp_tariffication = "1");
		
		СтрокаЗаявка.ТипЗаявки = ТипыЗаявок[Заявки.is_client_return];
		                        
		СтрокаЗаявка.ДатаДоставки = ПреобразоватьДатуJSON(Заявки.delivery_date);
		СтрокаЗаявка.ДатаДоставкиПлан = ПреобразоватьДатуJSON(Заявки.plan_delivery_date);
		СтрокаЗаявка.НомерЗаказа = СокрЛП(Заявки.order_id);
		СтрокаЗаявка.ИдентификаторКлиента = СокрЛП(Заявки.client_id);
		СтрокаЗаявка.Статус = Заявки.status;
		СтрокаЗаявка.КоличествоМест = Заявки.places_count;
		СтрокаЗаявка.Вес = Заявки.weight;
		СтрокаЗаявка.ОбъемныйВес = Заявки.dimension_weight;
		СтрокаЗаявка.РасстояниеОтМКАД = Заявки.mkad_distance;
		СтрокаЗаявка.ОценочнаяСтоимость = Заявки.os;
		СтрокаЗаявка.СтоимостьЗаказа = СтрокаВЧисло(Заявки.price_first);
		СтрокаЗаявка.ДатаЗабора = ПреобразоватьДатуJSON(Заявки.akt_on_ware_date);
		СтрокаЗаявка.ДатаВозврата = ПреобразоватьДатуJSON(Заявки.akt_to_back_cli);
		СтрокаЗаявка.СуммаВозврата = Заявки.goodsSumma;
		СтрокаЗаявка.IDЗона = Заявки.zone_id;
		СтрокаЗаявка.КодРегиона = Заявки.region_code;
		СтрокаЗаявка.Приоритет = Заявки.pay_type;
		СтрокаЗаявка.ТипКурьера = Заявки.courier_type;
		//СтрокаЗаявка.РегиональнаяЗаявка = (СтрокаЗаявка.КодРегиона <> "77"
		//									И СтрокаЗаявка.КодРегиона <> "50");
		//++ Ким Виктор 27.09.2024
		//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-14541
		//СтрокаЗаявка.РегиональнаяЗаявка = НЕ Логс_ДополнительныеПроцедурыИФункцииПовтИсп.КодРегионаПринадлежитХабам(СтрокаЗаявка.КодРегиона);
		СтрокаЗаявка.Хаб = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ПолучитьХабПоИД(Заявки.hub_destination_id);
		//Это нужно для разделения заявок по сводам. Если это региональная заявка, то отдельный свод.
		//Постаматы,ПВЗ тоже в отдельный свод.
		СтрокаЗаявка.РегиональнаяЗаявка = Заявки.is_regional = 1;
		//-- Ким Виктор 27.09.2024
		//++ Ким Виктор 03.06.2024
		//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-13505
		СтрокаЗаявка.ТипДоставки  = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ПолучитьТипДоставкиПоИД(Заявки.delivery_type_id);
		//-- Ким Виктор 03.06.2024
		
		Если Заявки.Свойство("inner_n") Тогда
			СтрокаЗаявка.НомерЗаказаКлиента = Заявки.inner_n;
		КонецЕсли; 
		МассивГород = Заявки.city;
		Если ТипЗнч(МассивГород) = Тип("Массив") И МассивГород.Количество() > 0 Тогда
			СтрокаЗаявка.Город = МассивГород[0];
		КонецЕсли;
		СтрокаЗаявка.СтоимостьДоставкиПринципала = Заявки.price_client_delivery;
		
		СтрокаЗаявка.НаложенныйПлатеж = Заявки.price_client;
		СтрокаЗаявка.Тариф = Заявки.pd_tar;
		СтрокаЗаявка.КассовоеОбслуживание = Заявки.pd_ko;
		СтрокаЗаявка.Эквайринг = Заявки.pd_eq;
		СтрокаЗаявка.Страхование = Заявки.pd_dop_strah;
		СтрокаЗаявка.Комплектация = Заявки.pd_dop_compl;
		СтрокаЗаявка.Упаковка = Заявки.pd_dop_pack;
		СтрокаЗаявка.Этикирование = Заявки.pd_label;
		СтрокаЗаявка.Прозвон = Заявки.pd_call;
		СтрокаЗаявка.СМС = Заявки.pd_sms;
		//СтрокаЗаявка.ОбработкаВозврата = СтрокаВЧисло(Заявки.pd_dop_vozvrat);  // pd_dop_vozvrat - архивные данные, не используются
		СтрокаЗаявка.Обмен = Заявки.pd_change;
		СтрокаЗаявка.ЗаносКГТ = Заявки.pd_kgt_tar;
		СтрокаЗаявка.ВозвратныеДокументы = Заявки.pd_docs_return;
		//СтрокаЗаявка.ОбработкаВозврата = ?(СтрокаЗаявка.РегиональнаяЗаявка, СтрокаВЧисло(Заявки.pd_return),0);
		//СтрокаЗаявка.ОбработкаЧастичногоВыкупа = ?(СтрокаЗаявка.РегиональнаяЗаявка, 0, СтрокаВЧисло(Заявки.pd_return));
		СтрокаЗаявка.ОбработкаВозврата = Заявки.pd_return;
		СтрокаЗаявка.ОбработкаЧастичногоВыкупа = Заявки.pd_buyback;
		СтрокаЗаявка.КоличествоПопытокДоставки = Заявки.delivery_count;
		СтрокаЗаявка.СуммаКлиентскогоВозврата = Заявки.tariff_client_return;
		СтрокаЗаявка.СуммаКлиентскогоОбмена = Заявки.tariff_client_exchange;
		//++ Ким Виктор 22.07.2024
		//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-13948
		//тариф за хранение "warehouse_storing_tariff": 8991,
		//тариф за магистральное перемещение "backbone_transit_tariff": 30
		СтрокаЗаявка.МагистральноеПеремещение = Заявки.backbone_transit_tariff;
		СтрокаЗаявка.Хранение = Заявки.warehouse_storing_tariff;
		//-- Ким Виктор 22.07.2024    
		
		//++ Ким Виктор 31.03.2025
		//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-16074
		СтрокаЗаявка.СортировкаАгента 		 = Заявки.tariff_l_sort;
		СтрокаЗаявка.НадбавкаАгента    		 = Заявки.tariff_l_weight;
		СтрокаЗаявка.ГарантированнаяДоставка = Заявки.tariff_l_next_day;
		СтрокаЗаявка.ОжиданиеКурьера		 = Заявки.tariff_l_waiting;
		СтрокаЗаявка.ОплатаПарковкиАгента	 = Заявки.tariff_l_parking;
		//-- Ким Виктор 31.03.2025
		
		
		СтрокаЗаявка.ПроверкаПоврежденийТовара = Заявки.pd_damage_check;
		СтрокаЗаявка.ПриемДСпоСБП = Заявки.tariff_sbp_payment;
		СтрокаЗаявка.ОжиданиеНаАдресе = Заявки.tariff_waiting;    
		СтрокаЗаявка.ОплатаПарковки = Заявки.pd_parking;    
		СтрокаЗаявка.ТДРегион = ТДРегионСРМ;	
		//Если СтрокаЗаявка.ТДРегион Тогда
		//	СтрокаЗаявка.АгентРегион = ПартнерИЛ;//Справочники.Партнеры.НайтиПоНаименованию("ИНТЕРНЕТ ЛОГИСТИКА", Истина);
		//ИначеЕсли СтрокаЗаявка.Хаб = Справочники.Логс_Хабы.КГТ Тогда
		//	СтрокаЗаявка.АгентРегион = ПартнерКГТ;
		//Иначе
		//	СтрокаЗаявка.АгентРегион = Справочники.Партнеры.ПустаяСсылка();
		//КонецЕсли;	                                    
		СтрокаЗаявка.АгентРегион = СоответствиеТД[СтрокаЗаявка.Хаб];		
		
		СтрокаЗаявка.ПовторнаяДоставка = Заявки.re_delivery;
			
		СтрокаЗаявка.ПолнаяСтоимость = СтрокаЗаявка.Тариф + СтрокаЗаявка.ПовторнаяДоставка +
			СтрокаЗаявка.КассовоеОбслуживание + СтрокаЗаявка.Эквайринг + СтрокаЗаявка.Страхование + 
			СтрокаЗаявка.ЗаносКГТ + СтрокаЗаявка.ВозвратныеДокументы + СтрокаЗаявка.СМС +
			СтрокаЗаявка.Прозвон + СтрокаЗаявка.ОбработкаЧастичногоВыкупа + СтрокаЗаявка.ОбработкаВозврата +
			СтрокаЗаявка.СуммаКлиентскогоВозврата + СтрокаЗаявка.СуммаКлиентскогоОбмена +
			СтрокаЗаявка.ПриемДСпоСБП + СтрокаЗаявка.ПроверкаПоврежденийТовара + 
			СтрокаЗаявка.ОплатаПарковки + СтрокаЗаявка.ОжиданиеНаАдресе +
			СтрокаЗаявка.МагистральноеПеремещение + СтрокаЗаявка.Хранение + 
			//++ Ким Виктор 31.03.2025
			//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-16074
			СтрокаЗаявка.СортировкаАгента + СтрокаЗаявка.НадбавкаАгента + 
			СтрокаЗаявка.ГарантированнаяДоставка  +  СтрокаЗаявка.ОжиданиеКурьера +
			СтрокаЗаявка.ОплатаПарковкиАгента;
			//-- Ким Виктор 31.03.2025
			 
		
		Если Заявки.Свойство("courier_id") И ЗначениеЗаполнено(Заявки.courier_id) Тогда
			СтрокаЗаявка.ИдентификаторКурьера = Заявки.courier_id;
		КонецЕсли; 
		
		Если Заявки.Свойство("card")
				И Заявки.card = "Оплата наличными"
				И СтрокаЗаявка.НаложенныйПлатеж <> 0 Тогда
			
			СтрокаЗаявка.ОплатаНаличные = Истина;
			СтрокаЗаявка.ВозвратНаличные = Истина;
			
		КонецЕсли;
		Если СтрокаЗаявка.ДатаДоставки > Дата('3999.12.31 23:59:59') Тогда
			СтрокаЗаявка.Ошибка = СтрокаЗаявка.Ошибка + "Дата доставки,";
			СтрокаЗаявка.ДатаДоставки = Дата(1,1,1);
		КонецЕсли;
		Если СтрокаЗаявка.ДатаДоставкиПлан > Дата('3999.12.31 23:59:59') Тогда
			СтрокаЗаявка.Ошибка = СтрокаЗаявка.Ошибка + "ДатаДоставкиПлан,";
			СтрокаЗаявка.ДатаДоставкиПлан = Дата(1,1,1);
		КонецЕсли;
		Если СтрокаЗаявка.ДатаЗабора > Дата('3999.12.31 23:59:59') Тогда
			СтрокаЗаявка.Ошибка = СтрокаЗаявка.Ошибка + "ДатаЗабора,";
			СтрокаЗаявка.ДатаЗабора = Дата(1,1,1);
		КонецЕсли;
		Если СтрокаЗаявка.ДатаВозврата > Дата('3999.12.31 23:59:59') Тогда
			СтрокаЗаявка.Ошибка = СтрокаЗаявка.Ошибка + "ДатаВозврата,";
			СтрокаЗаявка.ДатаВозврата = Дата(1,1,1);
		КонецЕсли;
			
		СтрокаЗаявка.ЗонаДоставки = ?(ЗначениеЗаполнено(Заявки.zone_group_id), Заявки.zone_group_id, Неопределено);
		СтрокаЗаявка.АдресДоставки = Заявки.target_address;
		СтрокаЗаявка.ФИОКонтактногоЛицаЗаказчика = Заявки.target_name;
		СтрокаЗаявка.ДатаПоступленияНаСклад = ПреобразоватьДатуJSON(Заявки.stock_datetime);
		СтрокаЗаявка.ИнтервалДоставкиНачало = Заявки.delivery_time_start;
		СтрокаЗаявка.ИнтервалДоставкиОкончание = Заявки.delivery_time_end;
		
		СтрокаЗаявка.ДатаЧека = ПреобразоватьДатуJSON(стрзаменить(Заявки.receipt_date, " ", "T"));
		СтрокаЗаявка.ПровайдерЧека = Заявки.receipt_provider; 
				
		//++ Ким Виктор 30.01.2026
		//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-18411 
		СтрокаЗаявка.ХабОтправителя = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ПолучитьХабПоИД(Заявки.hub_origin_id);	
		СтрокаЗаявка.ХабПолучателя  = СтрокаЗаявка.Хаб;
		СтрокаЗаявка.ЛыжиИлиНеЛыжи  = ?(Заявки.is_ski_delivery = 1, Истина, Ложь);
		//-- Ким Виктор 30.01.2026
				
	КонецЦикла;
	
	Для каждого Заборы Из СводЗаявок.Заборы Цикл
		
		СтрокаЗаявка = ТаблицаЗаявок.Добавить();
		СтрокаЗаявка.ЭтоЗабор = Истина;
		СтрокаЗаявка.ТипЗаявки = Перечисления.Логс_ТипыЗаявокНаДоставку.Забор;
		
		СтрокаЗаявка.ДатаДоставки = ПреобразоватьДатуJSON(Заборы.delivery_date);
		СтрокаЗаявка.НомерЗаказа = Заборы.zorder_id;
		СтрокаЗаявка.Статус = Заборы.status;
		СтрокаЗаявка.ИдентификаторКлиента = Заборы.client_id;
		СтрокаЗаявка.Тариф = СтрокаВЧисло(Заборы.zprice_price_client);
			
		СтрокаЗаявка.ПолнаяСтоимость = СтрокаЗаявка.Тариф;
		
		СтрокаЗаявка.Хаб = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ПолучитьХабПоИД(Заборы.warehouse_hub_id);
		
		СтрокаЗаявка.ЗонаДоставки = ?(ЗначениеЗаполнено(Заборы.zone_group_id), Заборы.zone_group_id, Неопределено);
		
		Если Заборы.Свойство("courier_id") И ЗначениеЗаполнено(Заборы.courier_id) Тогда
			СтрокаЗаявка.ИдентификаторКурьера = Заборы.courier_id;
		КонецЕсли;				
		
		Если СтрокаЗаявка.ДатаДоставки > Дата('3999.12.31 23:59:59') Тогда
			СтрокаЗаявка.Ошибка = СтрокаЗаявка.Ошибка + "Дата доставки,";
			СтрокаЗаявка.ДатаДоставки = Дата(1,1,1);
		КонецЕсли;   
		
		СтрокаЗаявка.АдресСкладаОтправителя = Заборы.warehouse_address;
		
	КонецЦикла;
	
КонецПроцедуры
   //++ Ким Виктор 06.02.2025
   //Добавление договора по задаче https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15674
Процедура ЗаполнитьТаблицуЗаявок(ТаблицаЗаявок, Партнер, НачалоПериода, КонецПериода, НомерЗаявки, ТДРегион = Неопределено, ИДХаба = Неопределено, Договор = Неопределено)
	//-- Ким Виктор 06.02.2025
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("key", "bc47ef070acd827b5f2f8b3f202a31b6");
	ПараметрыЗапроса.Вставить("date_beg", Формат(НачалоПериода, "ДФ=yyyy-MM-dd"));
	ПараметрыЗапроса.Вставить("date_end", Формат(КонецПериода, "ДФ=yyyy-MM-dd"));
	Если ЗначениеЗаполнено(НомерЗаявки) Тогда
		Попытка
			тмп = Число(НомерЗаявки);
			ПохожеНаЗабор = Истина;    //нативные номера заборов не содержат префиксов организаций
		Исключение
			ПохожеНаЗабор = Ложь;
		КонецПопытки;
		Если СтрНачинаетсяС(НомерЗаявки, "Забор №") или ПохожеНаЗабор Тогда
			ПараметрыЗапроса.Вставить("zorder_id", СокрЛП(СтрЗаменить(НомерЗаявки, "Забор №","")));
		Иначе
			ПараметрыЗапроса.Вставить("order_id", СокрЛП(НомерЗаявки));
		КонецЕсли;
	КонецЕсли;	
	Если НЕ ТДРегион = Неопределено Тогда
		ПараметрыЗапроса.Вставить("region", ?(ТДРегион, "1", "0"));
	КонецЕсли;
	Если НЕ ИДХаба = Неопределено Тогда
		ПараметрыЗапроса.Вставить("hub_destination_id", СокрЛП(ИДХаба));
	КонецЕсли;
	
	ИДКлиентов = Новый Массив;
	Если ЗначениеЗаполнено(Партнер) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
						|	ДоговорыКонтрагентов.Логс_ИдентификаторCRM КАК ИдентификаторКлиента
						|ИЗ
						|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
						|ГДЕ
						|	ДоговорыКонтрагентов.Логс_ОбменСCRM
						|	И ДоговорыКонтрагентов.Логс_ВидДоговораCRM = ЗНАЧЕНИЕ(Перечисление.Логс_ВидыДоговоровCRM.Агентский)
						|	И ДоговорыКонтрагентов.Логс_ИдентификаторCRM <> """"
						|	И ДоговорыКонтрагентов.Партнер = &Партнер
						|	И &ТекстОтбораПоДоговору";
		Запрос.УстановитьПараметр("Партнер", Партнер);
		
		//++ Ким Виктор 06.02.2025
		//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15674
		ТекстОтбораПоДоговору = ?(ЗначениеЗаполнено(Договор),
		"ДоговорыКонтрагентов.Ссылка = &Договор",
		"ИСТИНА");
        Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтбораПоДоговору", ТекстОтбораПоДоговору);
		Запрос.УстановитьПараметр("Договор", Договор);
		//-- Ким Виктор 06.02.2025
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			ИДКлиентов.Добавить(Выборка.ИдентификаторКлиента);
		КонецЦикла;
		
		//Если Выборка.Следующий() Тогда
		//	ПараметрыЗапроса.Вставить("client_id", Выборка.ИдентификаторКлиента);
		//КонецЕсли;
	КонецЕсли;
	
	Если ИДКлиентов.Количество() = 0 Тогда
		ИДКлиентов.Добавить("");
	КонецЕсли;
	
	Для Каждого ИдентификаторКлиента из ИДКлиентов Цикл
		Если ЗначениеЗаполнено(ИдентификаторКлиента) Тогда
			ПараметрыЗапроса.Вставить("client_id", ИдентификаторКлиента);
		КонецЕсли;
		ПараметрыЗапроса.Вставить("detail", 1);
		//ПараметрыЗапроса.Удалить("first_param");   
		//ПараметрыЗапроса.Удалить("second_param");  
		ПараметрыЗапроса.Удалить("limit");   
		ПараметрыЗапроса.Удалить("offset");  
		
		Ответ = ЗапросКСерверуCRM_Альт("getOrdersAndZorders", ПараметрыЗапроса);
		
		Если Не Ответ.Свойство("response") или Не Ответ.response.Свойство("orders_count")
				Или Не Ответ.response.Свойство("zorders_count") Тогда
			ВызватьИсключение НСтр("ru='Неверный ответ от сервера CRM или ответ содержит ошибку'");
		КонецЕсли; 
		
		КоличествоЗаписей = ?(Ответ.response.Свойство("orders_count"), СтрокаВЧисло(Ответ.response.orders_count), 0)+
								?(Ответ.response.Свойство("zorders_count"), СтрокаВЧисло(Ответ.response.zorders_count), 0);
		
		ПараметрыЗапроса.Удалить("detail");
		к = 0;
		ш = Макс(100, Константы.Логс_РазмерПакетаЗагрузкиЗаявок.Получить());
		Своды = Новый Массив; Заборы = Новый Массив;
		ТС = ТекущаяДата();
		Пока к<КоличествоЗаписей Цикл
			Если ТС <= ТекущаяДата() Тогда
				//ПараметрыЗапроса.Вставить("first_param", ш);   // спасибо аршанскому за классные имена, это limit
				//ПараметрыЗапроса.Вставить("second_param", к);  // это offset
				ПараметрыЗапроса.Вставить("limit", ш);   
				ПараметрыЗапроса.Вставить("offset", к);
				
				Ответ = ЗапросКСерверуCRM_Альт("getOrdersAndZorders", ПараметрыЗапроса);
				Если Не Ответ.Свойство("response")
						И Не Ответ.Свойство("zresponse") Тогда
					ВызватьИсключение НСтр("ru='Неверный ответ от сервера CRM или ответ содержит ошибку'");
				КонецЕсли; 
				//ОбщегоНазначения.ЗаполнитьМассивУникальнымиЗначениями(Своды, ?(ТипЗнч(Ответ.response) = Тип("Массив"),
				//																Ответ.response, Новый Массив));
				//ОбщегоНазначения.ЗаполнитьМассивУникальнымиЗначениями(Заборы, ?(Ответ.Свойство("zresponse")
				//																И ТипЗнч(Ответ.zresponse) = Тип("Массив"),
				//																Ответ.zresponse, Новый Массив));
				к = к+ш;
				ТС = ТекущаяДата()+1;
				ДобавитьМассивЗаявокВТаблицуЗначенийВерсия2(ТаблицаЗаявок, 
					Новый Структура("Своды,Заборы", 
									?(ТипЗнч(Ответ.response) = Тип("Массив"),Ответ.response, Новый Массив),
									?(Ответ.Свойство("zresponse") И ТипЗнч(Ответ.zresponse) = Тип("Массив"),Ответ.zresponse, Новый Массив)));
			Иначе
			КонецЕсли;
		КонецЦикла;
	
	КонецЦикла;
КонецПроцедуры


#КонецОбласти

Функция НайтиКурьераПоИдентификатору(Идентификатор) Экспорт
	
	Возврат НайтиОбъектПоИдентификаторуCRM("Сотрудники",
		Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоИдентификаторКурьераCRM(),
		Идентификатор);
	
КонецФункции 

Функция НайтиОбъектПоИдентификаторуCRM(ВидОбъекта, СвойствоИдентификатор, Идентификатор) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДополнительныеРеквизиты.Ссылка
	|ИЗ
	|	Справочник." + ВидОбъекта + ".ДополнительныеРеквизиты КАК ДополнительныеРеквизиты
	|ГДЕ
	|	ДополнительныеРеквизиты.Свойство = &СвойствоИдентификатор
	|	И ДополнительныеРеквизиты.Значение = &Идентификатор");
	Запрос.УстановитьПараметр("СвойствоИдентификатор", СвойствоИдентификатор);
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(), Выборка.Ссылка, Неопределено);
	
КонецФункции 

Функция НайтиДоговорАгентаПоИдентификатору(Идентификатор) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Логс_ИдентификаторCRM = &Идентификатор
	|	И ДоговорыКонтрагентов.Логс_ВидДоговораCRM = ЗНАЧЕНИЕ(Перечисление.Логс_ВидыДоговоровCRM.Агентский)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДоговорыКонтрагентов.Логс_ОбменСCRM УБЫВ,
	|	ДоговорыКонтрагентов.Ссылка УБЫВ");
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(),
		Выборка.Ссылка,
		Справочники.ДоговорыКонтрагентов.ПустаяСсылка());
	
КонецФункции 
	
Функция НайтиАгентаПоИдентификатору(Идентификатор) Экспорт
	
	ДоговорАгента = НайтиДоговорАгентаПоИдентификатору(Идентификатор);
	Возврат ?(ЗначениеЗаполнено(ДоговорАгента),
		ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДоговорАгента, "Партнер"),
		Справочники.Партнеры.ПустаяСсылка());
	
КонецФункции 	

Функция ПолучитьНомерДоговораАгента() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НомераДоговоров.НомерДоговора КАК НомерДоговора
	|ИЗ
	|	РегистрСведений.Логс_НомераДоговоровАгентов КАК НомераДоговоров");
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Возврат ?(Выборка.Следующий(),
				Выборка.НомерДоговора,
				Неопределено);
	
КонецФункции 

Процедура УстановитьНомерДоговораАгента(Знач НомерДоговора) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(НомерДоговора) Тогда
		Возврат;
	КонецЕсли;
	
	НомерДоговора = Число(НомерДоговора);
	ТекНомерДоговора = ПолучитьНомерДоговораАгента();
	
	Если ТекНомерДоговора = Неопределено
			Или ТекНомерДоговора < НомерДоговора Тогда
		
		ЗаписьРегистра = РегистрыСведений.Логс_НомераДоговоровАгентов.СоздатьМенеджерЗаписи();
		ЗаписьРегистра.НомерДоговора = НомерДоговора;
		ЗаписьРегистра.Записать();
		
	КонецЕсли; 
	
КонецПроцедуры

Функция ПолучитьДатуПоследнейЗагрузкиСводовНаДоставку(ПериодФормирования) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СводыЗаявок.Дата КАК Дата
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку КАК СводыЗаявок
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО СводыЗаявок.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	ДоговорыКонтрагентов.Логс_ПериодФормированияСводовАгента = &ПериодФормирования
	|	И СводыЗаявок.Проведен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ");
	Запрос.УстановитьПараметр("ПериодФормирования", ПериодФормирования);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат ?(Выборка.Следующий(),
				НачалоДня(Выборка.Дата),
				'00010101');
	
КонецФункции 

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции                                                  

#Область ОбменССерверомCRM

Функция ЗапросКСерверу(АдресСервера, АдресРесурса, ПараметрыЗапроса, Заголовки = Неопределено) Экспорт
	
	//Соединение = Новый HTTPСоединение(АдресСервера);
	Соединение = Новый HTTPСоединение(АдресСервера,,,,,,Новый ЗащищенноеСоединениеOpenSSL());
	
	СтрокаПараметров = СтруктураВПараметрыЗапроса(ПараметрыЗапроса);
	
	Запрос = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	Запрос.УстановитьТелоИзСтроки(СтрокаПараметров);
	
	Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	
	Если Ответ.КодСостояния <> 200 Тогда
		ТекстСообщения = СтрШаблон(НСтр("ru='При обращении к серверу %1 произошла ошибка %2'"), АдресСервера, Ответ.КодСостояния);
			
		ТекстОшибки = "";
		Попытка
			ТекстОшибки = Ответ.response.Error;
		Исключение
		КонецПопытки;
		СтрокаОтвета = Ответ.ПолучитьТелоКакСтроку();
		
		Если ТекстОшибки = "" Тогда
			ТекстОшибки = ПолучитьТекстОшибкиИзJSON(СтрокаОтвета) + Символы.ПС + СтрокаОтвета; 
		КонецЕсли;
	
		Если ЗначениеЗаполнено(ТекстОшибки) Тогда
			ТекстСообщения = ТекстСообщения + ": " + ТекстОшибки;
		КонецЕсли; 
		
		ВызватьИсключение ТекстСообщения;
	КонецЕсли; 
	
	Поток = Ответ.ПолучитьТелоКакПоток();
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.ОткрытьПоток(Поток);
	
	Результат = ПрочитатьJSON(ЧтениеJSON);
	ТипРезультата = Тип(Результат);
	
	ЧтениеJSON.Закрыть();
	Поток.Закрыть();
	
	Возврат Результат;
	
КонецФункции

Функция ЗапросКСерверуCRM(ИмяМетода, ПараметрыЗапроса) Экспорт
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	Возврат ЗапросКСерверу("cab.logsis.ru", "api1c/" + ИмяМетода, ПараметрыЗапроса, Заголовки);
	
КонецФункции 

Функция ЗапросКСерверуCRM_Альт(ИмяМетода, ПараметрыЗапроса) Экспорт
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	
	Возврат ЗапросКСерверу("api.logsis.ru", "api/v1/1c/" + ИмяМетода, ПараметрыЗапроса, Заголовки);
	
КонецФункции                      //http://api.logsis.ru/api/v1/1c/getOrdersAndZorders

Функция ПолучитьТекстОшибкиИзJSON(СтрокаJSON)
	ТекстОшибки = "";
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(СтрокаJSON);
	
	Маркер = Ложь;
	Пока ЧтениеJSON.Прочитать() Цикл
		
		Попытка
			Если Маркер Тогда
				ТекстОшибки = ТекстОшибки + ЧтениеJSON.ТекущееЗначение + Символы.ПС;
				Маркер = Ложь;
			ИначеЕсли ВРег(ЧтениеJSON.ТекущееЗначение) = "ERROR" или ВРег(ЧтениеJSON.ТекущееЗначение) = "MESSAGE" Тогда
				Маркер = Истина;
			КонецЕсли;
		Исключение            
		КонецПопытки    
	КонецЦикла;

	
	Возврат СокрЛП(ТекстОшибки)
КонецФункции

Функция ПолучитьСводЗаявокНаДоставку(ИдентификаторКлиента, НачалоПериода, КонецПериода, НомерЗаявки = Неопределено, ТДРегион = Неопределено) Экспорт
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("key", "bc47ef070acd827b5f2f8b3f202a31b6");
	ПараметрыЗапроса.Вставить("client_id", ИдентификаторКлиента);
	ПараметрыЗапроса.Вставить("date_beg", Формат(НачалоПериода, "ДФ=yyyy-MM-dd"));
	ПараметрыЗапроса.Вставить("date_end", Формат(КонецПериода, "ДФ=yyyy-MM-dd"));
	Если ЗначениеЗаполнено(НомерЗаявки) Тогда
		ПараметрыЗапроса.Вставить("order_id", СокрЛП(НомерЗаявки));
	КонецЕсли;	
	Если НЕ ТДРегион = Неопределено Тогда
		ПараметрыЗапроса.Вставить("region", ?(ТДРегион, "1", "0"));
	КонецЕсли;
	
	Ответ = ЗапросКСерверуCRM("getorders1c", ПараметрыЗапроса);
	
	Если Не Ответ.Свойство("response")
			И Не Ответ.Свойство("zresponse") Тогда
		ВызватьИсключение НСтр("ru='Неверный ответ от сервера CRM или ответ содержит ошибку'");
	КонецЕсли; 
	
	СводыЗаявок = Новый Структура;
	СводыЗаявок.Вставить("Своды", ?(ТипЗнч(Ответ.response) = Тип("Массив"),
									Ответ.response, Новый Массив));
	СводыЗаявок.Вставить("Заборы", ?(Ответ.Свойство("zresponse")
										И ТипЗнч(Ответ.zresponse) = Тип("Массив"),
									Ответ.zresponse, Новый Массив));
	
	Возврат СводыЗаявок;
	
КонецФункции

//устарело
Функция ПолучитьТоварыЗаявки(НомерЗаказа)
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("key", "bc47ef070acd827b5f2f8b3f202a31b6");
	ПараметрыЗапроса.Вставить("order_id", СокрЛП(НомерЗаказа));
	
	Ответ = ЗапросКСерверуCRM_Альт("orders/details", ПараметрыЗапроса);
	 
	Если Не Ответ.Свойство("response") Тогда
		ВызватьИсключение НСтр("ru='Неверный ответ от сервера CRM или ответ содержит ошибку'");
	КонецЕсли; 
	
	Возврат Ответ.response[0].goods;
КонецФункции


Функция ПолучитьДеталиЗаявки(НомерЗаказа)

	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("key", "bc47ef070acd827b5f2f8b3f202a31b6");
	ПараметрыЗапроса.Вставить("order_id", СокрЛП(НомерЗаказа));
	
	Ответ = ЗапросКСерверуCRM_Альт("orders/details", ПараметрыЗапроса);
	 
	Если Не Ответ.Свойство("response") Тогда
		ВызватьИсключение НСтр("ru='Неверный ответ от сервера CRM или ответ содержит ошибку'");
	КонецЕсли; 
	
	Адреса = Новый Структура;
	Адреса.Вставить("АдресСкладаОтправителя",Ответ.response[0].warehouse_address);
	Адреса.Вставить("ГородСкладаОтправителя",Ответ.response[0].warehouse_city);
	Адреса.Вставить("РегионСкладаОтправителя",Ответ.response[0].warehouse_region);
	Адреса.Вставить("ГородДоставки",Ответ.response[0].target_city);
	Адреса.Вставить("РегионДоставки",Ответ.response[0].target_region);
	
	КлиентскиеПоля = Ответ.response[0].clients_fields;
	Возврат Новый Структура("Товары, КлиентскиеПоля, Адреса",Ответ.response[0].goods, ?(КлиентскиеПоля = Неопределено, Новый Структура, КлиентскиеПоля), Адреса);
КонецФункции

//устаревший вызов
Функция ОбновитьДанныеНаСервереCRM(ИмяМетода, ПараметрыЗапроса) Экспорт
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Если НЕ Константы.ПараметрыБлокировкиРаботыСВнешнимиРесурсами.Получить().Получить().РаботаСВнешнимиРесурсамиЗаблокирована Тогда
		Возврат ЗапросКСерверу("cab.logsis.ru", "api1c/hooks/" + ИмяМетода, ПараметрыЗапроса, Заголовки);
	Иначе
		ВызватьИсключение "В копиях баз запрещен обмен с CRM";
		Возврат НЕОПРЕДЕЛЕНО;
	КонецЕсли;
	
КонецФункции 

Функция ОбновитьДанныеНаСервереCRM_Альт(ИмяМетода, ПараметрыЗапроса) Экспорт
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded");
	Если НЕ Константы.ПараметрыБлокировкиРаботыСВнешнимиРесурсами.Получить().Получить().РаботаСВнешнимиРесурсамиЗаблокирована Тогда
		Возврат ЗапросКСерверу("api.logsis.ru", "api/v1/1c/" + ИмяМетода, ПараметрыЗапроса, Заголовки);
	Иначе
		ВызватьИсключение "В копиях баз запрещен обмен с CRM";
		Возврат НЕОПРЕДЕЛЕНО;
	КонецЕсли;
	
КонецФункции 



#Область ФоновыеПроцедурыОбновленияДанныхНаСервереCRM

Процедура ОповеститьCRMОСозданииКлиента(Договор, АдресХранилища) Экспорт
	
	РезультатВыполнения = ОбновитьДанныеКлиентаВCRM(Договор);
	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
	
КонецПроцедуры

Функция ОбновитьДанныеКлиентаВCRM(Договор) Экспорт
	Если НЕ Договор.Логс_ВидДоговораCRM = Перечисления.Логс_ВидыДоговоровCRM.Агентский Тогда
		Возврат Новый Структура("Успешно", Истина);
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор,
		"Организация,Контрагент,Партнер,Номер,Дата,Логс_ИдентификаторCRM,БанковскийСчетКонтрагента," +
		"Менеджер,Логс_Аккаунт,Логс_МенеджерКО," +
		"Логс_БрендАгента,Логс_ИмяПользователяCRM,Логс_ПарольCRM,Статус, Логс_ДоговорОферты," +
		"Логс_КоличествоЗаказовВыбранноеПоОферте, Логс_СрокПеречисленияНП, Логс_ПериодФормированияСводовАгента");
	ДанныеПартнера = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДанныеДоговора.Партнер, "Наименование,НаименованиеПолное");
	ДанныеКонтрагента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ДанныеДоговора.Контрагент, "ИНН,КПП");
	ОГРН = УправлениеСвойствами.ЗначениеСвойства(ДанныеДоговора.Партнер, "АБС_КонтрагентОГРН");
	//Банк = ДанныеДоговора.БанковскийСчетКонтрагента.Банк;	
	ДанныеБанковскогоСчета = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеДоговора.БанковскийСчетКонтрагента,
		"НаименованиеБанка, БИКБанка, КоррСчетБанка, НомерСчета");
		
	Если НЕ ЗначениеЗаполнено(ДанныеДоговора.Логс_ИмяПользователяCRM) Тогда
		Возврат Новый Структура("Успешно", Истина);
	КонецЕсли;
	
	ИдентификаторОрганизации = УправлениеСвойствами.ЗначениеСвойства(ДанныеДоговора.Организация,
		Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоИдентификаторОрганизацииCRM());
	
	Обновить = ЗначениеЗаполнено(ДанныеДоговора.Логс_ИдентификаторCRM);
	
	ПараметрыЗапроса = Новый Структура;
//	ПараметрыЗапроса.Вставить("key", "901076233795fc304901c25412fa87b2");  //bc47ef070acd827b5f2f8b3f202a31b6
	ПараметрыЗапроса.Вставить("key", "bc47ef070acd827b5f2f8b3f202a31b6");  //
	ПараметрыЗапроса.Вставить("uid", Строка(ДанныеДоговора.Партнер.УникальныйИдентификатор()));
	ПараметрыЗапроса.Вставить("agentName", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеДоговора.Логс_БрендАгента, "Наименование"));
	ПараметрыЗапроса.Вставить("agentFullName", ДанныеПартнера.НаименованиеПолное);
	ПараметрыЗапроса.Вставить("address", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		ДанныеДоговора.Контрагент, Справочники.ВидыКонтактнойИнформации.ЮрАдресКонтрагента, ТекущаяДатаСеанса()));
	ПараметрыЗапроса.Вставить("inn", ДанныеКонтрагента.ИНН);
	ПараметрыЗапроса.Вставить("kpp", ДанныеКонтрагента.КПП);
	ПараметрыЗапроса.Вставить("ogrn", ОГРН);
	ПараметрыЗапроса.Вставить("client_type", "agent");
	ПараметрыЗапроса.Вставить("parent_company", ?(ЗначениеЗаполнено(ИдентификаторОрганизации), ИдентификаторОрганизации, ""));
	ПараметрыЗапроса.Вставить("dogNum", ДанныеДоговора.Номер);
	ПараметрыЗапроса.Вставить("dogDate", Формат(ДанныеДоговора.Дата, "ДФ=yyyy-MM-dd"));
	ПараметрыЗапроса.Вставить("status", ?(ДанныеДоговора.Статус = Перечисления.СтатусыДоговоровКонтрагентов.Действует, 1, 0));
	ПараметрыЗапроса.Вставить("email", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
		ДанныеДоговора.Партнер, Справочники.ВидыКонтактнойИнформации.EmailПартнера));
	ПараметрыЗапроса.Вставить("user", Строка(ПараметрыСеанса.ТекущийПользователь));
	ПараметрыЗапроса.Вставить("sales_manager_uid", ДанныеДоговора.Логс_МенеджерКО.УникальныйИдентификатор());
	ПараметрыЗапроса.Вставить("sales_manager_name", ДанныеДоговора.Логс_МенеджерКО);
	ПараметрыЗапроса.Вставить("connection_manager_uid", ДанныеДоговора.Менеджер.УникальныйИдентификатор());
	ПараметрыЗапроса.Вставить("connection_manager_name", ДанныеДоговора.Менеджер);
	ПараметрыЗапроса.Вставить("account_manager_name", ДанныеДоговора.Логс_Аккаунт);
	ПараметрыЗапроса.Вставить("account_manager_uid", ДанныеДоговора.Логс_Аккаунт.УникальныйИдентификатор());  
	
	ПараметрыЗапроса.Вставить("bank_name", ДанныеБанковскогоСчета.НаименованиеБанка);
	ПараметрыЗапроса.Вставить("bank_bik", ДанныеБанковскогоСчета.БИКБанка);
	ПараметрыЗапроса.Вставить("bank_korr", ДанныеБанковскогоСчета.КоррСчетБанка);
	ПараметрыЗапроса.Вставить("bank_raschet", ДанныеБанковскогоСчета.НомерСчета);
	
	
//перенести в повтисп на релизе//////////////////////////////////////////////////////////////////////////////////////
/////////////////////////////////////
СоответствиеСроковНП = Новый Соответствие;
СоответствиеСроковНП.Вставить(Перечисления.Логс_СрокиПеречисленияНП.Ежедневно, 1);			//Ежедневно+2 раб.дня
СоответствиеСроковНП.Вставить(Перечисления.Логс_СрокиПеречисленияНП.ПлатежныйДень, 2);		//Платежный день (Вт/Пт)
СоответствиеСроковНП.Вставить(Перечисления.Логс_СрокиПеречисленияНП.Еженедельно, 3);		//4 раза в месяц+2 раб.дня
СоответствиеСроковНП.Вставить(Перечисления.Логс_СрокиПеречисленияНП.НеПозднее10КалДней, 4);	//Не позднее 10 календ.дней
СоответствиеСроковНП.Вставить(Перечисления.Логс_СрокиПеречисленияНП.Ежедневно3, 5);			//Ежедневно + 3 раб.дня
СоответствиеСроковНП.Вставить(Перечисления.Логс_СрокиПеречисленияНП.ПлатежныйДеньСрПт, 6);	//Платежный день (Ср/Пн)
СоответствиеСроковНП.Вставить(Перечисления.Логс_СрокиПеречисленияНП.Еженедельно3, 7);		//4 раза в месяц + 3 раб.дня
СоответствиеСроковНП.Вставить(Перечисления.Логс_СрокиПеречисленияНП.НеделяПлюсШестьДней, 8);//4 раза в мес +6 раб.дн.
СоответствиеСроковНП.Вставить(Перечисления.Логс_СрокиПеречисленияНП.Ежедневно5, 9);			//Ежедневно + 5 раб.дней

СоответствиеПериодичностиОтчетовА = Новый Соответствие;
СоответствиеПериодичностиОтчетовА.Вставить(Перечисления.Логс_ПериодыФормированияСводовАгентов.Ежедневно, 1);			//Ежедневно
СоответствиеПериодичностиОтчетовА.Вставить(Перечисления.Логс_ПериодыФормированияСводовАгентов.ДваРазаВНеделю, 2);		//Пн - Ср / Чт - Вс
СоответствиеПериодичностиОтчетовА.Вставить(Перечисления.Логс_ПериодыФормированияСводовАгентов.Еженедельно, 3);			//4 раза в месяц
СоответствиеПериодичностиОтчетовА.Вставить(Перечисления.Логс_ПериодыФормированияСводовАгентов.ДваРазаВМесяц, 4);		//15/30(31) число
СоответствиеПериодичностиОтчетовА.Вставить(Перечисления.Логс_ПериодыФормированияСводовАгентов.Декадно, 5);				//1-10, 11-20, 21-30(31)
СоответствиеПериодичностиОтчетовА.Вставить(Перечисления.Логс_ПериодыФормированияСводовАгентов.ПоПятницам, 6);			//4 раза в мес по ПТ
СоответствиеПериодичностиОтчетовА.Вставить(Перечисления.Логс_ПериодыФормированияСводовАгентов.Ежемесячно, 7);			//Ежемесячно
/////////////////////////////////////

	СрокНП = СоответствиеСроковНП.Получить(ДанныеДоговора.Логс_СрокПеречисленияНП);
	ПараметрыЗапроса.Вставить("payment_rule", ?(ЗначениеЗаполнено(СрокНП), СрокНП, 0));

	ПериодичностьОтчетов = СоответствиеПериодичностиОтчетовА.Получить(ДанныеДоговора.Логс_ПериодФормированияСводовАгента);
	ПараметрыЗапроса.Вставить("report_period", ?(ЗначениеЗаполнено(ПериодичностьОтчетов), ПериодичностьОтчетов, 0));

	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка,
	|	КонтактныеЛицаПартнеров.Наименование КАК Наименование,
	|	КонтактныеЛицаПартнеров.ДополнительнаяИнформация КАК ДополнительнаяИнформация
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.РолиКонтактногоЛица КАК КонтактныеЛицаПартнеровРолиКонтактногоЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|		ПО КонтактныеЛицаПартнеровРолиКонтактногоЛица.Ссылка = КонтактныеЛицаПартнеров.Ссылка
	|			И (КонтактныеЛицаПартнеров.Владелец = &Владелец)
	|			И (НЕ КонтактныеЛицаПартнеров.ПометкаУдаления)
	|ГДЕ
	|	КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица = &КонтактДляКО
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	КонтактныеЛицаПартнеров.Ссылка КАК Ссылка,
	|	КонтактныеЛицаПартнеров.Наименование КАК Наименование,
	|	КонтактныеЛицаПартнеров.ДополнительнаяИнформация КАК ДополнительнаяИнформация
	|ИЗ
	|	Справочник.КонтактныеЛицаПартнеров.РолиКонтактногоЛица КАК КонтактныеЛицаПартнеровРолиКонтактногоЛица
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КонтактныеЛицаПартнеров КАК КонтактныеЛицаПартнеров
	|		ПО КонтактныеЛицаПартнеровРолиКонтактногоЛица.Ссылка = КонтактныеЛицаПартнеров.Ссылка
	|			И (КонтактныеЛицаПартнеров.Владелец = &Владелец)
	|			И (НЕ КонтактныеЛицаПартнеров.ПометкаУдаления)
	|ГДЕ
	|	КонтактныеЛицаПартнеровРолиКонтактногоЛица.РольКонтактногоЛица = &ПодписантДоговора");
	Запрос.УстановитьПараметр("Владелец", ДанныеДоговора.Партнер);
	Запрос.УстановитьПараметр("КонтактДляКО",
		Справочники.РолиКонтактныхЛицПартнеров.НайтиПоНаименованию(
			"контакт для КО", Истина)
	);
	Запрос.УстановитьПараметр("ПодписантДоговора",
		Справочники.РолиКонтактныхЛицПартнеров.НайтиПоНаименованию(
			"подписант договора", Истина)
	);
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	Выборка = РезультатЗапроса[0].Выбрать();
	Если Выборка.Следующий() Тогда
		ПараметрыЗапроса.Вставить("contact_name", Выборка.Наименование);
		ПараметрыЗапроса.Вставить("contact_phone", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			Выборка.Ссылка, Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица));
		ПараметрыЗапроса.Вставить("contact_email", УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъекта(
			Выборка.Ссылка, Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица));
		ПараметрыЗапроса.Вставить("contact_add_info", Выборка.ДополнительнаяИнформация);
		
	Иначе
		ПараметрыЗапроса.Вставить("contact_name", "");
		ПараметрыЗапроса.Вставить("contact_phone", "");
		ПараметрыЗапроса.Вставить("contact_email", "");
		ПараметрыЗапроса.Вставить("contact_add_info", "");
	КонецЕсли; 
	
	Выборка = РезультатЗапроса[1].Выбрать();
	ПараметрыЗапроса.Вставить("director", ?(Выборка.Следующий(),
		Выборка.Наименование, ""));
		
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
					|	Телефоны.Телефон КАК Телефон
					|ИЗ
					|	(ВЫБРАТЬ
					|		ВЫРАЗИТЬ(КонтрагентыКонтактнаяИнформация.Представление КАК СТРОКА(20)) КАК Телефон
					|	ИЗ
					|		Справочник.Контрагенты.КонтактнаяИнформация КАК КонтрагентыКонтактнаяИнформация
					|	ГДЕ
					|		КонтрагентыКонтактнаяИнформация.Ссылка = &Контрагент
					|		И КонтрагентыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонКонтрагента)
					|	
					|	ОБЪЕДИНИТЬ ВСЕ
					|	
					|	ВЫБРАТЬ
					|		ВЫРАЗИТЬ(ПартнерыКонтактнаяИнформация.Представление КАК СТРОКА(20))
					|	ИЗ
					|		Справочник.Партнеры.КонтактнаяИнформация КАК ПартнерыКонтактнаяИнформация
					|	ГДЕ
					|		ПартнерыКонтактнаяИнформация.Ссылка = &Партнер
					|		И ПартнерыКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонПартнера)) КАК Телефоны
					|УПОРЯДОЧИТЬ ПО
					|	Телефон УБЫВ";	
	Запрос.УстановитьПараметр("Контрагент", ДанныеДоговора.Контрагент); 
	Запрос.УстановитьПараметр("Партнер", ДанныеДоговора.Партнер); 
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПараметрыЗапроса.Вставить("callcenter_phone", Выборка.Телефон);
	Иначе
		ПараметрыЗапроса.Вставить("callcenter_phone", ПараметрыЗапроса.contact_phone);
	КонецЕсли;
		
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	EmailДляРассылки.Адрес КАК Адрес
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.Логс_EmailДляРассылки КАК EmailДляРассылки
	|ГДЕ
	|	EmailДляРассылки.Ссылка = &Договор
	|	И EmailДляРассылки.Адрес <> """"");
	Запрос.УстановитьПараметр("Договор", Договор);
	
	EmailДляРассылки = "";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если EmailДляРассылки <> "" Тогда
			EmailДляРассылки = EmailДляРассылки + ", ";
		КонецЕсли; 
		EmailДляРассылки = EmailДляРассылки + Выборка.Адрес;
	КонецЦикла; 
	
	ПараметрыЗапроса.Вставить("contact_mail_client", EmailДляРассылки);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	EmailДляРассылокКО.Адрес КАК Адрес
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов.Логс_EmailДляРассылокКО КАК EmailДляРассылокКО
	|ГДЕ
	|	EmailДляРассылокКО.Ссылка = &Договор
	|	И EmailДляРассылокКО.Адрес <> """"");
	Запрос.УстановитьПараметр("Договор", Договор);
	
	EmailДляРассылкиКО = "";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если EmailДляРассылкиКО <> "" Тогда
			EmailДляРассылкиКО = EmailДляРассылкиКО + ", ";
		КонецЕсли; 
		EmailДляРассылкиКО = EmailДляРассылкиКО + Выборка.Адрес;
	КонецЦикла;
	
	ПараметрыЗапроса.Вставить("mail_ko", EmailДляРассылкиКО);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
		|	Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ДоговорКонтрагентов КАК ДоговорКонтрагентов,
		|	Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту КАК ФормаОплатыУслугАгенту
		|ИЗ
		|	РегистрСведений.Логс_ИсторияФормыОплатыДоговоров.СрезПоследних(&Период, ДоговорКонтрагентов = &Договор) КАК Логс_ИсторияФормыОплатыДоговоровСрезПоследних";
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("Период", ТекущаяДата());
	
	тФормаОплаты = 0;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		тФормаОплаты = ?(Выборка.ФормаОплатыУслугАгенту = Перечисления.Логс_ФормыОплатыУслугАгенту.Оплата100, 1, 2)
	КонецЦикла;
	
	ПараметрыЗапроса.Вставить("payment_form", тФормаОплаты);
	
	
	Если Обновить Тогда
		ПараметрыЗапроса.Вставить("update", 1);
		ПараметрыЗапроса.Вставить("client_id", ДанныеДоговора.Логс_ИдентификаторCRM);
	Иначе
		ПараметрыЗапроса.Вставить("update", 0);
		ПараметрыЗапроса.Вставить("userName", ДанныеДоговора.Логс_ИмяПользователяCRM);
		ПараметрыЗапроса.Вставить("password", ДанныеДоговора.Логс_ПарольCRM);
		
		ПараметрыЗапроса.Вставить("is_offer", ?(ДанныеДоговора.Логс_ДоговорОферты, 1,0));
		ПараметрыЗапроса.Вставить("month_orders_count", ?(ДанныеДоговора.Логс_ДоговорОферты, ДанныеДоговора.Логс_КоличествоЗаказовВыбранноеПоОферте,0));
	КонецЕсли; 
	
	Попытка
		//Ответ = ОбновитьДанныеНаСервереCRM("1cdognum", ПараметрыЗапроса);
		Ответ = ОбновитьДанныеНаСервереCRM_Альт("clients", ПараметрыЗапроса);
		Результат = Ответ.response[0];
		Если Результат.Свойство("client_id") Тогда
			УстановитьПривилегированныйРежим(Истина);
			ДоговорОбъект = Договор.ПолучитьОбъект();
			ДоговорОбъект.Логс_ИдентификаторCRM = Формат(Результат.client_id,"ЧГ=");
			ДоговорОбъект.ОбменДанными.Загрузка = Истина;
			ДоговорОбъект.Записать();
			УстановитьПривилегированныйРежим(Ложь);
			
			РезультатВыполнения = Новый Структура("Успешно,Идентификатор",
				Истина, Результат.client_id);
				
			тТекстПисьма = "Имя пользователя: "+ДанныеДоговора.Логс_ИмяПользователяCRM+ Символы.ПС + "Пароль: "+ ДанныеДоговора.Логс_ПарольCRM;
			Отдел = ?(ДанныеДоговора.Логс_ДоговорОферты, "Оферта", "Коммерческий");
			ОповеститьПоПочтеНужныйОтдел(Отдел, Формат(Результат.client_id, "ЧГ="), ДанныеДоговора.Контрагент, тТекстПисьма);
			ОповеститьПоПочтеНужныйОтдел("Аккаунтинг", Формат(Результат.client_id, "ЧГ="), ДанныеДоговора.Контрагент, тТекстПисьма);
			
			Если ДанныеДоговора.Логс_ДоговорОферты Тогда
				ТекстПисьма = Константы.Логс_ТекстПисьмаНовогоЛКпоОферте.Получить();
				ТекстПисьма = СтрЗаменить(ТекстПисьма, "[[+email]]", ДанныеДоговора.Логс_ИмяПользователяCRM);
				ТекстПисьма = СтрЗаменить(ТекстПисьма, "[[+password]]", ДанныеДоговора.Логс_ПарольCRM); 
				РегистрыСведений.Логс_ПочтовыеРассылки.ОтправитьРассылкуСинхронно(ПараметрыЗапроса.email, "Договор оферты Logsis", ТекстПисьма, "Учетные данные оферта");
			КонецЕсли;
		ИначеЕсли Результат.Свойство("success") Тогда
			// Обновление клиента.
			РезультатВыполнения = Новый Структура("Успешно,Идентификатор",
				Истина, Неопределено);
		Иначе
			РезультатВыполнения = Новый Структура("Успешно", Ложь);
			
			Если Результат.Свойство("Error") Тогда
				РезультатВыполнения.Вставить("ТекстОшибки", Результат.Error);
			Иначе
				РезультатВыполнения.Вставить("ТекстОшибки", НСтр("ru='Неизвестная ошибка'"));
			КонецЕсли; 
				
			ЗаписьЖурналаРегистрации(
				"Обмен с CRM. Оповещение о создании агента",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.ДоговорыКонтрагентов,
				Договор,
				СтрШаблон(НСтр("ru='Произошла ошибка при обновлении данных на сервере CRM: %1'"), РезультатВыполнения.ТекстОшибки));
		КонецЕсли; 
	Исключение
		РезультатВыполнения = Новый Структура("Успешно,ТекстОшибки",
			Ложь,
			КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
			
		ЗаписьЖурналаРегистрации(
			"Обмен с CRM. Оповещение о создании агента",
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.ДоговорыКонтрагентов,
			Договор,
			СтрШаблон(НСтр("ru='Произошла ошибка при обновлении данных на сервере CRM: %1'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
	КонецПопытки; 
	
	//ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатВыполнения;
КонецФункции 
 

Процедура ОповеститьCRMОСозданииКурьера(Сотрудник, АдресХранилища) Экспорт
	
	Если ТипЗнч(Сотрудник) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Возврат;
		ОповеститьCRMОСозданииКурьераСамозанятого(Сотрудник, АдресХранилища);
	КонецЕсли;
	
	ОбменСCRM = УправлениеСвойствами.ЗначениеСвойства(Сотрудник,
		Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоСотрудникОбменСCRM());
		
	////неактуальный код - отключение курьеров также происходит в 1С	
	//Если ОбменСCRM <> Истина Тогда
	//		
	//	РезультатВыполнения = Новый Структура("Успешно,ТекстОшибки", Ложь,
	//		СтрШаблон(НСтр("ru='Сотрудник %1 не используется в обмене с CRM'"), Сотрудник));
	//		
	//	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
	//	
	//	Возврат;
	//	
	//КонецЕсли; 
	
	ДанныеКурьера = ПолучитьДанныеКурьера(Сотрудник);
	КонтактнаяИнформация = ДанныеКурьера.ФизическоеЛицо.КонтактнаяИнформация;
	Для каждого Строка из КонтактнаяИнформация Цикл
		Если Строка.Вид.Наименование = "Адрес по прописке" Тогда
		 АдресПоПрописке = Строка.Представление;	
		ИначеЕсли Строка.Вид.Наименование = "Адрес места проживания" Тогда
		 ФактичАдрес = Строка.Представление;	
		КонецЕсли;
	КонецЦикла;	
	
	ХабИД = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ПолучитьХабСотрудника(Сотрудник).ИД;
	
	ФИОФизическогоЛица = ФизическиеЛицаУТ.ФамилияИмяОтчество(ДанныеКурьера.ФизическоеЛицо);
	ФамилияИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИОФизическогоЛица);
	
	ФИОКоротко = "" + СокрЛП(ФИОФизическогоЛица.Фамилия) + " " + СокрЛП(ФИОФизическогоЛица.Имя);
	
	//// ABS начало изменения*
	//// 05.12.2019 Архипкин Р.В.
	//// не уникальное имя курьера, берем больше символов из фамилии
	////ИмяПользователя = НРег(Лев(ФИОФизическогоЛица.Фамилия, 1) + "." + ФИОФизическогоЛица.Имя);
	//ИмяПользователя = НРег(Лев(ФИОФизическогоЛица.Фамилия, 5) + "." + ФИОФизическогоЛица.Имя);
	//// ABS конец изменения**
	
	///Снова проблемы с уникальностью
	///делаем перебор - код переместился в момент выполнения запроса
	
	//ИмяПользователя = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(ИмяПользователя);
	
	ПараметрыЗапроса = Новый Структура;
	//ПараметрыЗапроса.Вставить("key", "901076233795fc304901c25412fa87b2"); //bc47ef070acd827b5f2f8b3f202a31b6
	ПараметрыЗапроса.Вставить("key", "bc47ef070acd827b5f2f8b3f202a31b6"); //
	
	//Если Не ЗначениеЗаполнено(ДанныеКурьера.ИдентификаторCRM) Тогда
	//	ПараметрыЗапроса.Вставить("update", 0);
	//	ПараметрыЗапроса.Вставить("userName", ИмяПользователя);
	//	ПараметрыЗапроса.Вставить("password", "lk" + ИмяПользователя);
	//Иначе
	//	ПараметрыЗапроса.Вставить("update", 1);
	//	ПараметрыЗапроса.Вставить("courier_id", ДанныеКурьера.ИдентификаторCRM);
	//КонецЕсли; 
	
	Телефон = "";
	Для Сч = 1 По СтрДлина(ДанныеКурьера.Телефон) Цикл
		ТекСимвол = Сред(ДанныеКурьера.Телефон, Сч, 1);
		Если ТекСимвол >= "0" И ТекСимвол <= "9" Тогда
			Телефон = Телефон + ТекСимвол;
		КонецЕсли; 
	КонецЦикла;
	
	ПараметрыЗапроса.Вставить("cr_fullname", ДанныеКурьера.ФИО);
	ПараметрыЗапроса.Вставить("cr_shortname", ФИОКоротко);
	Если Не ЗначениеЗаполнено(ДанныеКурьера.ИдентификаторCRM) Тогда
		ПараметрыЗапроса.Вставить("cr_email", ДанныеКурьера.Email);
		ПараметрыЗапроса.Вставить("cr_dphone", Телефон);
		ПараметрыЗапроса.Вставить("parent_company", ДанныеКурьера.ГоловнаяОрганизация);
		
	КонецЕсли;
	СерияНомер =ДанныеКурьера.СерияПаспорта+ " "+ ДанныеКурьера.НомерПаспорта;
	ПараметрыЗапроса.Вставить("cr_pass_sn", СерияНомер);
	ПараметрыЗапроса.Вставить("cr_pass_kod", ДанныеКурьера.КодПодразделения);
	ПараметрыЗапроса.Вставить("fact_addr", ФактичАдрес);            //фактический адрес
	ПараметрыЗапроса.Вставить("pass_addr", АдресПоПрописке);   //адрес по прописке
	ПараметрыЗапроса.Вставить("cr_birthday", Формат(ДанныеКурьера.ДатаРождения,"ДЛФ=Д"));
	ПараметрыЗапроса.Вставить("cr_pass_date ", Формат(ДанныеКурьера.ДатаВыдачи,"ДЛФ=Д"));//Дата Выдачи паспрота
	ПараметрыЗапроса.Вставить("cr_pass_kem ", ДанныеКурьера.КемВыдан);   //адрес по прописке
	ПараметрыЗапроса.Вставить("default_hub_id", ХабИД);
	КадровыеДанныеСотрудников = КадровыйУчет.КадровыеДанныеСотрудников(Истина, 
    ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Сотрудник), 
    "ДатаУвольнения", ТекущаяДата());
	Если КадровыеДанныеСотрудников[0].ДатаУвольнения = Дата(1,1,1) и ОбменСCRM=Истина Тогда
		ПараметрыЗапроса.Вставить("cr_status", 1);
	Иначе
		ПараметрыЗапроса.Вставить("cr_status", 0);
	КонецЕсли;
	ПараметрыЗапроса.Вставить("is_self_employed", ?(ДанныеКурьера.Логс_Самозанятый и НЕ ДанныеКурьера.Логс_КурьерИП, 1,0));
	ПараметрыЗапроса.Вставить("is_sole_proprietor", ?(ДанныеКурьера.Логс_КурьерИП, 1,0));
	
	ТипКурьераСтрокой = НРег(ДанныеКурьера.ТипКурьера);
	//++ Ким Виктор 18.07.2024
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-13912
	
	// Соответствия типов курьеров.
	//// Авто
	//const CRTYPE_AUTO = 1;
	//// Пеший
	//const CRTYPE_PEDESTRIAN = 2;
	//// Грузовой
	//const CRTYPE_CARGO = 3;
	//// Пятитонник
	//const CRTYPE_FIVE_TON = 4;
	//// Наемник
	//const CRTYPE_HIRE = 5;
	//// Субагент
	//const CRTYPE_FASTZILLA = 6;
	//// Стадол
	//const CRTYPE_STADOL = 7;
	//// Стажер
	//const CRTYPE_STAGER = 8;
	//// ПВЗ
	//const CRTYPE_PVZ = 9;
	//// ПВЗ - Авито
	//const CRTYPE_PVZ_AVITO = 10;

	Если ТипКурьераСтрокой = "авто" Тогда
		ТипКурьера = 1;
	ИначеЕсли ТипКурьераСтрокой = "пеший" Тогда
		ТипКурьера = 2;
	ИначеЕсли ТипКурьераСтрокой = "грузовой" Тогда
		ТипКурьера = 3;
	ИначеЕсли ТипКурьераСтрокой = "пятитонник" Тогда
		Типкурьера = 4;
	ИначеЕсли ТипКурьераСтрокой = "наемник" Тогда
		Типкурьера = 5;
	ИначеЕсли ТипКурьераСтрокой = "субагент" Тогда
		Типкурьера = 6;
	ИначеЕсли ТипКурьераСтрокой = "стадол" Тогда
		Типкурьера = 7;
	ИначеЕсли ТипКурьераСтрокой = "стажер" Тогда
		ТипКурьера = 8;
	ИначеЕсли ТипКурьераСтрокой = "пвз" Тогда
		ТипКурьера = 9;
	ИначеЕсли ТипКурьераСтрокой = "пвз - авито" Тогда
		ТипКурьера = 10;
	Иначе
		ТипКурьера = 0;
	КонецЕсли; 

	//-- Ким Виктор 18.07.2024	
	ПараметрыЗапроса.Вставить("cr_type", ТипКурьера);
	ПараметрыЗапроса.Вставить("inn", ДанныеКурьера.ИНН);
	
	
	РезультатВыполнения = Неопределено;
	ИнформацияОбОшибкеПоследняя = "";
	////брутфорс валидного юзернейма
	Для К = 1 по СтрДлина(ФИОФизическогоЛица.Фамилия) Цикл
		ИмяПользователя = НРег(Лев(ФИОФизическогоЛица.Фамилия, К) + "." + ФИОФизическогоЛица.Имя);
		ИмяПользователя = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(ИмяПользователя);
		
		Если Не ЗначениеЗаполнено(ДанныеКурьера.ИдентификаторCRM) Тогда
			ПараметрыЗапроса.Вставить("update", 0);
			ПараметрыЗапроса.Вставить("userName", ИмяПользователя);
			ПараметрыЗапроса.Вставить("password", "lk" + ИмяПользователя);
		Иначе
			ПараметрыЗапроса.Вставить("update", 1);
			ПараметрыЗапроса.Вставить("courier_id", ДанныеКурьера.ИдентификаторCRM);
		КонецЕсли; 
	
	//	Попытка
			//Ответ = ЗапросКСерверуCRM("1ccourieradd", ПараметрыЗапроса);
			Ответ = ЗапросКСерверуCRM_Альт("couriers", ПараметрыЗапроса);
			
			Результат = Ответ.response;
			Если ТипЗнч(Результат) = Тип("Массив") Тогда
				Результат = Результат[0];
			КонецЕсли; 
			
			Если Результат.Свойство("courier_id") Тогда
				СвойствоИдентификатор = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоИдентификаторКурьераCRM();
				
				СотрудникОбъект = Сотрудник.ПолучитьОбъект();
				
				СтрокаРеквизита = СотрудникОбъект.ДополнительныеРеквизиты.Найти(СвойствоИдентификатор, "Свойство");
				Если СтрокаРеквизита = Неопределено Тогда
					СтрокаРеквизита = СотрудникОбъект.ДополнительныеРеквизиты.Добавить();
					СтрокаРеквизита.Свойство = СвойствоИдентификатор;
				КонецЕсли; 
				СтрокаРеквизита.Значение = Формат(Результат.courier_id, "ЧГ=");
				СтрокаРеквизита.ТекстоваяСтрока = Строка(СтрокаРеквизита.Значение);
				
				СотрудникОбъект.ОбменДанными.Загрузка = Истина;
				
				Записано = Ложь;
				Для Ы = 1 по 10 Цикл
					Попытка
						СотрудникОбъект.Записать();
						Записано = Истина;
						Прервать 
					Исключение 
						Описание = ОписаниеОшибки();
						//ОбщегоНазначенияБТС.Пауза(10);
						
						//Костыль TODO#
						Если Справочники.Сотрудники.ПолучитьСсылку(Сотрудник.УникальныйИдентификатор()).ВерсияДанных <> СотрудникОбъект.ВерсияДанных  Тогда 
							СотрудникОбъект = Справочники.Сотрудники.НайтиПоКоду(Сотрудник.Код).ПолучитьОбъект();	
						КонецЕсли;
						
					КонецПопытки;
				КонецЦикла;				
				Если Записано Тогда
					РезультатВыполнения = Новый Структура("Успешно,Идентификатор",
						Истина, Результат.courier_id);
				Иначе
					РезультатВыполнения = Новый Структура("Успешно,Идентификатор",
						Ложь, Результат.courier_id);				
				КонецЕсли;
					
				Прервать; // прервем цикл брутфорса, если информация обновлена
			ИначеЕсли ЗначениеЗаполнено(ДанныеКурьера.ИдентификаторCRM) Тогда
				ТекстОшибки = ?(Результат.Свойство("Error"),
					Результат.Error,
					НСтр("ru='Неизвестная ошибка'"));
				ТекстСообщения = СтрШаблон(
					НСтр("ru='Произошла ошибка при обновлении данных на сервере CRM: %1'"),
					ТекстОшибки);
					
				РезультатВыполнения = Новый Структура("Успешно,ТекстОшибки", Ложь, ТекстСообщения);
					
				ЗаписьЖурналаРегистрации(
					"Обмен с CRM. Оповещение о создании курьера",
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.Сотрудники,
					Сотрудник,
					ТекстСообщения);
					
				Прервать; // прервем цикл брутфорса, если запрос упал, и есть ИД курьера
			КонецЕсли; 
		//Исключение
		//	ИнформацияОбОшибкеПоследняя = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		//КонецПопытки;
	КонецЦикла;
	
	Если РезультатВыполнения = Неопределено Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru='Произошла ошибка при обновлении данных на сервере CRM: %1'"), ИнформацияОбОшибкеПоследняя);
			
			РезультатВыполнения = Новый Структура("Успешно,ТекстОшибки",
				Ложь, ТекстСообщения);
				
			ЗаписьЖурналаРегистрации(
				"Обмен с CRM. Оповещение о создании курьера",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.Сотрудники,
				Сотрудник,
				ТекстСообщения);
	КонецЕсли;

	АдресХранилища=ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
КонецПроцедуры 

Процедура ОповеститьCRMОСозданииКурьераСамозанятого(Договор, АдресХранилища) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "Выбрать * из Справочник.ДоговорыКонтрагентов как спр где спр.Ссылка = &Договор";
	Запрос.УстановитьПараметр("Договор", Договор);
	ДанныеДоговора = Запрос.Выполнить().Выбрать();
	ДанныеДоговора.Следующий();
	
	ОбменСCRM = ДанныеДоговора.Логс_ОбменСCRM и (ДанныеДоговора.Логс_ВидКлиентаCRM = Перечисления.Логс_ВидыКлиентовCRM.СамозанятыйКурьер);
	
	Если ОбменСCRM <> Истина Тогда
			
		РезультатВыполнения = Новый Структура("Успешно,ТекстОшибки", Ложь,
			СтрШаблон(НСтр("ru='Сотрудник %1 не используется в обмене с CRM'"), ДанныеДоговора.Контрагент));
			
		ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
		
		Возврат;
		
	КонецЕсли; 
	
	ДанныеКурьера = ПолучитьДанныеСамозанятогоКурьера(Договор);
	КонтактнаяИнформация = ДанныеКурьера.Контрагент.КонтактнаяИнформация;
	Для каждого Строка из КонтактнаяИнформация Цикл
		Если Строка.Вид.Наименование = "Адрес по прописке" Тогда
		 АдресПоПрописке = Строка.Представление;	
		ИначеЕсли Строка.Вид.Наименование = "Адрес места проживания" Тогда
		 ФактичАдрес = Строка.Представление;	
		КонецЕсли;
	КонецЦикла;	
	
	ХабИД = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.ПолучитьХабСотрудника(Договор).ИД;
	
	ФИОФизическогоЛица = ФизическиеЛицаУТ.ФамилияИмяОтчество(ДанныеКурьера.ФИО);
	ФамилияИнициалы = ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИОФизическогоЛица);
	
	ФИОКоротко = "" + СокрЛП(ФИОФизическогоЛица.Фамилия) + " " + СокрЛП(ФИОФизическогоЛица.Имя);
	
	ПараметрыЗапроса = Новый Структура;
	ПараметрыЗапроса.Вставить("key", "901076233795fc304901c25412fa87b2");
	
	Телефон = "";
	Для Сч = 1 По СтрДлина(ДанныеКурьера.Телефон) Цикл
		ТекСимвол = Сред(ДанныеКурьера.Телефон, Сч, 1);
		Если ТекСимвол >= "0" И ТекСимвол <= "9" Тогда
			Телефон = Телефон + ТекСимвол;
		КонецЕсли; 
	КонецЦикла;
	
	ПараметрыЗапроса.Вставить("cr_fullname", ДанныеКурьера.ФИО);
	ПараметрыЗапроса.Вставить("cr_shortname", ФИОКоротко);
	Если Не ЗначениеЗаполнено(ДанныеКурьера.ИдентификаторCRM) Тогда
		ПараметрыЗапроса.Вставить("cr_email", ДанныеКурьера.Email);
		ПараметрыЗапроса.Вставить("cr_dphone", Телефон);
		ПараметрыЗапроса.Вставить("parent_company", ДанныеКурьера.ГоловнаяОрганизация);
		
	КонецЕсли;
	СерияНомер =ДанныеКурьера.СерияПаспорта+ " "+ ДанныеКурьера.НомерПаспорта;
	ПараметрыЗапроса.Вставить("cr_pass_sn", СерияНомер);
	ПараметрыЗапроса.Вставить("cr_pass_kod", ДанныеКурьера.КодПодразделения);
	ПараметрыЗапроса.Вставить("fact_addr", ФактичАдрес);            //фактический адрес
	ПараметрыЗапроса.Вставить("pass_addr", АдресПоПрописке);   //адрес по прописке
	ПараметрыЗапроса.Вставить("cr_birthday", Формат(ДанныеКурьера.ДатаРождения,"ДЛФ=Д"));
	ПараметрыЗапроса.Вставить("cr_pass_date ", Формат(ДанныеКурьера.ДатаВыдачи,"ДЛФ=Д"));//Дата Выдачи паспрота
	ПараметрыЗапроса.Вставить("cr_pass_kem ", ДанныеКурьера.КемВыдан);   //адрес по прописке
	ПараметрыЗапроса.Вставить("default_hub_id", ХабИД);
	ПараметрыЗапроса.Вставить("cr_status", ДанныеКурьера.Статус);
	
	ТипКурьераСтрокой = НРег(ДанныеКурьера.ТипКурьера);
	Если ТипКурьераСтрокой = "авто" Тогда
		ТипКурьера = 1;
	ИначеЕсли ТипКурьераСтрокой = "пеший" Тогда
		ТипКурьера = 2;
	ИначеЕсли ТипКурьераСтрокой = "грузовой" Тогда
		ТипКурьера = 3;
	ИначеЕсли ТипКурьераСтрокой = "стажер" Тогда
		ТипКурьера = 4;
	Иначе
		ТипКурьера = 0;
	КонецЕсли; 
	
	ПараметрыЗапроса.Вставить("cr_type", ТипКурьера);
	
	
	РезультатВыполнения = Неопределено;
	ИнформацияОбОшибкеПоследняя = "";
	////брутфорс валидного юзернейма
	Для К = 1 по СтрДлина(ФИОФизическогоЛица.Фамилия) Цикл
		ИмяПользователя = НРег(Лев(ФИОФизическогоЛица.Фамилия, К) + "." + ФИОФизическогоЛица.Имя);
		ИмяПользователя = СтроковыеФункцииКлиентСервер.СтрокаЛатиницей(ИмяПользователя);
		
		Если Не ЗначениеЗаполнено(ДанныеКурьера.ИдентификаторCRM) Тогда
			ПараметрыЗапроса.Вставить("update", 0);
			ПараметрыЗапроса.Вставить("userName", ИмяПользователя);
			ПараметрыЗапроса.Вставить("password", "lk" + ИмяПользователя);
		Иначе
			ПараметрыЗапроса.Вставить("update", 1);
			ПараметрыЗапроса.Вставить("courier_id", ДанныеКурьера.ИдентификаторCRM);
		КонецЕсли; 
	
		Попытка
			//Ответ = ЗапросКСерверуCRM("1ccourieradd", ПараметрыЗапроса);
			Ответ = ЗапросКСерверуCRM_Альт("couriers", ПараметрыЗапроса);
			
			Результат = Ответ.response;
			Если ТипЗнч(Результат) = Тип("Массив") Тогда
				Результат = Результат[0];
			КонецЕсли; 
			
			Если Результат.Свойство("courier_id") Тогда
				
				ДоговорОбъект = Договор.ПолучитьОбъект();
				ДоговорОбъект.Логс_ИдентификаторCRM = Результат.courier_id;
				ДоговорОбъект.ОбменДанными.Загрузка = Истина;
				ДоговорОбъект.Записать();
				
				РезультатВыполнения = Новый Структура("Успешно,Идентификатор",
					Истина, Результат.courier_id);
					
				Прервать; // прервем цикл брутфорса, если информация обновлена
			ИначеЕсли ЗначениеЗаполнено(ДанныеКурьера.ИдентификаторCRM) Тогда
				ТекстОшибки = ?(Результат.Свойство("Error"),
					Результат.Error,
					НСтр("ru='Неизвестная ошибка'"));
				ТекстСообщения = СтрШаблон(
					НСтр("ru='Произошла ошибка при обновлении данных на сервере CRM: %1'"),
					ТекстОшибки);
					
				РезультатВыполнения = Новый Структура("Успешно,ТекстОшибки", Ложь, ТекстСообщения);
					
				ЗаписьЖурналаРегистрации(
					"Обмен с CRM. Оповещение о создании курьера",
					УровеньЖурналаРегистрации.Ошибка,
					Метаданные.Справочники.ДоговорыКонтрагентов,
					Договор,
					ТекстСообщения);
					
				Прервать; // прервем цикл брутфорса, если запрос упал, и есть ИД курьера
			КонецЕсли; 
		Исключение
			ИнформацияОбОшибкеПоследняя = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		КонецПопытки;
	КонецЦикла;
	
	Если РезультатВыполнения = Неопределено Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru='Произошла ошибка при обновлении данных на сервере CRM: %1'"), ИнформацияОбОшибкеПоследняя);
			
			РезультатВыполнения = Новый Структура("Успешно,ТекстОшибки",
				Ложь, ТекстСообщения);
				
			ЗаписьЖурналаРегистрации(
				"Обмен с CRM. Оповещение о создании курьера",
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.ДоговорыКонтрагентов,
				Договор,
				ТекстСообщения);
	КонецЕсли;

	ПоместитьВоВременноеХранилище(РезультатВыполнения, АдресХранилища);
КонецПроцедуры 

Функция ПолучитьДанныеКурьера(Сотрудник)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.ФизическоеЛицо КАК ФизическоеЛицо,
	|	Сотрудники.Логс_Самозанятый КАК Логс_Самозанятый,
	|	Сотрудники.Логс_КурьерИП КАК Логс_КурьерИП,
	|	ЕСТЬNULL(ДопРеквизитыОрганизации.Значение, """") КАК ГоловнаяОрганизация,
	|	ФизическиеЛица.ФИО КАК ФИО,
	|	ВЫБОР
	|		КОГДА Сотрудники.ВАрхиве
	|			ТОГДА 0
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Статус
	|ПОМЕСТИТЬ ДанныеСотрудника
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	|		ПО Сотрудники.ФизическоеЛицо = ФизическиеЛица.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.ДополнительныеРеквизиты КАК ДопРеквизитыОрганизации
	|		ПО Сотрудники.ГоловнаяОрганизация = ДопРеквизитыОрганизации.Ссылка
	|			И (ДопРеквизитыОрганизации.Свойство = &СвойствоИдентификаторОрганизации)
	|ГДЕ
	|	Сотрудники.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КонтактнаяИнформация.Ссылка КАК Ссылка,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Представление КАК Представление
	|ПОМЕСТИТЬ КонтактнаяИнформация
	|ИЗ
	|	Справочник.ФизическиеЛица.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Ссылка В
	|			(ВЫБРАТЬ
	|				ДанныеСотрудника.ФизическоеЛицо
	|			ИЗ
	|				ДанныеСотрудника)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиДополнительныеРеквизиты.Ссылка КАК Ссылка,
	|	СотрудникиДополнительныеРеквизиты.Свойство КАК Свойство,
	|	СотрудникиДополнительныеРеквизиты.Значение КАК Значение
	|ПОМЕСТИТЬ ДополнительныеРеквизиты
	|ИЗ
	|	Справочник.Сотрудники.ДополнительныеРеквизиты КАК СотрудникиДополнительныеРеквизиты
	|ГДЕ
	|	СотрудникиДополнительныеРеквизиты.Ссылка = &Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеСотрудника.Ссылка КАК Ссылка,
	|	ДанныеСотрудника.ФизическоеЛицо КАК ФизическоеЛицо,   
	|	ДанныеСотрудника.Логс_Самозанятый КАК Логс_Самозанятый,   
	|	ДанныеСотрудника.Логс_КурьерИП КАК Логс_КурьерИП,   
	|	ДанныеСотрудника.ФИО КАК ФИО,
	|	ДанныеСотрудника.ГоловнаяОрганизация КАК ГоловнаяОрганизация,
	|	ЕСТЬNULL(КонтактнаяИнформацияТелефон.Представление, """") КАК Телефон,
	|	ЕСТЬNULL(КонтактнаяИнформацияEmail.Представление, """") КАК Email,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Серия, """") КАК СерияПаспорта,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Номер, """") КАК НомерПаспорта,
	|	ДанныеСотрудника.Статус КАК Статус,
	|	ЕСТЬNULL(ДополнительныеРеквизитыТипКурьера.Значение, """") КАК ТипКурьера,
	|	ЕСТЬNULL(ДополнительныеРеквизитыИдентификаторCRM.Значение, """") КАК ИдентификаторCRM,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.КодПодразделения, """") КАК КодПодразделения,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.КемВыдан, """") КАК КемВыдан,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.ДатаВыдачи, """") КАК ДатаВыдачи,
	|	ЕСТЬNULL(ДанныеСотрудника.ФизическоеЛицо.ДатаРождения, """") КАК ДатаРождения,
	|	ДанныеСотрудника.ФизическоеЛицо.ИНН как ИНН 
	|ИЗ
	|	ДанныеСотрудника КАК ДанныеСотрудника
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтактнаяИнформация КАК КонтактнаяИнформацияТелефон
	|		ПО ДанныеСотрудника.ФизическоеЛицо = КонтактнаяИнформацияТелефон.Ссылка
	|			И (КонтактнаяИнформацияТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ КонтактнаяИнформация КАК КонтактнаяИнформацияEmail
	|		ПО ДанныеСотрудника.ФизическоеЛицо = КонтактнаяИнформацияEmail.Ссылка
	|			И (КонтактнаяИнформацияEmail.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛиц
	|		ПО ДанныеСотрудника.ФизическоеЛицо = ДокументыФизическихЛиц.Физлицо
	|			И (ДокументыФизическихЛиц.ВидДокумента в (ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ), ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ИностранныйПаспорт), ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ВидНаЖительство)))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДополнительныеРеквизиты КАК ДополнительныеРеквизитыТипКурьера
	|		ПО ДанныеСотрудника.Ссылка = ДополнительныеРеквизитыТипКурьера.Ссылка
	|			И (ДополнительныеРеквизитыТипКурьера.Свойство = &СвойствоТипКурьера)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДополнительныеРеквизиты КАК ДополнительныеРеквизитыИдентификаторCRM
	|		ПО ДанныеСотрудника.Ссылка = ДополнительныеРеквизитыИдентификаторCRM.Ссылка
	|			И (ДополнительныеРеквизитыИдентификаторCRM.Свойство = &СвойствоИдентификаторCRM)");

	Запрос.УстановитьПараметр("Ссылка", Сотрудник);
	Запрос.УстановитьПараметр("СвойствоТипКурьера", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоСотрудникиТипКурьера());
	Запрос.УстановитьПараметр("СвойствоИдентификаторCRM", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоИдентификаторКурьераCRM());
	Запрос.УстановитьПараметр("СвойствоИдентификаторОрганизации", Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоИдентификаторОрганизацииCRM());
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции 

Функция ПолучитьДанныеСамозанятогоКурьера(Договор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КонтактнаяИнформация.Ссылка КАК Ссылка,
	|	КонтактнаяИнформация.Вид КАК Вид,
	|	КонтактнаяИнформация.Представление КАК Представление
	|ПОМЕСТИТЬ ВТ_КонтактнаяИнформация
	|ИЗ
	|	Справочник.Контрагенты.КонтактнаяИнформация КАК КонтактнаяИнформация
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК Договоры
	|		ПО КонтактнаяИнформация.Ссылка = Договоры.Контрагент
	|ГДЕ
	|	Договоры.Ссылка = &Договор
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеДоговора.Ссылка КАК Договор,
	|	ДанныеДоговора.Контрагент КАК Контрагент,
	|	ДанныеДоговора.Контрагент.Наименование КАК ФИО,
	|	ДанныеДоговора.Организация КАК ГоловнаяОрганизация,
	|	ВЫБОР
	|		КОГДА ДанныеДоговора.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДоговоровКонтрагентов.Действует)
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Статус,
	|	ДанныеДоговора.Логс_ИдентификаторCRM КАК ИдентификаторCRM,
	|	ДанныеДоговора.Логс_ТипКурьера КАК ТипКурьера,
	|	ЕСТЬNULL(КонтактнаяИнформацияТелефон.Представление, """") КАК Телефон,
	|	ЕСТЬNULL(КонтактнаяИнформацияEmail.Представление, """") КАК Email,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Серия, """") КАК СерияПаспорта,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.Номер, """") КАК НомерПаспорта,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.КодПодразделения, """") КАК КодПодразделения,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.КемВыдан, """") КАК КемВыдан,
	|	ЕСТЬNULL(ДокументыФизическихЛиц.ДатаВыдачи, """") КАК ДатаВыдачи,
	|	ЕСТЬNULL(ДанныеДоговора.Партнер.ДатаРождения, """") КАК ДатаРождения
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДанныеДоговора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформация КАК КонтактнаяИнформацияТелефон
	|		ПО ДанныеДоговора.Контрагент = КонтактнаяИнформацияТелефон.Ссылка
	|			И (КонтактнаяИнформацияТелефон.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонМобильныйФизическиеЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КонтактнаяИнформация КАК КонтактнаяИнформацияEmail
	|		ПО ДанныеДоговора.Контрагент = КонтактнаяИнформацияEmail.Ссылка
	|			И (КонтактнаяИнформацияEmail.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.EMailФизическиеЛица))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыФизическихЛиц.СрезПоследних КАК ДокументыФизическихЛиц
	|		ПО ДанныеДоговора.Контрагент = ДокументыФизическихЛиц.Физлицо
	|			И (ДокументыФизическихЛиц.ВидДокумента = ЗНАЧЕНИЕ(Справочник.ВидыДокументовФизическихЛиц.ПаспортРФ))
	|ГДЕ
	|	ДанныеДоговора.Ссылка = &Договор";

	Запрос.УстановитьПараметр("Ссылка", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции 

#КонецОбласти 

#КонецОбласти 

Функция ПреобразоватьДатуJSON(ДатаСтрока) Экспорт
	
	//Если Не ЗначениеЗаполнено(ДатаСтрока)  Тогда
	// 21.12.2019 Архипкин Р.В.
	// обрабатываем необычный формат даты
	Если Не ЗначениеЗаполнено(ДатаСтрока) ИЛИ ДатаСтрока = "0000-00-00" Тогда
		Возврат '00010101';
	КонецЕсли; 
	
	ЧастиДатыJSON = СтрРазделить(ДатаСтрока, "T");
	КоличествоЧастейДаты = ЧастиДатыJSON.Количество();
	Если КоличествоЧастейДаты < 1 Тогда
		ВызватьИсключение НСтр("ru='Неверный формат даты'");
	КонецЕсли; 
	
	СоставДаты = СтрРазделить(ЧастиДатыJSON[0], "-");
	Если СоставДаты.Количество() <> 3 Тогда
		ВызватьИсключение НСтр("ru='Неверный формат даты'");
	КонецЕсли; 
	
	Если КоличествоЧастейДаты > 1 Тогда
		СоставВремени = СтрРазделить(ЧастиДатыJSON[1], ":");
		Если СоставВремени.Количество() <> 3 Тогда
			ВызватьИсключение НСтр("ru='Неверный формат даты'");
		КонецЕсли; 
	Иначе
		СоставВремени = Неопределено;
	КонецЕсли;
	
	Результат = Дата(Число(СоставДаты[0]), Число(СоставДаты[1]), Число(СоставДаты[2]));
	
	Если СоставВремени <> Неопределено Тогда  
		
		//++ Ким Виктор 02.03.2026
		//https://logit.okdesk.ru/issues/1055#!
		Если СтрНайти(СоставВремени[2], "Z")  <> 0 Тогда 
			СоставВремени[2] = СтрЗаменить(СоставВремени[2], "Z", "");
		КонецЕсли;   
		//-- Ким Виктор 02.03.2026
				
		КоличествоСекунд = Число(СоставВремени[0]) * 3600 + Число(СоставВремени[1]) * 60 + Число(СоставВремени[2]);
		Результат = Результат + КоличествоСекунд;
	КонецЕсли; 
	
	Возврат Результат;
	
КонецФункции 

Функция ВебСервисОтвет(КодРезультата, Данные, ТекстОшибки = Неопределено) Экспорт
	
	Ответ = Новый Структура;
	Ответ.Вставить("status", КодРезультата);
	
	Если ЗначениеЗаполнено(Данные) Тогда
		Ответ.Вставить("response", Данные);
	КонецЕсли; 
	Если ТекстОшибки <> Неопределено Тогда
		Ответ.Вставить("error", ТекстОшибки);
	КонецЕсли; 
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Ответ);
	
	HTTPОтвет = Новый HTTPСервисОтвет(200);
	HTTPОтвет.Заголовки.Вставить("Content-type", "application/json; charset=utf-8");
	HTTPОтвет.УстановитьТелоИзСтроки(ЗаписьJSON.Закрыть());
	Возврат HTTPОтвет;
	
КонецФункции 

Функция ПараметрыЗапросаВСтруктуру(ПараметрыЗапроса) Экспорт
	
	Результат = Новый Структура;
	
	Если Не ЗначениеЗаполнено(ПараметрыЗапроса) Тогда
		Возврат Результат;
	КонецЕсли; 
	
	МассивПараметров = СтрРазделить(ПараметрыЗапроса, "&", Ложь);
	
	Для каждого Параметр Из МассивПараметров Цикл
		КлючИЗначение = СтрРазделить(Параметр, "=");
		Результат.Вставить(КлючИЗначение[0], ?(КлючИЗначение.Количество() = 1, Неопределено, КлючИЗначение[1]));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции 

Функция ЗначениеПараметраЗапроса(ПараметрыЗапроса, ИмяПараметра, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	ЗначениеПараметра = ПараметрыЗапроса.Получить(ИмяПараметра);
	Возврат ?(ЗначениеПараметра = Неопределено, ЗначениеПоУмолчанию, ЗначениеПараметра);
	
КонецФункции 

#Область Прочее

Функция ПолучитьСписокАгентовДляЗагрузкиЗаявокНаДоставку(Партнер = Неопределено, МассивНомерДоговор = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Партнер", Партнер);
	Запрос.УстановитьПараметр("ВалютаУпрУчета", Константы.ВалютаУправленческогоУчета.Получить());
		
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Логс_ИдентификаторCRM КАК ИдентификаторКлиента,
	|	ДоговорыКонтрагентов.Организация КАК Организация,
	|	ДоговорыКонтрагентов.Партнер КАК Партнер,
	|	ДоговорыКонтрагентов.Контрагент КАК Контрагент,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	ВЫБОР
	|		КОГДА УчетнаяПолитикаОрганизацийСрезПоследних.ПрименяетсяУСН
	|				ИЛИ УчетнаяПолитикаОрганизацийСрезПоследних.ПрименяетсяУСНДоходыМинусРасходы
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС)
	|		ИНАЧЕ ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС)
	|	КОНЕЦ КАК НалогообложениеНДС,
	|	ДоговорыКонтрагентов.СтавкаНДС КАК СтавкаНДС,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.ВалютаВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
	|			ТОГДА &ВалютаУпрУчета
	|		ИНАЧЕ ДоговорыКонтрагентов.ВалютаВзаиморасчетов
	|	КОНЕЦ КАК Валюта
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаОрганизаций.СрезПоследних КАК УчетнаяПолитикаОрганизацийСрезПоследних
	|		ПО ДоговорыКонтрагентов.Организация = УчетнаяПолитикаОрганизацийСрезПоследних.Организация
	|ГДЕ
	|	ДоговорыКонтрагентов.Логс_ОбменСCRM
	|	И ДоговорыКонтрагентов.Номер В (&МассивНомерДоговор)
	|	И ДоговорыКонтрагентов.Логс_ВидДоговораCRM = ЗНАЧЕНИЕ(Перечисление.Логс_ВидыДоговоровCRM.Агентский)
	|	И ДоговорыКонтрагентов.Логс_ИдентификаторCRM <> """"
	|	И &ТекстОтборПоПартнеру";
	
	ТекстОтборПоПартнеру = ?(ЗначениеЗаполнено(Партнер),
		"ДоговорыКонтрагентов.Партнер = &Партнер",
		"ИСТИНА");
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтборПоПартнеру", ТекстОтборПоПартнеру);
	
	Если МассивНомерДоговор = Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ДоговорыКонтрагентов.Номер В (&МассивНомерДоговор)", "");
	Иначе
		Запрос.УстановитьПараметр("МассивНомерДоговор", МассивНомерДоговор);
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции 

Функция СтруктураВПараметрыЗапроса(Структура)
	
	ПараметрыЗапроса = "";
	
	Для каждого Параметр Из Структура Цикл
		ПараметрыЗапроса = ПараметрыЗапроса + Параметр.Ключ + "=" + Формат(Параметр.Значение, "ЧН=0; ЧГ=") + "&";
	КонецЦикла;
	
	Если ПараметрыЗапроса <> "" Тогда
		ПараметрыЗапроса = Лев(ПараметрыЗапроса, СтрДлина(ПараметрыЗапроса) - 1);
	КонецЕсли; 
	
	Возврат ПараметрыЗапроса;
	
КонецФункции 

//Функция ПредставлениеТипаДоставкиЗаявки(ТипДоставки)
//	
//	Если ТипДоставки = Перечисления.Логс_УУТипыДоставок.MSK Тогда
//		Возврат "MSK";
//	ИначеЕсли ТипДоставки = Перечисления.Логс_УУТипыДоставок.PVZ Тогда
//		Возврат "PVZ";
//	КонецЕсли; 
//	
//	Возврат "ZZZ";
//			
//КонецФункции 

Функция СтрокаВЧисло(Строка) 
	
	Если Строка = Неопределено Тогда 
		Возврат 0 ;
	КонецЕсли;
	
	Попытка
		Возврат Число(Строка);
	Исключение
		Возврат 0;
	КонецПопытки;
	
КонецФункции 

Процедура ДобавитьМассивЗаявокВТаблицуЗначений(ТаблицаЗаявок, СводЗаявок, ДанныеАгента, НомерЗаявки = Неопределено, ТДРегион = Неопределено)
	
	Для каждого Заявки Из СводЗаявок.Своды Цикл
		
		Если НомерЗаявки <> Неопределено
				И НомерЗаявки <> СокрЛП(Заявки.order_id) Тогда
			Продолжить;
		КонецЕсли; 
		
		// если есть отбор по ТД регион
		Если Заявки.is_regional <> "0" Тогда
			ТДРегионСРМ = Истина;
		Иначе	
			ТДРегионСРМ = Ложь;	
		КонецЕсли;
		Если ТДРегион <> Неопределено Тогда 			
			Если ТДРегион <> ТДРегионСРМ Тогда
				Продолжить;
			КонецЕсли;			
		КонецЕсли;	  			
		
		СтрокаЗаявка = ТаблицаЗаявок.Добавить();
		СтрокаЗаявка.ЭтоЗабор = Ложь;
		
		ЗаполнитьЗначенияСвойств(СтрокаЗаявка, ДанныеАгента,
			"ИдентификаторКлиента,Организация,Партнер,Контрагент," +
			"Договор,СтавкаНДС,НалогообложениеНДС,Валюта");
		
		СтрокаЗаявка.ДатаДоставки = ПреобразоватьДатуJSON(Заявки.delivery_date);
		СтрокаЗаявка.ДатаДоставкиПлан = ПреобразоватьДатуJSON(Заявки.plan_delivery_date);
		СтрокаЗаявка.НомерЗаказа = СокрЛП(Заявки.order_id);
		СтрокаЗаявка.Статус = Заявки.status;
		СтрокаЗаявка.Вес = СтрокаВЧисло(Заявки.weight);
		СтрокаЗаявка.РасстояниеОтМКАД = СтрокаВЧисло(Заявки.mkad_distance);
		СтрокаЗаявка.ОценочнаяСтоимость = СтрокаВЧисло(Заявки.os);
		СтрокаЗаявка.СтоимостьЗаказа = СтрокаВЧисло(Заявки.price_first);
		СтрокаЗаявка.ДатаЗабора = ПреобразоватьДатуJSON(Заявки.akt_on_ware_date);
		СтрокаЗаявка.ДатаВозврата = ПреобразоватьДатуJSON(Заявки.akt_to_back_cli);
		СтрокаЗаявка.СуммаВозврата = СтрокаВЧисло(Заявки.goodsSumma);
		СтрокаЗаявка.IDЗона = Заявки.zone_id;
		СтрокаЗаявка.КодРегиона = Заявки.region_code;
		СтрокаЗаявка.Приоритет = Заявки.pay_type;
		СтрокаЗаявка.ТипКурьера = Заявки.courier_type;
		СтрокаЗаявка.РегиональнаяЗаявка = СтрокаЗаявка.КодРегиона <> ""
											И СтрокаЗаявка.КодРегиона <> "77"
											И СтрокаЗаявка.КодРегиона <> "50";
		СтрокаЗаявка.ФормаОплаты = Логс_ДоговорыАгентов.ФормаОплатыУслугАгенту(ДанныеАгента, СтрокаЗаявка.РегиональнаяЗаявка, СтрокаЗаявка.ДатаДоставки);
		
		Если Заявки.Свойство("inner_n") Тогда
			СтрокаЗаявка.НомерЗаказаКлиента = Заявки.inner_n;
		КонецЕсли; 
		МассивГород = Заявки.city;
		Если ТипЗнч(МассивГород) = Тип("Массив") И МассивГород.Количество() > 0 Тогда
			СтрокаЗаявка.Город = МассивГород[0];
		КонецЕсли;
		СтрокаЗаявка.СтоимостьДоставкиПринципала = Заявки.price_client_delivery;
		
		СтрокаЗаявка.НаложенныйПлатеж = СтрокаВЧисло(Заявки.price_client);
		СтрокаЗаявка.Тариф = СтрокаВЧисло(Заявки.pd_tar);
		СтрокаЗаявка.КассовоеОбслуживание = СтрокаВЧисло(Заявки.pd_ko);
		СтрокаЗаявка.Эквайринг = СтрокаВЧисло(Заявки.pd_eq);
		СтрокаЗаявка.Страхование = СтрокаВЧисло(Заявки.pd_dop_strah);
		СтрокаЗаявка.Комплектация = СтрокаВЧисло(Заявки.pd_dop_compl);
		СтрокаЗаявка.Упаковка = СтрокаВЧисло(Заявки.pd_dop_pack);
		СтрокаЗаявка.Этикирование = СтрокаВЧисло(Заявки.pd_label);
		СтрокаЗаявка.Прозвон = СтрокаВЧисло(Заявки.pd_call);
		СтрокаЗаявка.СМС = СтрокаВЧисло(Заявки.pd_sms);
		СтрокаЗаявка.ОбработкаВозврата = СтрокаВЧисло(Заявки.pd_dop_vozvrat);
		СтрокаЗаявка.Обмен = СтрокаВЧисло(Заявки.pd_change);
		СтрокаЗаявка.ЗаносКГТ = СтрокаВЧисло(Заявки.pd_kgt_tar);
		СтрокаЗаявка.ВозвратныеДокументы = СтрокаВЧисло(Заявки.pd_docs_return);
		СтрокаЗаявка.ОбработкаЧастичногоВыкупа = СтрокаВЧисло(Заявки.pd_return);
		СтрокаЗаявка.ТДРегион = ТДРегионСРМ;	
		Если СтрокаЗаявка.ТДРегион Тогда
			СтрокаЗаявка.АгентРегион = Справочники.Партнеры.НайтиПоНаименованию("ИНТЕРНЕТ ЛОГИСТИКА", Истина);
		Иначе
			СтрокаЗаявка.АгентРегион = Справочники.Партнеры.ПустаяСсылка();
		КонецЕсли;	
			
		СтрокаЗаявка.ПолнаяСтоимость = СтрокаЗаявка.Тариф + СтрокаЗаявка.ПовторнаяДоставка +
			СтрокаЗаявка.КассовоеОбслуживание + СтрокаЗаявка.Эквайринг + СтрокаЗаявка.Страхование + 
			СтрокаЗаявка.ЗаносКГТ + СтрокаЗаявка.ВозвратныеДокументы + СтрокаЗаявка.СМС +
			СтрокаЗаявка.Прозвон + СтрокаЗаявка.ОбработкаЧастичногоВыкупа;
			//СтрокаСвода.Комплектация + СтрокаСвода.Упаковка + СтрокаСвода.Этикирование + СтрокаСвода.Прозвон;
		
		СтавкаНДСЧисло = УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(СтрокаЗаявка.СтавкаНДС);	
			
		СтрокаЗаявка.ПолнаяСтоимостьНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
			СтрокаЗаявка.ПолнаяСтоимость,
			СтавкаНДСЧисло,
			Ложь);
		СтрокаЗаявка.ПолнаяСтоимостьСНДС = СтрокаЗаявка.ПолнаяСтоимость + СтрокаЗаявка.ПолнаяСтоимостьНДС;
		
		СтрокаЗаявка.СУДСНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
			СтрокаЗаявка.КассовоеОбслуживание + СтрокаЗаявка.Эквайринг,
			СтавкаНДСЧисло,
			Ложь);
		СтрокаЗаявка.СУДС_СНДС = СтрокаЗаявка.КассовоеОбслуживание + СтрокаЗаявка.Эквайринг + СтрокаЗаявка.СУДСНДС;		

		СтрокаЗаявка.КПеречислению =
			?(СтрокаЗаявка.ФормаОплаты = Перечисления.Логс_ФормыОплатыУслугАгенту.Оплата100,
				СтрокаЗаявка.НаложенныйПлатеж,
				СтрокаЗаявка.НаложенныйПлатеж - СтрокаЗаявка.ПолнаяСтоимостьСНДС
			);
		
		Если Заявки.Свойство("courier_id") И ЗначениеЗаполнено(Заявки.courier_id) Тогда
			СтрокаЗаявка.ИдентификаторКурьера = Заявки.courier_id;
		КонецЕсли; 
		
		Если Заявки.Свойство("card")
				И Заявки.card = "Оплата наличными"
				И СтрокаЗаявка.НаложенныйПлатеж <> 0 Тогда
			
			СтрокаЗаявка.ОплатаНаличные = Истина;
			СтрокаЗаявка.ВозвратНаличные = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Для каждого Заборы Из СводЗаявок.Заборы Цикл
		
		СтрокаЗаявка = ТаблицаЗаявок.Добавить();
		СтрокаЗаявка.ЭтоЗабор = Истина;
		
		ЗаполнитьЗначенияСвойств(СтрокаЗаявка, ДанныеАгента,
			"ИдентификаторКлиента,Организация,Партнер,Контрагент," +
			"Договор,СтавкаНДС,НалогообложениеНДС,Валюта");
		
		СтрокаЗаявка.ДатаДоставки = ПреобразоватьДатуJSON(Заборы.delivery_date);
		СтрокаЗаявка.НомерЗаказа = Заборы.zorder_id;
		СтрокаЗаявка.Статус = Заборы.status;
		СтрокаЗаявка.ФормаОплаты = Логс_ДоговорыАгентов.ФормаОплатыУслугАгенту(ДанныеАгента, СтрокаЗаявка.РегиональнаяЗаявка);
		СтрокаЗаявка.Тариф = СтрокаВЧисло(Заборы.zprice_price_client);
			
		СтрокаЗаявка.ПолнаяСтоимость = СтрокаЗаявка.Тариф;
		
		СтрокаЗаявка.ПолнаяСтоимостьНДС = УчетНДСУПКлиентСервер.РассчитатьСуммуНДС(
			СтрокаЗаявка.ПолнаяСтоимость,
			УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(СтрокаЗаявка.СтавкаНДС),
			Ложь);
		СтрокаЗаявка.ПолнаяСтоимостьСНДС = СтрокаЗаявка.ПолнаяСтоимость + СтрокаЗаявка.ПолнаяСтоимостьНДС;

		СтрокаЗаявка.КПеречислению =
			?(СтрокаЗаявка.ФормаОплаты = Перечисления.Логс_ФормыОплатыУслугАгенту.Оплата100,
				0,
				-СтрокаЗаявка.ПолнаяСтоимостьСНДС
			);
			
		Если Заборы.Свойство("courier_id") И ЗначениеЗаполнено(Заборы.courier_id) Тогда
			СтрокаЗаявка.ИдентификаторКурьера = Заборы.courier_id;
		КонецЕсли;				
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ОповеститьПоПочтеНужныйОтдел(Отдел, client_id, Контрагент, ТекстПисьма="")
	МассивАдресов = Новый Массив;
	Если Отдел = "Коммерческий" Тогда
		Адрес = "sales_dep@logsis.ru";
		ИмяАдреса = "Sales_Dep";
		МассивАдресов.Добавить(Новый Структура("email,name,type",Адрес, ИмяАдреса, "to"));
	ИначеЕсли Отдел = "Аккаунтинг" Тогда
		Адрес = "service@logsis.ru";
		ИмяАдреса = "Service";
		МассивАдресов.Добавить(Новый Структура("email,name,type",Адрес, ИмяАдреса, "to"));
	ИначеЕсли Отдел = "Оферта" Тогда
		Адрес = Константы.Логс_АдресаРассылкиНовойОферты.Получить();
		Список = СтрРазделить(Адрес, ";",Ложь);
		Для Каждого тАдрес из Список Цикл
			МассивАдресов.Добавить(Новый Структура("email,name,type",тАдрес, тАдрес, "to"));
		КонецЦикла;	
		
	КонецЕсли;
	
	Путь = КаталогВременныхФайлов();	
	ПутьКJSON = "" + Путь + client_id;
	
	СоздатьКаталог(ПутьКJSON);
	
	Запись = Новый ЗаписьJSON;
	
	Запись.ОткрытьФайл("" + ПутьКJSON + "\" + "send.json");
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
    НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
    НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
	
	
	//МассивФайлов = Новый Массив;
	Если Отдел = "Оферта" Тогда
		Тема = "Открыт ЛК (Оферта) №" + client_id + " " + Контрагент;
		Текст = "Открыт ЛК (Оферта) №" + client_id + " " + Контрагент + ?(ТекстПисьма = "", "", ""+Символы.ПС+ТекстПисьма);
	Иначе
		Тема = "Открыт ЛК № " + client_id + " " + Контрагент;
		Текст = "Открыт ЛК № " + client_id + " " + Контрагент + ?(ТекстПисьма = "", "", ""+Символы.ПС+ТекстПисьма);
	КонецЕсли;
	
	ДанныеСообщения = Новый Структура;
	ДанныеСообщения.Вставить("html", "<p>" + Текст + "</p>");
	ДанныеСообщения.Вставить("subject", Тема);
	ДанныеСообщения.Вставить("from_email", "info@logsis.ru");
	ДанныеСообщения.Вставить("from_name", "logsis");
	ДанныеСообщения.Вставить("to", МассивАдресов);
	ДанныеСообщения.Вставить("important", "false");
	ДанныеСообщения.Вставить("track_opens", "null");
    ДанныеСообщения.Вставить("track_clicks", "null");
    ДанныеСообщения.Вставить("auto_text", "null");
    ДанныеСообщения.Вставить("auto_html", "null");
    ДанныеСообщения.Вставить("inline_css", "null");
    ДанныеСообщения.Вставить("url_strip_qs", "null");
    ДанныеСообщения.Вставить("preserve_recipients", "null");
    ДанныеСообщения.Вставить("view_content_link", "null");
	
	//МассивКартинок = Новый Массив;
	//ПолноеИмяФайлаКартинки = "" + Путь + "logo.png";
	//Текст = Base64Строка(Новый ДвоичныеДанные(ПолноеИмяФайлаКартинки));
	//МассивФайлов.Добавить(Новый Структура("type,name,content","image/png", "logo", """" + Текст + """"));
	
	
	Данные = Новый Структура;
	КлючАПИ = Константы.Логс_КлючАпиСервисаПочтовыхРассылок.Получить();
	КлючАПИ = ?(ЗначениеЗаполнено(КлючАПИ), КлючАПИ, "jUibmIWtROAJMMScZZiwDA");
	Данные.Вставить("message",ДанныеСообщения);
	//Данные.Вставить("images",МассивКартинок);
	Данные.Вставить("async", "false");
    Данные.Вставить("ip_pool", "Main Pool");
    Данные.Вставить("send_at", "2019-08-20 20:20:20");
    
	ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
    Запись.Закрыть();
	
	//POST запрос к мандрилу
	АдресСервера = "mandrillapp.com";
	HTTPСоединение = Новый HTTPСоединение(АдресСервера,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
	
	ЗаголовокЗапросаHTTP = Новый Соответствие();	
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=utf-8");	
	
	запросPOST = Новый HTTPЗапрос("/api/1.0/messages/send.json", ЗаголовокЗапросаHTTP);
	запросPOST.УстановитьИмяФайлаТела("" + ПутьКJSON + "\" + "send.json");
	
	ФайлРезультата = ПолучитьИмяВременногоФайла();
	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(запросPOST, ФайлРезультата);
	Если HTTPОтвет.КодСостояния = 200 Тогда
		РегистрыСведений.Логс_ПочтовыеРассылки.ЗарегистрироватьРассылку(Адрес, Тема, Текст, "Открытие ЛК");
	Иначе
		РегистрыСведений.Логс_ПочтовыеРассылки.ОтправитьРассылкуАсинхронно(Адрес, Тема, Текст, "Открытие ЛК");
	КонецЕсли;		
КонецПроцедуры

Процедура Логс_ОповещениеОбИстекающемДМС() Экспорт
	
	Если Константы.ПараметрыБлокировкиРаботыСВнешнимиРесурсами.Получить().Получить().РаботаСВнешнимиРесурсамиЗаблокирована Тогда
		//ВызватьИсключение "В копиях баз запрещен обмен с CRM";
		Возврат; 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДанныеДляПодбораСотрудников.Сотрудник КАК Сотрудник,
	               |	ДанныеДляПодбораСотрудников.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	МАКСИМУМ(ДанныеДляПодбораСотрудников.Начало) КАК Начало
	               |ПОМЕСТИТЬ ВТ_МаксСтатусы
	               |ИЗ
	               |	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудников
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДанныеДляПодбораСотрудников.Сотрудник,
	               |	ДанныеДляПодбораСотрудников.ФизическоеЛицо
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ  Различные
	               |	Логс_ПолисыДМСФизическихЛицСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	               |	Логс_ПолисыДМСФизическихЛицСрезПоследних.ДатаОкончанияПолиса КАК ДатаОкончанияПолиса,
	               |	РАЗНОСТЬДАТ(Логс_ПолисыДМСФизическихЛицСрезПоследних.ДатаОкончанияПолиса, &ТекущаяДата, ДЕНЬ) КАК ОсталосьДней
	               |ИЗ
	               |	РегистрСведений.Логс_ПолисыДМСФизическихЛиц.СрезПоследних КАК Логс_ПолисыДМСФизическихЛицСрезПоследних
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудников
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксСтатусы КАК ВТ_МаксСтатусы
	               |			ПО ДанныеДляПодбораСотрудников.Сотрудник = ВТ_МаксСтатусы.Сотрудник
	               |				И (ВТ_МаксСтатусы.Начало = ДанныеДляПодбораСотрудников.Начало)
	               |		ПО Логс_ПолисыДМСФизическихЛицСрезПоследних.ФизическоеЛицо = ДанныеДляПодбораСотрудников.ФизическоеЛицо
	               |ГДЕ
	               |	(ДанныеДляПодбораСотрудников.Окончание >= &ТекущаяДата
	               |			ИЛИ ДанныеДляПодбораСотрудников.Окончание = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	               |	И ДанныеДляПодбораСотрудников.ВидСобытия <> &ВидСобытияУвольнение
	               |	И Логс_ПолисыДМСФизическихЛицСрезПоследних.ДатаОкончанияПолиса > ДАТАВРЕМЯ(2000, 1, 1, 0, 0, 0)
	               |	И (Логс_ПолисыДМСФизическихЛицСрезПоследних.ДатаОкончанияПолиса < &ТекущаяДата
	               |			ИЛИ РАЗНОСТЬДАТ(Логс_ПолисыДМСФизическихЛицСрезПоследних.ДатаОкончанияПолиса, &ТекущаяДата, ДЕНЬ) В (30, 20, 10, 5, 3, 2, 1, 0))
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ДатаОкончанияПолиса";
	ТекДата = НачалоДня(ТекущаяДата());
	Запрос.УстановитьПараметр("ТекущаяДата", ТекДата);
	Запрос.УстановитьПараметр("ВидСобытияУвольнение", Перечисления.ВидыКадровыхСобытий.Увольнение);
	
	Выборка = Запрос.Выполнить().Выбрать();
	ТекстПисьма = "";
	Пока Выборка.Следующий() Цикл
		ТекстПисьма = ТекстПисьма + Выборка.ФизическоеЛицо + " : " + Формат(Выборка.ДатаОкончанияПолиса, "ДФ=dd.MM.yyyy")+ " ("+?(Выборка.ДатаОкончанияПолиса>ТекДата, Выборка.ОсталосьДней + " дн.)", "просрочен)") + Символы.ПС;
	КонецЦикла;
	
	Если НЕ ТекстПисьма="" Тогда
		ТекстПисьма = "Добрый день!"+ Символы.ПС+ "У следующих сотрудников заканчивается срок действия полиса ДМС:" + Символы.ПС+ТекстПисьма;
		
		Адреса = Константы.Логс_АдресаРассылкиПоИстекающимСрокамДМС.Получить();
		РегистрыСведений.Логс_ПочтовыеРассылки.ОтправитьРассылкуСинхронно(Адреса, "Истекающие сроки полисов ДМС сотрудников", ТекстПисьма);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура Логс_ФоноваяОтправкаРассылок() Экспорт
	Если Константы.ПараметрыБлокировкиРаботыСВнешнимиРесурсами.Получить().Получить().РаботаСВнешнимиРесурсамиЗаблокирована Тогда
		//ВызватьИсключение "В копиях баз запрещен обмен с CRM";
		Возврат; 
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Логс_ПочтовыеРассылки.ДатаРассылки КАК ДатаРассылки,
	               |	Логс_ПочтовыеРассылки.УИД КАК УИД,
	               |	Логс_ПочтовыеРассылки.Рассылка КАК Рассылка,
	               |	Логс_ПочтовыеРассылки.Получатели КАК Получатели,
	               |	Логс_ПочтовыеРассылки.ТемаПисьма КАК ТемаПисьма,
	               |	Логс_ПочтовыеРассылки.ТекстПисьма КАК ТекстПисьма,
	               |	Логс_ПочтовыеРассылки.ДополнительныеДанные КАК ДополнительныеДанные,
	               |	Логс_ПочтовыеРассылки.Отправлена КАК Отправлена
	               |ИЗ
	               |	РегистрСведений.Логс_ПочтовыеРассылки КАК Логс_ПочтовыеРассылки
	               |ГДЕ
	               |	НЕ Логс_ПочтовыеРассылки.Отправлена
	               |	И Логс_ПочтовыеРассылки.ДатаРассылки <= &ТекущаяДата";
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Адреса = СтрРазделить(Выборка.Получатели, "; ", Ложь);
		РегистрыСведений.Логс_ПочтовыеРассылки.ОтправитьРассылку_В2(Адреса, Выборка.ТемаПисьма, Выборка.ТекстПисьма,Выборка.ДополнительныеДанные, Выборка.Рассылка, Выборка.УИД);
		
	КонецЦикла;
КонецПроцедуры

//++ Ким Виктор 17.12.2024
//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15273
Функция ЗапускМеханизмаСтавкиНДСОрионЛогистика() Экспорт 
	
	Возврат Дата("20250101");
		
КонецФункции

Процедура ПроверитьОбъектОрганизацияОрион(Организация, тСтавка)
	
	ОргОрион = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9728051543");
	
	Если Организация = ОргОрион И тСтавка.Наименование <> "5%" Тогда 
		
		ТаблицаДопРеквизитов = Новый ТаблицаЗначений;
		ТаблицаДопРеквизитов.Колонки.Добавить("Свойство", Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения"));
		ТаблицаДопРеквизитов.Колонки.Добавить("Значение");
		ТаблицаДопРеквизитов.Колонки.Добавить("ТекстоваяСтрока");
		
		НоваяСтрока = ТаблицаДопРеквизитов.Добавить();
		НоваяСтрока.Свойство = Логс_ДополнительныеПроцедурыИФункцииПовтИсп.СвойствоСтавкаНДСОрганизацииCRM();
		НоваяСтрока.Значение = Справочники.ЗначенияСвойствОбъектов.НайтиПоНаименованию("5%"); 
		
		УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(ОргОрион, ТаблицаДопРеквизитов);
		
		
		тСтавка = НоваяСтрока.Значение;
	КонецЕсли;
		 
КонецПроцедуры

Функция ПредставлениеТипаДоставкиЗаявки(ТипДоставки)
	
	Если ТипДоставки = Перечисления.Логс_УУТипыДоставок.MSK Тогда
		Возврат "MSK";
	ИначеЕсли ТипДоставки = Перечисления.Логс_УУТипыДоставок.PVZ Тогда
		Возврат "PVZ";
	КонецЕсли; 
	
	Возврат "ZZZ";
			
КонецФункции 

//-- Ким Виктор 17.12.2024

#КонецОбласти  

#Область НовыеРеквизитыЗаявкиНаДоставку

//Делалось для всех реквизитов, по итогу только для контрагента ШОП ТВ ООО;
Процедура ЗаписатьНовыйРеквизиты(СтруктураЗаписи)
	
	РегистрыСведений.Логс_РеквизитыЗаявкиНаДоставку.ЗаписатьОбновитьДанныеВРегистр(СтруктураЗаписи);
	
КонецПроцедуры  
	
#КонецОбласти

#Область СпецифическиеРеквизитыЗаявкиНаДоставку

//Делается конкретно для Спортмастера, Остина
Процедура ЗаписатьНовыеСпецифическиеРеквизиты(СтрукутраЗаписи)
	
	РегистрыСведений.Логс_СпецифическиеРеквизитыЗаявкиНаДоставку.ЗаписатьОбновитьДанныеВРегистр(СтрукутраЗаписи);
		
КонецПроцедуры

	
#КонецОбласти



#КонецОбласти 