#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания; 

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период = ТекущаяДатаСеанса();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания = ЗначениеЗаполнено(ИдентификаторЗадания);
	Если ПодключитьОбработчикОжидания Тогда
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаОжидание;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		ОтменитьВыполнениеЗадания();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандыФормы

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	ОчиститьСообщения();
	
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
	
	РезультатВыполнения = СоздатьДокументыНаСервере();
	
	Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаОжидание;
		
	ИначеЕсли РезультатВыполнения.Свойство("ОтказПроверкиЗаполнения") Тогда
		
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаПараметры;
		
	Иначе
		
		ОбработатьВыполнениеЗадания();
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтменитьВыполнениеЗадания()
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 

			ОбработатьВыполнениеЗадания();
		
		Иначе
			
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
				
		КонецЕсли;
			
	Исключение
			
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаПараметры;
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьПараметрыОбработки()
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("Команда", "СоздатьРасходныеКассовыеОрдера");
	ПараметрыОбработки.Вставить("Период", Период);
	ПараметрыОбработки.Вставить("ТолькоСоздаватьНовые", НеПерезаписыватьДокументы);
	
	Возврат ПараметрыОбработки;
	
КонецФункции 

&НаСервере
Функция СоздатьДокументыНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Новый Структура("ЗаданиеВыполнено, ОтказПроверкиЗаполнения", Истина, Истина);
	КонецЕсли; 
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
	ИдентификаторЗадания = Неопределено;
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаПараметры;
	
	ПараметрыЗагрузки = ПодготовитьПараметрыОбработки();
	
	РезультатВыполнения = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"Обработки.Логс_УУСозданиеРеглДокументов.СоздатьРеглДокументы",
		ПараметрыЗагрузки,
		"УУ Создание регламентированных документов от " + ТекущаяДатаСеанса());
		
	АдресХранилища       = РезультатВыполнения.АдресХранилища;
	ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыполнениеЗадания()
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаПараметры;
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	ТекстСообщения = ?(РезультатВыполнения.Успешно,
		НСтр("ru='Создание документов выполнено.'"),
		НСтр("ru='Во время создания документов приозошли ошибки.
			|Подробности см. в журнале регистрации'"));
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыполнениеЗаданияЗавершение",
					ЭтотОбъект, РезультатВыполнения.Успешно);
	ПоказатьПредупреждение(Оповещение, ТекстСообщения);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьВыполнениеЗаданияЗавершение(ЗакрытьФорму) Экспорт
	
	Если ЗакрытьФорму Тогда
		Закрыть();
	КонецЕсли; 
	
КонецПроцедуры 

#КонецОбласти 