#Область ПрограммныйИнтерфейс

Процедура ОтразитьРасчетыПоНаложеннымПлатежам(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасчетыПоНаложеннымПлатежам = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыПоНаложеннымПлатежам;
	
	Если Отказ Или ТаблицаРасчетыПоНаложеннымПлатежам.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ДвиженияРасчетыПоНаложеннымПлатежам = Движения.Логс_РасчетыПоНаложеннымПлатежам;
	ДвиженияРасчетыПоНаложеннымПлатежам.Записывать = Истина;
	ДвиженияРасчетыПоНаложеннымПлатежам.Загрузить(ТаблицаРасчетыПоНаложеннымПлатежам);
	
КонецПроцедуры 

Процедура ОтразитьРасчетыПоУслугамЗаДоставку(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаРасчетыПоУслугамЗаДоставку = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасчетыПоУслугамЗаДоставку;
	
	Если Отказ Или ТаблицаРасчетыПоУслугамЗаДоставку.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ДвиженияРасчетыПоУслугамЗаДоставку = Движения.Логс_РасчетыПоУслугамЗаДоставку;
	ДвиженияРасчетыПоУслугамЗаДоставку.Записывать = Истина;
	ДвиженияРасчетыПоУслугамЗаДоставку.Загрузить(ТаблицаРасчетыПоУслугамЗаДоставку);
	
КонецПроцедуры 

Процедура ОтразитьСчетаПоУслугам100(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаСчетаПоУслугам100 = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаСчетаПоУслугам100;
	
	Если Отказ Или ТаблицаСчетаПоУслугам100.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ДвиженияСчетаПоУслугам100 = Движения.Логс_СчетаПоУслугам100;
	ДвиженияСчетаПоУслугам100.Записывать = Истина;
	ДвиженияСчетаПоУслугам100.Загрузить(ТаблицаСчетаПоУслугам100);
	
КонецПроцедуры 

Процедура ОтразитьЗаявкиНаРасход100(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ТаблицаЗаявкиНаРасход100 = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаявкиНаРасход100;
	
	Если Отказ Или ТаблицаЗаявкиНаРасход100.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ДвиженияРасчетыПоНаложеннымПлатежам = Движения.Логс_ЗаявкиНаРасход100;
	ДвиженияРасчетыПоНаложеннымПлатежам.Записывать = Истина;
	ДвиженияРасчетыПоНаложеннымПлатежам.Загрузить(ТаблицаЗаявкиНаРасход100);
	
КонецПроцедуры 

Функция ПолучитьХарактеристикуНоменклатурыАгента(Номенклатура, НомерСводаЗаявокНаДоставку, СоздаватьНовую = Истина) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ХарактеристикиНоменклатуры.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ХарактеристикиНоменклатуры КАК ХарактеристикиНоменклатуры
	|ГДЕ
	|	ХарактеристикиНоменклатуры.Владелец = &Номенклатура
	|	И ХарактеристикиНоменклатуры.Наименование = &НомерСводаЗаявокНаДоставку
	|	И НЕ ХарактеристикиНоменклатуры.ПометкаУдаления");
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("НомерСводаЗаявокНаДоставку", НомерСводаЗаявокНаДоставку);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	КонецЕсли; 
	
	Если Не СоздаватьНовую Тогда
		Возврат Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка();
	КонецЕсли; 
	
	Характеристика = Справочники.ХарактеристикиНоменклатуры.СоздатьЭлемент();
	Характеристика.Владелец = Номенклатура;
	Характеристика.Наименование = НомерСводаЗаявокНаДоставку;
	Характеристика.НаименованиеПолное = Характеристика.Наименование;
	Характеристика.Записать();
	
	Возврат Характеристика.Ссылка;
	
КонецФункции 

Функция ПолучитьБлижайшийДеньНедели(Знач Дата, ДниНедели) Экспорт
	
	ТипЧисло = Тип("Число");
	
	// Проверка корретности переданных данных, иначе возможно зацикливание.
	Для каждого ДеньНедели Из ДниНедели Цикл
		Если ТипЗнч(ДеньНедели) <> ТипЧисло
				Или ДеньНедели < 1
				Или ДеньНедели > 7 Тогда
			ВызватьИсключение СтрШаблон(НСтр("ru='Массив дней недели содержит неверный элемент %1'"), ДеньНедели);
		КонецЕсли; 
	КонецЦикла;
	
	ТекДеньНедели = ДеньНедели(Дата);
	Пока ДниНедели.Найти(ТекДеньНедели) = Неопределено Цикл
		Дата = Дата + 86400;
		ТекДеньНедели = ДеньНедели(Дата);
	КонецЦикла; 
	
	Возврат Дата;
	
КонецФункции 

Функция СформироватьНаименованиеУслугНаДоставкуПоСводу(СводУслуг, УказыватьПериод = Ложь, УказыватьДоговор = Ложь) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СводУслуг.Номер КАК Номер,
	|	СводУслуг.Дата КАК Дата,
	|	СводУслуг.ВидКлиента КАК ВидКлиента,
	|	ДоговорыКонтрагентов.Логс_НаименованиеУслугПоДоставке КАК НаименованиеУслугПоДоставке,
	|	ДоговорыКонтрагентов.Логс_ДоговорНаОказаниеУслуг КАК ДоговорНаОказаниеУслуг,
	|	ДоговорыКонтрагентов.Ссылка как Договор
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку КАК СводУслуг
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО СводУслуг.Договор = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	СводУслуг.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", СводУслуг);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Строка(СводУслуг);
	КонецЕсли; 
	
	Если Выборка.ВидКлиента = Перечисления.Логс_ВидыКлиентовCRM.Принципал Тогда
		ШаблонНаименования = ?(Выборка.ДоговорНаОказаниеУслуг,
			НСтр("ru='%1 по отчету о доставке заказов №%2 от %3'"),
			НСтр("ru='%1 по отчету агента №%2 от %3'"));
	ИначеЕсли Выборка.ВидКлиента = Перечисления.Логс_ВидыКлиентовCRM.Агент Тогда
		ШаблонНаименования = ?(Выборка.ДоговорНаОказаниеУслуг,
			НСтр("ru='%1 по отчету о доставке заказов №%2 от %3'"),
			НСтр("ru='%1 по отчету субагента №%2 от %3'"));
	Иначе
		ШаблонНаименования = НСтр("ru='%1 по отчету субагента №%2 от %3'");
	КонецЕсли; 
	
	Наименование = СтрШаблон(ШаблонНаименования, Выборка.НаименованиеУслугПоДоставке, Выборка.Номер, Формат(Выборка.Дата, "ДФ=dd.MM.yyyy"));
	
	Если УказыватьДоговор Тогда
		ДополнениеКСодержанию = СтрШаблон(НСтр("ru=' по %1'"), Выборка.Договор);
		Наименование = Наименование + ДополнениеКСодержанию;
	КонецЕсли;
	
	Если УказыватьПериод Тогда
		ДатаНачалаУчета = Дата(2019, 6, 27);
		НачалоПериода = Макс(
			ДатаНачалаУчета,
			?(День(Выборка.Дата) <= 15,
				НачалоМесяца(Выборка.Дата),
				Дата(Год(Выборка.Дата), Месяц(Выборка.Дата), 16)
			));
		КонецПериода = Выборка.Дата;
		ДополнениеКСодержанию = СтрШаблон(НСтр("ru=' за период с %1 по %2'"),
			День(НачалоПериода), Формат(КонецПериода, "ДЛФ=DD"));
		Наименование = Наименование + ДополнениеКСодержанию;
	КонецЕсли;
	
	
	Возврат Наименование;
	
КонецФункции 

Функция РегистраторРасчетовПоУслугамЗаДоставку(ОбъектРасчетов, АналитикаУчетаПоПартнерам, Валюта, Организация = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РегистраторРасчетов.Ссылка КАК Ссылка,
	|	РегистраторРасчетов.Дата КАК Дата,
	|	РегистраторРасчетов.Проведен КАК Проведен
	|ИЗ
	|	Документ.Логс_РегистраторРасчетовПоУслугамЗаДоставку КАК РегистраторРасчетов
	|ГДЕ
	|	РегистраторРасчетов.ОбъектРасчетов = &ОбъектРасчетов
	|	И РегистраторРасчетов.АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам
	|	И РегистраторРасчетов.Валюта = &Валюта
	|	И НЕ РегистраторРасчетов.ПометкаУдаления");
	Запрос.УстановитьПараметр("Валюта", Валюта);
	Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", АналитикаУчетаПоПартнерам);
	Запрос.УстановитьПараметр("ОбъектРасчетов", ОбъектРасчетов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		Если Не Выборка.Проведен Тогда
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		КонецЕсли; 
	Иначе
		ДокументОбъект = Документы.Логс_РегистраторРасчетовПоУслугамЗаДоставку.СоздатьДокумент();
		ДокументОбъект.Валюта = Валюта;
		ДокументОбъект.АналитикаУчетаПоПартнерам = АналитикаУчетаПоПартнерам;
		ДокументОбъект.Организация = ?(Организация = Неопределено,
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(АналитикаУчетаПоПартнерам, "Организация"),
			Организация);
		ДокументОбъект.ОбъектРасчетов = ОбъектРасчетов;
		ДокументОбъект.Дата = ТекущаяДатаСеанса();
		ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли; 
	
	Возврат ДокументОбъект;
	
КонецФункции 

Функция ПодключитьВнешнююОбработкуИзДвоичныхДанных(ДвоичныеДанные) Экспорт
	
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
	
	Если ОбщегоНазначения.ЕстьЗащитаОтОпасныхДействий() Тогда
		ИмяОбработки = ВнешниеОбработки.Подключить(АдресВоВременномХранилище,, Ложь,
			ОбщегоНазначения.ОписаниеЗащитыБезПредупреждений());
	Иначе
		ИмяОбработки = ВнешниеОбработки.Подключить(АдресВоВременномХранилище,, Ложь);
	КонецЕсли; 
	
	Возврат ВнешниеОбработки.Создать(ИмяОбработки);
	
КонецФункции 

Функция ПодключитьВнешнююОбработкуИзХранилищаЗначения(ХранилищеЗначения) Экспорт
	
	Возврат ПодключитьВнешнююОбработкуИзДвоичныхДанных(ХранилищеЗначения.Получить());
	
КонецФункции 

// Определяет, используется ли по документу КУДИР в особом порядке.
//
// Параметры:
//  ДокументСсылка - ДокументСсылка - ссылка на документ.
// 
// Возвращаемое значение:
//  Булево - Истина, если по документу КУДИР в особом порядке.
//
Функция КУДИРвОсобомПорядке(ДокументСсылка) Экспорт
	
	ТипДокумента = ТипЗнч(ДокументСсылка);
	
	Если ТипДокумента = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда
		
		РеквизитыДокумента = ПолучитьРеквизитыКУДИРПоступленияДС(ДокументСсылка);
		
		Если РеквизитыДокумента.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыПоПлатежнойКарте
				Или РеквизитыДокумента.КУДиРвОсобомПорядке
		Тогда
			Возврат Истина;
		КонецЕсли;
		
	//ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетБанкаПоОперациямЭквайринга") Тогда
	//	
	//	Возврат Истина;
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда
		
		РеквизитыДокумента = ПолучитьРеквизитыКУДИРСписанияДС(ДокументСсылка);
		
		Если РеквизитыДокумента.КУДиРвОсобомПорядке Тогда
			Возврат Истина;
		КонецЕсли;
		              
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
		
		РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокументСсылка,
			"УдержатьВознаграждение,Договор,СуммаДокумента,СуммаВознаграждения");
		
		Если Не РеквизитыДокумента.УдержатьВознаграждение Тогда
			Возврат Истина;
		КонецЕсли; 
		
	ИначеЕсли ТипДокумента = Тип("ДокументСсылка.КорректировкаЗадолженности") Тогда
		
		Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Логс_НеФомироватьРасходыУСН") Тогда
			Возврат Истина;
		КонецЕсли; 
		
	Иначе
		
		ДокументМетаданные = ДокументСсылка.Метаданные();
		
		Если ДокументМетаданные.Реквизиты.Найти("Логс_КУДиРвОсобомПорядке") <> Неопределено Тогда
			
			Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Логс_КУДиРвОсобомПорядке") = Истина Тогда
				Возврат Истина;
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если ТипДокумента <> Тип("ДокументСсылка.ПриобретениеУслугПрочихАктивов")
				И ДокументМетаданные.Реквизиты.Найти("Договор") <> Неопределено
		Тогда
			
			Договор = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "Договор");
			Возврат ЗначениеЗаполнено(Договор)
						И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "Логс_КУДиРвОсобомПорядке") = Истина;
						
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Ложь;
	
КонецФункции 

Функция СформироватьНаименованиеУслугНаДоставкуПоСводуМаршрутов(СводМаршрутов, УказыватьПериод = Ложь, УказыватьДоговор = Ложь) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Логс_СводМаршрутов.Номер КАК Номер,
	|	Логс_СводМаршрутов.Дата КАК Дата,
	|	ДоговорыКонтрагентов.Логс_НаименованиеУслугПоДоставке КАК НаименованиеУслугПоДоставке,
	|	ДоговорыКонтрагентов.Логс_ДоговорНаОказаниеУслуг КАК ДоговорНаОказаниеУслуг,
	|	ДоговорыКонтрагентов.Ссылка КАК Договор,
	|	Логс_СводМаршрутов.Ссылка КАК СводМаршрутов
	|ИЗ
	|	Документ.Логс_СводМаршрутов КАК Логс_СводМаршрутов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО Логс_СводМаршрутов.ДоговорСКС = ДоговорыКонтрагентов.Ссылка
	|ГДЕ
	|	Логс_СводМаршрутов.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("Ссылка", СводМаршрутов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Не Выборка.Следующий() Тогда
		Возврат Строка(СводМаршрутов);
	КонецЕсли; 
	
	ШаблонНаименования = НСтр("ru='%1 по отчету субагента №%2 от %3'");
	
	//"Субагентское вознаграждение за доставку заказов по отчету субагента №5783-SKS-00002 от 31.12.2024"
	//Наименование = СтрШаблон(ШаблонНаименования, Выборка.НаименованиеУслугПоДоставке, Выборка.Номер, Формат(Выборка.Дата, "ДФ=dd.MM.yyyy"));
	Наименование = СтрШаблон(ШаблонНаименования, "Субагентское вознаграждение за доставку заказов", Выборка.Номер, Формат(Выборка.Дата, "ДФ=dd.MM.yyyy"));
	
	Если УказыватьДоговор Тогда
		ДополнениеКСодержанию = СтрШаблон(НСтр("ru=' по %1'"), Выборка.Договор);
		Наименование = Наименование + ДополнениеКСодержанию;
	КонецЕсли;
	
	Если УказыватьПериод Тогда
		ДатаНачалаУчета = Дата(2019, 6, 27);
		НачалоПериода = Макс(
			ДатаНачалаУчета,
			?(День(Выборка.Дата) <= 15,
				НачалоМесяца(Выборка.Дата),
				Дата(Год(Выборка.Дата), Месяц(Выборка.Дата), 16)
			));
		КонецПериода = Выборка.Дата;
		ДополнениеКСодержанию = СтрШаблон(НСтр("ru=' за период с %1 по %2'"),
			День(НачалоПериода), Формат(КонецПериода, "ДЛФ=DD"));
		Наименование = Наименование + ДополнениеКСодержанию;
	КонецЕсли;
	
	
	Возврат Наименование;
	
КонецФункции 

#КонецОбласти 

#Область ПодпискиНаСобытия

Процедура ДвиженияРасчетовПоСводамЗаявокНаДоставкуОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	
	ОбновитьДвиженияЗаВычетом(Источник);
	
	Логс_ВзаиморасчетыСКлиентамиСервер.ОбновитьДвиженияДокумента(Источник);
	
	Если НЕ Источник.Движения.Найти("Логс_ВзаиморасчетыПоУслугам100") = Неопределено Тогда
		Источник.Движения.Логс_ВзаиморасчетыПоУслугам100.Очистить();
		Источник.Движения.Логс_ВзаиморасчетыПоУслугам100.Записать();
	КонецЕсли;

	
	Если ТипИсточника = Тип("ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
		ДвиженияРасчетовПоСводамЗаявокНаДоставкуЗаявкаНаРасходованиеДС(Источник, Отказ, РежимПроведения);
		//ДвиженияЛогс_ВзаиморасчетыЗаВычетомЗаявкаНаРасходованиеДС(Источник, Отказ, РежимПроведения);
		ДвиженияРасчетовПоСводамЗаявокНаДоставкуЗаявкаНаРасходованиеДС_20(Источник, Отказ, РежимПроведения);
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств") Тогда
		ДвиженияРасчетовПоСводамЗаявокНаДоставкуСписаниеБезналичныхДС(Источник, Отказ, РежимПроведения);
		//ДвиженияЛогс_ВзаиморасчетыЗаВычетомСписаниеБезналичныхДС(Источник, Отказ, РежимПроведения);
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.РасходныйКассовыйОрдер") Тогда
		ДвиженияРасчетовПоСводамЗаявокНаДоставкуРасходныйКассовыйОрдер(Источник, Отказ, РежимПроведения);
		//ДвиженияЛогс_ВзаиморасчетыЗаВычетомРасходныйКассовыйОрдер(Источник, Отказ, РежимПроведения);
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") Тогда
		ДвиженияРасчетовПоСводамЗаявокНаДоставкуПоступлениеБезналичныхДС_20(Источник, Отказ, РежимПроведения);
		//ДвиженияЛогс_ВзаиморасчетыЗаВычетомПоступлениеБезналичныхДС(Источник, Отказ, РежимПроведения);
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.СчетНаОплатуКлиенту") Тогда
		ДвиженияРасчетовПоСводамЗаявокНаДоставкуСчетНаОплатуКлиенту(Источник, Отказ, РежимПроведения);
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ПриходныйКассовыйОрдер") Тогда
		ДвиженияРасчетовПоСводамЗаявокНаДоставкуПКО_20(Источник, Отказ, РежимПроведения);
		//а нету старого алгоритма
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.КорректировкаЗадолженности") Тогда
		ДвиженияРасчетовПоСводамЗаявокНаДоставкуСписаниеЗадолженности_20(Источник, Отказ, РежимПроведения);
		//ДвиженияЛогс_ВзаиморасчетыЗаВычетомСписаниеЗадолженности(Источник, Отказ, РежимПроведения);
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ВзаимозачетЗадолженности") Тогда
		ДвиженияРасчетовПоСводамЗаявокНаДоставкуВзаимозачетЗадолженности_20(Источник, Отказ, РежимПроведения);
		//ДвиженияЛогс_ВзаиморасчетыЗаВычетомВзаимозачетЗадолженности(Источник, Отказ, РежимПроведения);
	Иначе
		ТекстСообщения = СтрШаблон(
			НСтр("ru='Для документа %1 не поддерживаются расчеты по сводам заявок на доставку'"),
			Источник.Метаданные().Синоним);
		ВызватьИсключение ТекстСообщения;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведенияРасчетыПоСводамЗаявокНаДоставкуОбработкаУдаленияПроведения(Источник, Отказ) Экспорт
	
	ТипИсточника = ТипЗнч(Источник);
	
	Если ТипИсточника = Тип("ДокументОбъект.СчетНаОплатуКлиенту") Тогда
		ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Источник.Ссылка,
			Источник.ДополнительныеСвойства);
		
		Источник.ДополнительныеСвойства.Вставить("ЭтоНовый",    Источник.ЭтоНовый());
		Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения);
		
		Движения = Источник.Движения.Логс_РасчетыПоУслугамЗаДоставку;
		
		ПроведениеСерверУТ.ЗаполнитьДополнительныеСвойстваНабораПоДокументу(Источник, Движения);
		
		Движения.Очистить();
		Движения.Записать();
		
		Движения = Источник.Движения.Логс_СчетаПоУслугам100;
		
		ПроведениеСерверУТ.ЗаполнитьДополнительныеСвойстваНабораПоДокументу(Источник, Движения);
		
		Движения.Очистить();
		Движения.Записать();
		
		Движения = Источник.Движения.Логс_ВзаиморасчетыПоУслугам100;
		
		ПроведениеСерверУТ.ЗаполнитьДополнительныеСвойстваНабораПоДокументу(Источник, Движения);
		
		Движения.Очистить();
		Движения.Записать();
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.КорректировкаЗадолженности") Тогда
		ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Источник.Ссылка,
			Источник.ДополнительныеСвойства);
		
		Источник.ДополнительныеСвойства.Вставить("ЭтоНовый",    Источник.ЭтоНовый());
		Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения);
		
		Движения = Источник.Движения.Логс_ВзаиморасчетыПоУслугам100;
		
		ПроведениеСерверУТ.ЗаполнитьДополнительныеСвойстваНабораПоДокументу(Источник, Движения);
		
		Движения.Очистить();
		Движения.Записать();
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ВзаимозачетЗадолженности") Тогда
		ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Источник.Ссылка,
			Источник.ДополнительныеСвойства);
		
		Источник.ДополнительныеСвойства.Вставить("ЭтоНовый",    Источник.ЭтоНовый());
		Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.ОтменаПроведения);
		
		Движения = Источник.Движения.Логс_ВзаиморасчетыПоУслугам100;
		
		ПроведениеСерверУТ.ЗаполнитьДополнительныеСвойстваНабораПоДокументу(Источник, Движения);
		
		Движения.Очистить();
		Движения.Записать();	
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств") Тогда
		СфорироватьСписокЗависимыхСводовЗаявокПоСписаниюБезналичныхДС(Источник);
		РегистрыСведений.Логс_СостоянияСводовЗаявокНаДоставку.ОтразитьСостояниеСводаЗаявокНаДоставку(Источник, Отказ);
	ИначеЕсли ТипИсточника = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств") Тогда
		РегистрыСведений.Логс_СостоянияСводовЗаявокНаДоставку.ОтразитьСостояниеСводаЗаявокНаДоставку(Источник, Отказ);
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область РегламентныеЗадания

Процедура РеглЗаданиеЗагрузкаЗаявокНаДоставку() Экспорт
	
	Период = НачалоДня(ТекущаяДатаСеанса()) - 1;
	Логс_ОбменСCRM.ЗагрузкаЗаявокНаДоставку(Период, Период);
	
КонецПроцедуры

Процедура РеглЗаданиеСозданиеСводовЗаявокНаДоставку() Экспорт
	
	КонецПериода = НачалоДня(ТекущаяДатаСеанса()) - 1;
	НачалоПериода = НачалоДня(КонецПериода);
	
	СоздатьСводыЗаявокНаДоставку(НачалоПериода, КонецПериода);
	
КонецПроцедуры

Процедура РеглЗаданиеСозданиеСводовЗаявокСКС() Экспорт
	// Вставить содержимое обработчика.
КонецПроцедуры

#КонецОбласти

#Область НовыеДвиженияЗаВычетом
Процедура ОбновитьДвиженияЗаВычетом(Источник)  Экспорт
	
	Если Источник.Движения.Найти("Логс_ВзаиморасчетыЗаВычетом") = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Логс_СводЗаявокНаДоставку.Договор КАК Договор,
	               |	Логс_СводЗаявокНаДоставку.Ссылка КАК Ссылка,
	               |	Логс_СводЗаявокНаДоставку.Дата КАК Дата,
	               |	Логс_СводЗаявокНаДоставку.МоментВремени КАК МоментВремени,
	               |	1 КАК Приоритет
	               |ПОМЕСТИТЬ ВТ_Документы
	               |ИЗ
	               |	Документ.Логс_СводЗаявокНаДоставку КАК Логс_СводЗаявокНаДоставку
	               |ГДЕ
	               |	Логс_СводЗаявокНаДоставку.Ссылка = &ДокументСсылка
				   |	И Логс_СводЗаявокНаДоставку.ФормаОплаты = Значение(Перечисление.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом)
				   //|	И Логс_СводЗаявокНаДоставку.Проведен
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫРАЗИТЬ(ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов.Объект КАК Справочник.ДоговорыКонтрагентов),
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата,
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.МоментВремени,
	               |	ВЫБОР
	               |		КОГДА Логс_РаспределениеПоСводамЗаявокНаДоставку.Ссылка ЕСТЬ NULL
	               |			ТОГДА 6
	               |		ИНАЧЕ 0.9
	               |	КОНЕЦ
	               |ИЗ
	               |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК Логс_РаспределениеПоСводамЗаявокНаДоставку
	               |		ПО ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка = Логс_РаспределениеПоСводамЗаявокНаДоставку.Ссылка
	               |ГДЕ
	               |	ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка = &ДокументСсылка
	               |	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ПроведеноБанком
				   //|	И ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫРАЗИТЬ(ПриходныйКассовыйОрдерРасшифровкаПлатежа.ОбъектРасчетов.Объект КАК Справочник.ДоговорыКонтрагентов),
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата,
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.МоментВремени,
	               |	5
	               |ИЗ
	               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПриходныйКассовыйОрдерРасшифровкаПлатежа
	               |ГДЕ
	               |	ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = &ДокументСсылка
				   //|	И ПриходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫРАЗИТЬ(СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов.Объект КАК Справочник.ДоговорыКонтрагентов),
	               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка,
	               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата,
	               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.МоментВремени,
	               |	4
	               |ИЗ
	               |	Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа
	               |ГДЕ
	               |	СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка = &ДокументСсылка
	               |	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.ПроведеноБанком
				   //|	И СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫРАЗИТЬ(РасходныйКассовыйОрдерРасшифровкаПлатежа.ОбъектРасчетов.Объект КАК Справочник.ДоговорыКонтрагентов),
	               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка,
	               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Дата,
	               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.МоментВремени,
	               |	3
	               |ИЗ
	               |	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдерРасшифровкаПлатежа
	               |ГДЕ
	               |	РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка = &ДокументСсылка
				   //|	И РасходныйКассовыйОрдерРасшифровкаПлатежа.Ссылка.Проведен
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫРАЗИТЬ(ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов.Объект КАК Справочник.ДоговорыКонтрагентов),
	               |	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка,
	               |	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Дата,
	               |	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.МоментВремени,
	               |	0.1
	               |ИЗ
	               |	Документ.ЗаявкаНаРасходованиеДенежныхСредств.РасшифровкаПлатежа КАК ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа
	               |ГДЕ
	               |	ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка = &ДокументСсылка
	               |	И ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате)
				   //|	И ЗаявкаНаРасходованиеДенежныхСредствРасшифровкаПлатежа.Ссылка.Проведен
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫРАЗИТЬ(ВзаимозачетЗадолженности.ОбъектРасчетов.Объект КАК Справочник.ДоговорыКонтрагентов),
	               |	ВзаимозачетЗадолженности.Ссылка,
	               |	ВзаимозачетЗадолженности.Ссылка.Дата,
	               |	ВзаимозачетЗадолженности.Ссылка.МоментВремени,
	               |	7
	               |ИЗ
	               |	Документ.ВзаимозачетЗадолженности.ДебиторскаяЗадолженность КАК ВзаимозачетЗадолженности
	               |ГДЕ
	               |	ВзаимозачетЗадолженности.Ссылка = &ДокументСсылка
				   //|	И ВзаимозачетЗадолженности.Ссылка.Проведен
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫРАЗИТЬ(ВзаимозачетЗадолженности.ОбъектРасчетов.Объект КАК Справочник.ДоговорыКонтрагентов),
	               |	ВзаимозачетЗадолженности.Ссылка,
	               |	ВзаимозачетЗадолженности.Ссылка.Дата,
	               |	ВзаимозачетЗадолженности.Ссылка.МоментВремени,
	               |	7
	               |ИЗ
	               |	Документ.ВзаимозачетЗадолженности.КредиторскаяЗадолженность КАК ВзаимозачетЗадолженности
	               |ГДЕ
	               |	ВзаимозачетЗадолженности.Ссылка = &ДокументСсылка
				   //|	И ВзаимозачетЗадолженности.Ссылка.Проведен
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВЫРАЗИТЬ(СписаниеЗадолженности.ОбъектРасчетов.Объект КАК Справочник.ДоговорыКонтрагентов),
	               |	СписаниеЗадолженности.Ссылка,
	               |	СписаниеЗадолженности.Ссылка.Дата,
	               |	СписаниеЗадолженности.Ссылка.МоментВремени,
	               |	8
	               |ИЗ
	               |	Документ.КорректировкаЗадолженности.Задолженность КАК СписаниеЗадолженности
	               |ГДЕ
	               |	СписаниеЗадолженности.Ссылка = &ДокументСсылка
				   //|	И СписаниеЗадолженности.Ссылка.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИсторияНачалоПериода.НачалоПериода КАК НачалоПериода,
	               |	ИсторияНачалоПериода.ДоговорКонтрагентов КАК ДоговорКонтрагентов,
	               |	ИсторияНачалоПериода.ФормаОплатыУслугАгенту КАК ФормаОплатыУслугАгенту,
	               |	МИНИМУМ(ЕСТЬNULL(ИсторияОкончаниеПериода.Период, ДАТАВРЕМЯ(3999, 12, 31, 23, 59, 59))) КАК ОкончаниеПериода
	               |ПОМЕСТИТЬ ВТ_Периоды
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ИсторияНачалоПериода.Период КАК НачалоПериода,
	               |		ИсторияНачалоПериода.ДоговорКонтрагентов КАК ДоговорКонтрагентов,
	               |		ИсторияНачалоПериода.ФормаОплатыУслугАгенту КАК ФормаОплатыУслугАгенту
	               |	ИЗ
	               |		РегистрСведений.Логс_ИсторияФормыОплатыДоговоров КАК ИсторияНачалоПериода
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Документы КАК ВТ_Документы
	               |			ПО ИсторияНачалоПериода.ДоговорКонтрагентов = ВТ_Документы.Договор
	               |	ГДЕ
	               |		ИсторияНачалоПериода.ФормаОплатыУслугАгенту = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом)
	               |		И ИсторияНачалоПериода.Период <= ВТ_Документы.Дата) КАК ИсторияНачалоПериода
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИсторияФормыОплатыДоговоров КАК ИсторияОкончаниеПериода
	               |		ПО ИсторияНачалоПериода.ДоговорКонтрагентов = ИсторияОкончаниеПериода.ДоговорКонтрагентов
	               |			И ИсторияНачалоПериода.НачалоПериода < ИсторияОкончаниеПериода.Период
	               |			И ИсторияНачалоПериода.ФормаОплатыУслугАгенту <> ИсторияОкончаниеПериода.ФормаОплатыУслугАгенту
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ИсторияНачалоПериода.НачалоПериода,
	               |	ИсторияНачалоПериода.ДоговорКонтрагентов,
	               |	ИсторияНачалоПериода.ФормаОплатыУслугАгенту
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_Документы.Договор.Организация КАК Организация,
	               |	ВТ_Документы.Договор КАК Договор,
	               |	НАЧАЛОПЕРИОДА(ВТ_Документы.Дата, ДЕНЬ) КАК Дата,
	               |	ВТ_Документы.Приоритет КАК Приоритет,
	               |	ВТ_Документы.Ссылка КАК Ссылка,
	               |	ВТ_Документы.МоментВремени КАК МоментВремени
	               |ИЗ
	               |	ВТ_Документы КАК ВТ_Документы
	               |ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Периоды как ВТ_Периоды 
	               |	ПО ВТ_Документы.Договор = ВТ_Периоды.ДоговорКонтрагентов
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_Документы.Договор.Организация,
	               |	ВТ_Документы.Договор,
	               |	НАЧАЛОПЕРИОДА(ВТ_Документы.Дата, ДЕНЬ),
	               |	ВТ_Документы.Приоритет,
	               |	ВТ_Документы.МоментВремени";
	Запрос.УстановитьПараметр("ДокументСсылка", Источник.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	//чистим остатки чтобы убрать коллизии с предыдущими движениями
	//Движения = РегистрыНакопления.Логс_ВзаиморасчетыЗаВычетом.СоздатьНаборЗаписей();
	//Движения.Отбор.Регистратор.Установить(ДокументСсылка);
	//попытка
	//	Движения.Записать();
	//Исключение
	//	//Сообщить("втф пустая ссылка приоритет:"+выборка.приоритет);
	//КонецПопытки;
	
	
	Движения = Источник.Движения.Логс_ВзаиморасчетыЗаВычетом;
	Движения.Очистить();
	ПроведениеСерверУТ.ЗаполнитьДополнительныеСвойстваНабораПоДокументу(Источник, Движения);
	
	Пока Выборка.Следующий() Цикл
		Попытка
		//Движения = РегистрыНакопления.Логс_ВзаиморасчетыЗаВычетом.СоздатьНаборЗаписей();
		//Движения.Отбор.Регистратор.Установить(Выборка.Ссылка);
		//Движения.Прочитать();
		
			Если ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.Логс_СводЗаявокНаДоставку") Тогда
				ДвиженияЗаВычетомПоСводу(Выборка.Ссылка, Выборка.Договор, Движения);
			ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ПоступлениеБезналичныхДенежныхСредств") Тогда
			    ДвиженияЗаВычетомПоступлениеБезналичныхДС(Выборка.Ссылка, Выборка.Договор, Движения)
			ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
			    ДвиженияЗаВычетомПКО(Выборка.Ссылка, Выборка.Договор, Движения)
			ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.СписаниеБезналичныхДенежныхСредств") Тогда
				ДвиженияЗаВычетомСписаниеБезналичныхДС(Выборка.Ссылка, Выборка.Договор, Движения)
			ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
				ДвиженияЗаВычетомРКО(Выборка.Ссылка, Выборка.Договор, Движения)
			ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств") Тогда
				ДвиженияЗаВычетомЗаявкаНаРасходованиеДенежныхСредств(Выборка.Ссылка, Выборка.Договор, Движения)
			ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.ВзаимозачетЗадолженности") Тогда
				ДвиженияЗаВычетомВзаимозачетЗадолженности(Выборка.Ссылка, Выборка.Договор, Движения)
			ИначеЕсли ТипЗнч(Выборка.Ссылка) = Тип("ДокументСсылка.СписаниеЗадолженности") Тогда
				ДвиженияЗаВычетомСписаниеЗадолженности(Выборка.Ссылка, Выборка.Договор, Движения)
			КонецЕсли;
			Движения.Записать(Истина);
		
		Исключение
			//Сообщить("---"+Выборка.Ссылка+": "+ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
КонецПроцедуры

Процедура ДвиженияЗаВычетомПоСводу(Ссылка, Договор, Движения) Экспорт
	
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Организация,Контрагент,Партнер,Договор,Дата,Валюта,ПолнаяСтоимостьВсего,НаложенныйПлатежВсего");
	Дата = Данные.Дата;
	Валюта = Данные.Валюта;
	
	КлючАналитики = ПолучитьКлючАналитикиУчетаПоПартнерам(Данные);
	
	Если Данные.ПолнаяСтоимостьВсего > 0 ИЛИ Данные.НаложенныйПлатежВсего > 0 Тогда
		// Полная стоимость услуг и наложенного платежа
		Движение = Движения.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.АналитикаУчетаПоПартнерам = КлючАналитики;
		Движение.СводЗаявок = Ссылка;
		Движение.КоррСводЗаявок = Ссылка;
		Движение.Валюта = Валюта;
		Движение.СуммаУслуг = Данные.ПолнаяСтоимостьВсего;
		Движение.СуммаНаложенногоПлатежа = Данные.НаложенныйПлатежВсего;
		Движение.СуммаКОплате = 0;
	КонецЕсли;
	
	СуммаУслугОстаток = Данные.ПолнаяСтоимостьВсего;
	СуммаНаложенногоПлатежаОстаток = Данные.НаложенныйПлатежВсего;
	
	// Зачет	
	СуммаЗачета = Мин(СуммаУслугОстаток, СуммаНаложенногоПлатежаОстаток);
	
	Если СуммаЗачета > 0 Тогда
		
		Движение = Движения.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.АналитикаУчетаПоПартнерам = КлючАналитики;
		Движение.СводЗаявок = Ссылка;
		Движение.КоррСводЗаявок = Ссылка;
		Движение.Валюта = Валюта;
		Движение.СуммаУслуг = СуммаЗачета;
		Движение.СуммаНаложенногоПлатежа = 0;
		Движение.СуммаКОплате = 0;
		
		Движение = Движения.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.АналитикаУчетаПоПартнерам = КлючАналитики;
		Движение.СводЗаявок = Ссылка;
		Движение.КоррСводЗаявок = Ссылка;
		Движение.Валюта = Валюта;
		Движение.СуммаУслуг = 0;
		Движение.СуммаНаложенногоПлатежа = СуммаЗачета;
		Движение.СуммаКОплате = 0;
		
		СуммаНаложенногоПлатежаОстаток = СуммаНаложенногоПлатежаОстаток - СуммаЗачета;
		СуммаУслугОстаток = СуммаУслугОстаток - СуммаЗачета;
	КонецЕсли;
	
	/////ЗДЕСЬ НУЖЕН Контроль АВАНСА
	Если СуммаУслугОстаток > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		               |	Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок КАК СводЗаявок,
		               |	Логс_ВзаиморасчетыЗаВычетомОстатки.Валюта КАК Валюта,
		               |	Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаУслугОстаток КАК СуммаУслуг
		               |ИЗ
		               |	РегистрНакопления.Логс_ВзаиморасчетыЗаВычетом.Остатки(&Период, АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам и СводЗаявок = Значение(Документ.Логс_СводЗаявокНаДоставку.ПустаяСсылка)) КАК Логс_ВзаиморасчетыЗаВычетомОстатки
		               |Где Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаУслугОстаток<0";
		Запрос.УстановитьПараметр("Период", Новый Граница(Данные.Дата, ВидГраницы.Включая));
		Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", КлючАналитики);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			тСуммаСписания = Мин(СуммаУслугОстаток, -Выборка.СуммаУслуг); 
			//списываем сумму услуг этого свода
			Движение = Движения.Добавить();
			Движение.АналитикаУчетаПоПартнерам = КлючАналитики;
			Движение.Валюта = Валюта;
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.СводЗаявок = Ссылка;
			Движение.СуммаУслуг = тСуммаСписания;
			
			//списываем НП с аванса
			Движение = Движения.Добавить();
			Движение.АналитикаУчетаПоПартнерам = КлючАналитики;
			Движение.Валюта = Валюта;
			Движение.Период = Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.КоррСводЗаявок = Ссылка;
			Движение.СуммаУслуг = -тСуммаСписания;
			
			СуммаУслугОстаток = СуммаУслугОстаток - тСуммаСписания;
		КонецЕсли;
	КонецЕсли;
	////ДА
	
	
	//Если Дата >= Дата('20200728') Тогда
		
		Если СуммаУслугОстаток > 0 Тогда
			//Распределяем услуги в невыплаченный НП
			Показатель = "СуммаНаложенногоПлатежа";
			//Распределение = Логс_ДополнительныеПроцедурыИФункции.РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Ссылка.МоментВремени(), Показатель, СуммаУслугОстаток);
			
			Распределение = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Новый Граница(Данные.Дата, ВидГраницы.Включая), Показатель, СуммаУслугОстаток);
			//Распределение = Логс_ДополнительныеПроцедурыИФункции.РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Новый Граница(Данные.Дата, ВидГраницы.Включая), Показатель, СуммаУслугОстаток);
			Для Каждого Строка из Распределение.Распределение Цикл
				//списываем сумму услуг этого свода
				Движение = Движения.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
				Движение.Период = Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.СводЗаявок = Ссылка;
				Движение.КоррСводЗаявок = Строка.СводЗаявок;
				Движение.СуммаУслуг = Строка[Показатель];
				Движение.СуммаНаложенногоПлатежа = 0;
				
				//списываем НП с "богатого" свода
				Движение = Движения.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
				Движение.Период = Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.СводЗаявок = Строка.СводЗаявок;
				Движение.КоррСводЗаявок = Ссылка;
				Движение.СуммаУслуг = 0;
				Движение.СуммаНаложенногоПлатежа = Строка[Показатель];
			КонецЦикла;
			
		ИначеЕсли СуммаНаложенногоПлатежаОстаток > 0 Тогда
			//Распределяем долги по услугам
			Показатель = "СуммаУслуг";
			Распределение = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Ссылка.МоментВремени(), Показатель, СуммаНаложенногоПлатежаОстаток);
			//Распределение = Логс_ДополнительныеПроцедурыИФункции.РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Ссылка.МоментВремени(), Показатель, СуммаНаложенногоПлатежаОстаток);
			Для Каждого Строка из Распределение.Распределение Цикл
				//списываем непогашенные услуги другого свода
				Движение = Движения.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
				Движение.Период = Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.СводЗаявок = Строка.СводЗаявок;
				Движение.КоррСводЗаявок = Ссылка;
				Движение.СуммаУслуг = Строка[Показатель];
				Движение.СуммаНаложенногоПлатежа = 0;
				
				//списываем НП текущего свода
				Движение = Движения.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
				Движение.Период = Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.СводЗаявок = Ссылка;
				Движение.КоррСводЗаявок = Строка.СводЗаявок;
				Движение.СуммаУслуг = 0;
				Движение.СуммаНаложенногоПлатежа = Строка[Показатель];
			КонецЦикла;
			
		КонецЕсли;
		
	//КонецЕсли;
	
КонецПроцедуры
Процедура ДвиженияЗаВычетомПоступлениеБезналичныхДС(Ссылка, Договор, Движения)
	
	Показатель = "СуммаУслуг";
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "СуммаДокумента, Дата, ХозяйственнаяОперация");
	ГраницаКонецДня = Новый Граница(КонецДня(Данные.Дата), ВидГраницы.Включая);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ПоступлениеДС.Сумма) КАК Сумма
	               |ИЗ
	               |	Документ.ПоступлениеБезналичныхДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК ПоступлениеДС
	               |ГДЕ
	               |	ПоступлениеДС.Ссылка = &Ссылка
	               |	И ПоступлениеДС.СводЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.Оплата100)";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() и ЗначениеЗаполнено(Выборка.Сумма) Тогда
		Данные.СуммаДокумента = Данные.СуммаДокумента - Выборка.Сумма;
		Если Данные.СуммаДокумента < 0 Тогда
			Данные.СуммаДокумента = 0;
		КонецЕсли;
	КонецЕсли;
	
	Если Данные.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента Тогда
		//распределяем ТЧ
		Распределение = РаспределитьОстаткиВзаиморасчетовЗаВычетом(Неопределено, ГраницаКонецДня, Показатель, Данные.СуммаДокумента, Ссылка);
		//Распределение = Логс_ДополнительныеПроцедурыИФункции.РаспределитьОстаткиВзаиморасчетовЗаВычетом(Неопределено, ГраницаКонецДня, Показатель, Данные.СуммаДокумента, Ссылка);
		
		
		//при поступлении оплаты, списываем сумму, при возврате начисляем  - это кейс про необработанный банком платеж
		ВидДвижения = ВидДвиженияНакопления.Расход;  //по умолчанию
		Показатель = "СуммаУслуг";
		ВидДвижения = ВидДвиженияНакопления.Расход;
		//ИначеЕсли Данные.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика Тогда
		//	Показатель = "СуммаКОплате";
		//	ВидДвижения = ВидДвиженияНакопления.Приход;
		//КонецЕсли;	
	
	
		Если Распределение.Распределение.Количество() > 0 Тогда
		
			
			Для Каждого Строка из Распределение.Распределение Цикл
				Движение = Движения.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
				Движение.Период = Данные.Дата;
				Движение.ВидДвижения = ВидДвижения;
				Движение.СводЗаявок = Строка.СводЗаявок;
				Движение.КоррСводЗаявок = Строка.СводЗаявок;
				Движение[Показатель] = Строка[Показатель];
			КонецЦикла;
			Движения.Записать();
			
		КонецЕсли;
	
		Если Распределение.Остаток>0 и Данные.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента Тогда
			
			// Найдем ключ аналитики, он понадобится чтобы правильно сделать движения
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	АналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам,
			               |	ПоступлениеДС.Партнер КАК Партнер,
			               |	ПоступлениеДС.ОснованиеПлатежа КАК ОснованиеПлатежа,
			               |	ПоступлениеДС.Ссылка.Организация КАК Организация,
			               |	ПоступлениеДС.Ссылка.Контрагент КАК Контрагент,
			               |	ПоступлениеДС.Ссылка.НаправлениеДеятельности КАК НаправлениеДеятельности
			               |ИЗ
			               |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеДС
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
			               |		ПО ПоступлениеДС.Ссылка.Организация = АналитикаУчетаПоПартнерам.Организация
			               |			И ПоступлениеДС.Ссылка.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
			               |			И ПоступлениеДС.Партнер = АналитикаУчетаПоПартнерам.Партнер
			               |			И ПоступлениеДС.ОснованиеПлатежа = АналитикаУчетаПоПартнерам.Договор
			               |			И ПоступлениеДС.Ссылка.НаправлениеДеятельности = АналитикаУчетаПоПартнерам.НаправлениеДеятельности
			               |ГДЕ
			               |	ПоступлениеДС.Ссылка = &Ссылка
			               |	И ПоступлениеДС.ОснованиеПлатежа ССЫЛКА Справочник.ДоговорыКонтрагентов";
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если НЕ Выборка.Следующий() или НЕ ЗначениеЗаполнено(Выборка.АналитикаУчетаПоПартнерам) Тогда
				Возврат;  // не нашли ключ аналитики
			КонецЕсли;
			КлючАналитики = Выборка.АналитикаУчетаПоПартнерам;
			
			Показатель = "СуммаКОплате";
			//распределяем остаток сначала в ошибки оплат, потом в ошибки НП, и только потом приход пустого свода в сумму услуг
			//РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Новый Граница( данные.дата, ВидГраницы.Включая), Показатель, -Распределение.Остаток);
			РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, ГраницаКонецДня, Показатель, -Распределение.Остаток);
			
			Если РаспределениеСвободное.Распределение.Количество() > 0 Тогда
			
				Для Каждого Строка из РаспределениеСвободное.Распределение Цикл
					Движение = Движения.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
					Движение.Период = Данные.Дата;
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход; //сумма с минусом = сторно
					Движение.СводЗаявок = Строка.СводЗаявок;
					Движение.КоррСводЗаявок = Строка.СводЗаявок;
					Движение[Показатель] = Строка[Показатель];
				КонецЦикла;
			КонецЕсли;
			Движения.Записать();
			
			Показатель = "СуммаУслуг";
			//РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Новый Граница( данные.дата, ВидГраницы.Включая), Показатель, -РаспределениеСвободное.Остаток);
			РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, ГраницаКонецДня, Показатель, -РаспределениеСвободное.Остаток);
			
			Если РаспределениеСвободное.Распределение.Количество() > 0 Тогда
			
				Для Каждого Строка из РаспределениеСвободное.Распределение Цикл
					Движение = Движения.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
					Движение.Период = Данные.Дата;
					Движение.ВидДвижения = ВидДвиженияНакопления.Расход; //сумма с минусом = сторно
					Движение.СводЗаявок = Строка.СводЗаявок;
					Движение.КоррСводЗаявок = Строка.СводЗаявок;
					Движение[Показатель] = Строка[Показатель];
				КонецЦикла;
			КонецЕсли;
			
			Показатель = "СуммаНаложенногоПлатежа";
			//РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Новый Граница( данные.дата, ВидГраницы.Включая), Показатель, РаспределениеСвободное.Остаток);
			РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, ГраницаКонецДня, Показатель, РаспределениеСвободное.Остаток);
			
			Если РаспределениеСвободное.Распределение.Количество() > 0 Тогда
			
				Для Каждого Строка из РаспределениеСвободное.Распределение Цикл
					Движение = Движения.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
					Движение.Период = Данные.Дата;
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход; //сумма с минусом = сторно
					Движение.СводЗаявок = Строка.СводЗаявок;
					Движение.КоррСводЗаявок = Строка.СводЗаявок;
					Движение[Показатель] = Строка[Показатель];
				КонецЦикла;
			КонецЕсли;
			Если РаспределениеСвободное.Остаток <>0 Тогда
				
					Движение = Движения.Добавить();
					Движение.АналитикаУчетаПоПартнерам = КлючАналитики;
					Движение.Валюта = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();//Константы.ВалютаРегламентированногоУчета.Получить();
					Движение.Период = Данные.Дата;
					Движение.ВидДвижения = ВидДвиженияНакопления.Приход;//Расход;
					Движение.СводЗаявок = Неопределено;
					Движение.КоррСводЗаявок = Неопределено;
					Движение[Показатель] = РаспределениеСвободное.Остаток;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли Данные.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
			               |	АналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам,
			               |	ПоступлениеДС.Партнер КАК Партнер,
			               |	ПоступлениеДС.ОснованиеПлатежа КАК ОснованиеПлатежа,
			               |	ПоступлениеДС.Ссылка.Организация КАК Организация,
			               |	ПоступлениеДС.Ссылка.Контрагент КАК Контрагент,
			               |	ПоступлениеДС.Ссылка.НаправлениеДеятельности КАК НаправлениеДеятельности
			               |ИЗ
			               |	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ПоступлениеДС
			               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
			               |		ПО ПоступлениеДС.Ссылка.Организация = АналитикаУчетаПоПартнерам.Организация
			               |			И ПоступлениеДС.Ссылка.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
			               |			И ПоступлениеДС.Партнер = АналитикаУчетаПоПартнерам.Партнер
			               |			И ПоступлениеДС.ОснованиеПлатежа = АналитикаУчетаПоПартнерам.Договор
			               |			И ПоступлениеДС.Ссылка.НаправлениеДеятельности = АналитикаУчетаПоПартнерам.НаправлениеДеятельности
			               |ГДЕ
			               |	ПоступлениеДС.Ссылка = &Ссылка
			               |	И ПоступлениеДС.ОснованиеПлатежа ССЫЛКА Справочник.ДоговорыКонтрагентов";
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если НЕ Выборка.Следующий() или НЕ ЗначениеЗаполнено(Выборка.АналитикаУчетаПоПартнерам) Тогда
				Возврат;  // не нашли ключ аналитики
			КонецЕсли;
			КлючАналитики = Выборка.АналитикаУчетаПоПартнерам;
			
			Движение = Движения.Добавить();
			Движение.АналитикаУчетаПоПартнерам = КлючАналитики;
			Движение.Валюта = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
			Движение.Период = Данные.Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.СводЗаявок = Неопределено;
			Движение.КоррСводЗаявок = Неопределено;
			Движение.СуммаКОплате = -Данные.СуммаДокумента;     //сторнируем
	
	КонецЕсли;
		
КонецПроцедуры
Процедура ДвиженияЗаВычетомПКО(Ссылка, Договор, Движения)
	
	
	Показатель = "СуммаУслуг";
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "СуммаДокумента, Дата, ХозяйственнаяОперация");
	ГраницаКонецДня = Новый Граница(КонецДня(Данные.Дата), ВидГраницы.Включая);
	
	//распределяем ТЧ
	Распределение = РаспределитьОстаткиВзаиморасчетовЗаВычетом(Неопределено, ГраницаКонецДня, Показатель, Данные.СуммаДокумента, Ссылка);
	//Распределение = Логс_ДополнительныеПроцедурыИФункции.РаспределитьОстаткиВзаиморасчетовЗаВычетом(Неопределено, ГраницаКонецДня, Показатель, Данные.СуммаДокумента, Ссылка);
	
	Если Распределение.Распределение.Количество() > 0 Тогда
	
		
		Для Каждого Строка из Распределение.Распределение Цикл
			Движение = Движения.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
			Движение.Период = Данные.Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.СводЗаявок = Строка.СводЗаявок;
			Движение.КоррСводЗаявок = Строка.СводЗаявок;
			Движение.СуммаУслуг = Строка[Показатель];
			
		КонецЦикла;
	КонецЕсли;
	
	Если Распределение.Остаток>0 и Данные.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента Тогда
		
		// Найдем ключ аналитики, он понадобится чтобы правильно сделать движения
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	АналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам,
		               |	ПоступлениеДС.Партнер КАК Партнер,
		               |	ПоступлениеДС.ОснованиеПлатежа КАК ОснованиеПлатежа,
		               |	ПоступлениеДС.Ссылка.Организация КАК Организация,
		               |	ПоступлениеДС.Ссылка.Контрагент КАК Контрагент,
		               |	ПоступлениеДС.Ссылка.НаправлениеДеятельности КАК НаправлениеДеятельности
		               |ИЗ
		               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПоступлениеДС
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		               |		ПО ПоступлениеДС.Ссылка.Организация = АналитикаУчетаПоПартнерам.Организация
		               |			И ПоступлениеДС.Ссылка.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
		               |			И ПоступлениеДС.Партнер = АналитикаУчетаПоПартнерам.Партнер
		               |			И ПоступлениеДС.ОснованиеПлатежа = АналитикаУчетаПоПартнерам.Договор
		               |			И ПоступлениеДС.Ссылка.НаправлениеДеятельности = АналитикаУчетаПоПартнерам.НаправлениеДеятельности
		               |ГДЕ
		               |	ПоступлениеДС.Ссылка = &Ссылка
		               |	И ПоступлениеДС.ОснованиеПлатежа ССЫЛКА Справочник.ДоговорыКонтрагентов";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если НЕ Выборка.Следующий() или НЕ ЗначениеЗаполнено(Выборка.АналитикаУчетаПоПартнерам) Тогда
			Возврат;  // не нашли ключ аналитики
		КонецЕсли;
		КлючАналитики = Выборка.АналитикаУчетаПоПартнерам;
		
		//распределяем ТЧ
		РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Ссылка.МоментВремени(), Показатель, Данные.СуммаДокумента);
		//РаспределениеСвободное = Логс_ДополнительныеПроцедурыИФункции.РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Ссылка.МоментВремени(), Показатель, Данные.СуммаДокумента);
		
		Если РаспределениеСвободное.Распределение.Количество() > 0 Тогда
		
			Для Каждого Строка из РаспределениеСвободное.Распределение Цикл
				Движение = Движения.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
				Движение.Период = Данные.Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.СводЗаявок = Строка.СводЗаявок;
				Движение.КоррСводЗаявок = Строка.СводЗаявок;
				Движение.СуммаУслуг = Строка[Показатель];
				
			КонецЦикла;
		КонецЕсли;
		
		Если РаспределениеСвободное.Остаток >0 Тогда
			
				Движение = Движения.Добавить();
				Движение.АналитикаУчетаПоПартнерам = КлючАналитики;
				Движение.Валюта = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();//Константы.ВалютаРегламентированногоУчета.Получить();
				Движение.Период = Данные.Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.СводЗаявок = Неопределено;
				Движение.КоррСводЗаявок = Неопределено;
				Движение.СуммаУслуг = РаспределениеСвободное.Остаток;
			
		КонецЕсли;
	
	ИначеЕсли Данные.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	АналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам,
		               |	ПоступлениеДС.Партнер КАК Партнер,
		               |	ПоступлениеДС.ОснованиеПлатежа КАК ОснованиеПлатежа,
		               |	ПоступлениеДС.Ссылка.Организация КАК Организация,
		               |	ПоступлениеДС.Ссылка.Контрагент КАК Контрагент,
		               |	ПоступлениеДС.Ссылка.НаправлениеДеятельности КАК НаправлениеДеятельности
		               |ИЗ
		               |	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ПоступлениеДС
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		               |		ПО ПоступлениеДС.Ссылка.Организация = АналитикаУчетаПоПартнерам.Организация
		               |			И ПоступлениеДС.Ссылка.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
		               |			И ПоступлениеДС.Партнер = АналитикаУчетаПоПартнерам.Партнер
		               |			И ПоступлениеДС.ОснованиеПлатежа = АналитикаУчетаПоПартнерам.Договор
		               |			И ПоступлениеДС.Ссылка.НаправлениеДеятельности = АналитикаУчетаПоПартнерам.НаправлениеДеятельности
		               |ГДЕ
		               |	ПоступлениеДС.Ссылка = &Ссылка
		               |	И ПоступлениеДС.ОснованиеПлатежа ССЫЛКА Справочник.ДоговорыКонтрагентов";
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			Выборка = Запрос.Выполнить().Выбрать();
			Если НЕ Выборка.Следующий() или НЕ ЗначениеЗаполнено(Выборка.АналитикаУчетаПоПартнерам) Тогда
				Возврат;  // не нашли ключ аналитики
			КонецЕсли;
			КлючАналитики = Выборка.АналитикаУчетаПоПартнерам;
			
			Движение = Движения.Добавить();
			Движение.АналитикаУчетаПоПартнерам = КлючАналитики;
			Движение.Валюта = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
			Движение.Период = Данные.Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.СводЗаявок = Неопределено;
			Движение.КоррСводЗаявок = Неопределено;
			//Движение.СуммаКОплате = -Данные.СуммаДокумента;     //сторнируем
			Движение.СуммаУслуг = -Данные.СуммаДокумента;     //сторнируем
	
	КонецЕсли;
		
КонецПроцедуры
Процедура ДвиженияЗаВычетомСписаниеБезналичныхДС(Ссылка, Договор, Движения)
	
	Показатель = "СуммаКОплате";
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "СуммаДокумента, Дата");
	ГраницаКонецДня = Новый Граница(КонецДня(Данные.Дата), ВидГраницы.Включая);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(СписаниеБезналичныхДенежныхСредств.Сумма) КАК Сумма
	               |ИЗ
	               |	Документ.СписаниеБезналичныхДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК СписаниеБезналичныхДенежныхСредств
	               |ГДЕ
	               |	СписаниеБезналичныхДенежныхСредств.Ссылка = &Ссылка
	               |	И СписаниеБезналичныхДенежныхСредств.СводЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.Оплата100)";
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() И ЗначениеЗаполнено(Выборка.Сумма) Тогда
		Данные.СуммаДокумента = Данные.СуммаДокумента - Выборка.Сумма;
		Если Данные.СуммаДокумента < 0 Тогда
			Данные.СуммаДокумента = 0;
		КонецЕсли;
	КонецЕсли;
	
	Распределение = РаспределитьОстаткиВзаиморасчетовЗаВычетом(Неопределено, ГраницаКонецДня, Показатель, Данные.СуммаДокумента, Ссылка);

	
	Для Каждого Строка из Распределение.Распределение Цикл
		Движение = Движения.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
		Движение.Период = Данные.Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.СводЗаявок = Строка.СводЗаявок;
		Движение.КоррСводЗаявок = Строка.СводЗаявок;
		Движение[Показатель] = Строка[Показатель];
		
	КонецЦикла;
	
	Движения.Записать();
	
	Если Распределение.Остаток<>0 Тогда
		
		// Найдем ключ аналитики, он понадобится чтобы правильно сделать движения
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	АналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам,
		               |	СписаниеБезналичныхДенежныхСредств.Партнер КАК Партнер,
		               |	СписаниеБезналичныхДенежныхСредств.ОбъектРасчетов.Договор КАК ОснованиеПлатежа,
		               |	СписаниеБезналичныхДенежныхСредств.Ссылка.Организация КАК Организация,
		               |	СписаниеБезналичныхДенежныхСредств.Ссылка.Контрагент КАК Контрагент,
		               |	СписаниеБезналичныхДенежныхСредств.НаправлениеДеятельности КАК НаправлениеДеятельности
		               |ИЗ
		               |	Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК СписаниеБезналичныхДенежныхСредств
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		               |		ПО СписаниеБезналичныхДенежныхСредств.Ссылка.Организация = АналитикаУчетаПоПартнерам.Организация
		               |			И СписаниеБезналичныхДенежныхСредств.Ссылка.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
		               |			И СписаниеБезналичныхДенежныхСредств.Партнер = АналитикаУчетаПоПартнерам.Партнер
		               |			И СписаниеБезналичныхДенежныхСредств.ОбъектРасчетов.Договор = АналитикаУчетаПоПартнерам.Договор
		               |			И СписаниеБезналичныхДенежныхСредств.НаправлениеДеятельности = АналитикаУчетаПоПартнерам.НаправлениеДеятельности
		               |ГДЕ
		               |	СписаниеБезналичныхДенежныхСредств.Ссылка = &Ссылка
		               |	И СписаниеБезналичныхДенежныхСредств.ОбъектРасчетов.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если НЕ Выборка.Следующий() или НЕ ЗначениеЗаполнено(Выборка.АналитикаУчетаПоПартнерам) Тогда
			Возврат;  // не нашли ключ аналитики
		КонецЕсли;
		КлючАналитики = Выборка.АналитикаУчетаПоПартнерам;
		
			Показатель = "СуммаКОплате";
			ВидДвижения = ВидДвиженияНакопления.Расход;
			
			//закрываем возможные ошибки
			
			//РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Новый Граница( данные.дата, ВидГраницы.Включая), Показатель, Распределение.Остаток);
			РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, ГраницаКонецДня, Показатель, Распределение.Остаток);
			
			Если РаспределениеСвободное.Распределение.Количество() > 0 Тогда
			
				Для Каждого Строка из РаспределениеСвободное.Распределение Цикл
					Движение = Движения.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
					Движение.Период = Данные.Дата;
					Движение.ВидДвижения = ВидДвижения;
					Движение.СводЗаявок = Строка.СводЗаявок;
					Движение.КоррСводЗаявок = Строка.СводЗаявок;
					Движение[Показатель] = Строка[Показатель];
					
				КонецЦикла;
			КонецЕсли;
	
			
			Показатель = "СуммаНаложенногоПлатежа";
			ВидДвижения = ВидДвиженияНакопления.Расход;
			
			//закрываем возможные ошибки
			
			//РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Новый Граница( данные.дата, ВидГраницы.Включая), Показатель, РаспределениеСвободное.Остаток);
			РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, ГраницаКонецДня, Показатель, РаспределениеСвободное.Остаток);
			
			Если РаспределениеСвободное.Распределение.Количество() > 0 Тогда
			
				Для Каждого Строка из РаспределениеСвободное.Распределение Цикл
					Движение = Движения.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
					Движение.Период = Данные.Дата;
					Движение.ВидДвижения = ВидДвижения;
					Движение.СводЗаявок = Строка.СводЗаявок;
					Движение.КоррСводЗаявок = Строка.СводЗаявок;
					Движение[Показатель] = Строка[Показатель];
					
				КонецЦикла;
			КонецЕсли;
	
	
		Если РаспределениеСвободное.Остаток<>0 Тогда
			Движение = Движения.Добавить();
			Движение.АналитикаУчетаПоПартнерам = КлючАналитики;
			Движение.Валюта = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
			Движение.Период = Данные.Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.СводЗаявок = Неопределено;
			Движение.КоррСводЗаявок = Неопределено;
			Движение.СуммаУслуг = РаспределениеСвободное.Остаток;
			//Движение = Движения.Добавить();
			//ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
			//Движение.Период = Данные.Дата;
			//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			//Движение.СводЗаявок = Неопределено;
			//Движение.КоррСводЗаявок = Неопределено;
			//Движение.СуммаКОплате = Распределение.Остаток;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
Процедура ДвиженияЗаВычетомРКО(Ссылка, Договор, Движения)
	
	Показатель = "СуммаКОплате";
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Дата");
	Данные.Вставить("СуммаДокумента", 0);
	ГраницаКонецДня = Новый Граница(КонецДня(Данные.Дата), ВидГраницы.Включая);
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(РасходныйКассовыйОрдер.Сумма) КАК Сумма
	               |ИЗ
	               |	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдер
	               |ГДЕ
	               |	РасходныйКассовыйОрдер.Ссылка = &Ссылка
	               |	И РасходныйКассовыйОрдер.ОбъектРасчетов.Договор = &Договор
	               |Объединить ВСЕ
	               |Выбрать
	               |	СУММА(-РасходныйКассовыйОрдер.Сумма) КАК Сумма
	               |ИЗ
	               |	Документ.РасходныйКассовыйОрдер.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК РасходныйКассовыйОрдер
	               |ГДЕ
	               |	РасходныйКассовыйОрдер.Ссылка = &Ссылка
	               |	И РасходныйКассовыйОрдер.СводЗаявок.Договор = &Договор
	               |	И РасходныйКассовыйОрдер.СводЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.Оплата100)";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Сумма) Тогда
			Данные.СуммаДокумента = Данные.СуммаДокумента + Выборка.Сумма;
		КонецЕсли;
	КонецЦикла;
	Если Данные.СуммаДокумента < 0 Тогда
		Данные.СуммаДокумента = 0;
	КонецЕсли;
	
	Распределение = РаспределитьОстаткиВзаиморасчетовЗаВычетом(Неопределено, ГраницаКонецДня, Показатель, Данные.СуммаДокумента, Ссылка, Договор);

	
	Для Каждого Строка из Распределение.Распределение Цикл
		Движение = Движения.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
		Движение.Период = Данные.Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.СводЗаявок = Строка.СводЗаявок;
		Движение.КоррСводЗаявок = Строка.СводЗаявок;
		Движение[Показатель] = Строка[Показатель];
		
	КонецЦикла;
	
	Движения.Записать();
	
	Если Распределение.Остаток<>0 Тогда
		
		// Найдем ключ аналитики, он понадобится чтобы правильно сделать движения
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	АналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам,
		               |	РасходныйКассовыйОрдер.Партнер КАК Партнер,
		               |	РасходныйКассовыйОрдер.ОбъектРасчетов.Договор КАК ОснованиеПлатежа,
		               |	РасходныйКассовыйОрдер.Ссылка.Организация КАК Организация,
		               |	РасходныйКассовыйОрдер.Ссылка.Контрагент КАК Контрагент,
		               |	РасходныйКассовыйОрдер.НаправлениеДеятельности КАК НаправлениеДеятельности
		               |ИЗ
		               |	Документ.РасходныйКассовыйОрдер.РасшифровкаПлатежа КАК РасходныйКассовыйОрдер
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		               |		ПО РасходныйКассовыйОрдер.Ссылка.Организация = АналитикаУчетаПоПартнерам.Организация
		               |			И РасходныйКассовыйОрдер.Ссылка.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
		               |			И РасходныйКассовыйОрдер.Партнер = АналитикаУчетаПоПартнерам.Партнер
		               |			И РасходныйКассовыйОрдер.ОбъектРасчетов.Договор = АналитикаУчетаПоПартнерам.Договор
					   |			И РасходныйКассовыйОрдер.НаправлениеДеятельности = АналитикаУчетаПоПартнерам.НаправлениеДеятельности
					   |ГДЕ
					   |	РасходныйКассовыйОрдер.Ссылка = &Ссылка
					   |	И РасходныйКассовыйОрдер.ОбъектРасчетов.Договор = &Договор
					   |	И РасходныйКассовыйОрдер.ОбъектРасчетов.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Запрос.УстановитьПараметр("Договор", Договор);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если НЕ Выборка.Следующий() или НЕ ЗначениеЗаполнено(Выборка.АналитикаУчетаПоПартнерам) Тогда
			Возврат;  // не нашли ключ аналитики
		КонецЕсли;
		КлючАналитики = Выборка.АналитикаУчетаПоПартнерам;
		
			Показатель = "СуммаКОплате";
			ВидДвижения = ВидДвиженияНакопления.Расход;
			
			//закрываем возможные ошибки
			
			//РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Новый Граница( данные.дата, ВидГраницы.Включая), Показатель, Распределение.Остаток);
			РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, ГраницаКонецДня, Показатель, Распределение.Остаток);
			
			Если РаспределениеСвободное.Распределение.Количество() > 0 Тогда
			
				Для Каждого Строка из РаспределениеСвободное.Распределение Цикл
					Движение = Движения.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
					Движение.Период = Данные.Дата;
					Движение.ВидДвижения = ВидДвижения;
					Движение.СводЗаявок = Строка.СводЗаявок;
					Движение.КоррСводЗаявок = Строка.СводЗаявок;
					Движение[Показатель] = Строка[Показатель];
					
				КонецЦикла;
			КонецЕсли;
	
			
			Показатель = "СуммаНаложенногоПлатежа";
			ВидДвижения = ВидДвиженияНакопления.Расход;
			
			//закрываем возможные ошибки
			
			//РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Новый Граница( данные.дата, ВидГраницы.Включая), Показатель, РаспределениеСвободное.Остаток);
			РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, ГраницаКонецДня, Показатель, РаспределениеСвободное.Остаток);
			
			Если РаспределениеСвободное.Распределение.Количество() > 0 Тогда
			
				Для Каждого Строка из РаспределениеСвободное.Распределение Цикл
					Движение = Движения.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
					Движение.Период = Данные.Дата;
					Движение.ВидДвижения = ВидДвижения;
					Движение.СводЗаявок = Строка.СводЗаявок;
					Движение.КоррСводЗаявок = Строка.СводЗаявок;
					Движение[Показатель] = Строка[Показатель];
					
				КонецЦикла;
			КонецЕсли;
	
	
		Если РаспределениеСвободное.Остаток<>0 Тогда
			Движение = Движения.Добавить();
			Движение.АналитикаУчетаПоПартнерам = КлючАналитики;
			Движение.Валюта = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
			Движение.Период = Данные.Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.СводЗаявок = Неопределено;
			Движение.КоррСводЗаявок = Неопределено;
			Движение.СуммаУслуг = РаспределениеСвободное.Остаток;
			//Движение = Движения.Добавить();
			//ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
			//Движение.Период = Данные.Дата;
			//Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			//Движение.СводЗаявок = Неопределено;
			//Движение.КоррСводЗаявок = Неопределено;
			//Движение.СуммаКОплате = Распределение.Остаток;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДвиженияЗаВычетомЗаявкаНаРасходованиеДенежныхСредств(Ссылка, Договор, Движения)
	Показатель = "СуммаНаложенногоПлатежа";
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "СуммаДокумента, Дата");
	ГраницаКонецДня = Новый Граница(КонецДня(Данные.Дата), ВидГраницы.Включая);
	Распределение = РаспределитьОстаткиВзаиморасчетовЗаВычетом(Неопределено, ГраницаКонецДня, Показатель, Данные.СуммаДокумента, Ссылка);
	//Распределение = Логс_ДополнительныеПроцедурыИФункции.РаспределитьОстаткиВзаиморасчетовЗаВычетом(Неопределено, ГраницаКонецДня, Показатель, Данные.СуммаДокумента, Ссылка);
	
	Если Распределение.Распределение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка из Распределение.Распределение Цикл
		Если Строка[Показатель]>0 Тогда
			Движение = Движения.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
			Движение.Период = Данные.Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.СводЗаявок = Строка.СводЗаявок;
			Движение.КоррСводЗаявок = Строка.СводЗаявок;
			Движение.СуммаНаложенногоПлатежа = Строка[Показатель];
			
			Движение = Движения.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
			Движение.Период = Данные.Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.СводЗаявок = Строка.СводЗаявок;
			Движение.КоррСводЗаявок = Строка.СводЗаявок;
			Движение.СуммаКОплате = Строка[Показатель];
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры

Процедура ДвиженияЗаВычетомЗаявкаНаРасходованиеДенежныхСредств_хм(Ссылка, Договор, Движения)
	Показатель = "СуммаНаложенногоПлатежа";
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "СуммаДокумента, Дата");
	ГраницаКонецДня = Новый Граница(КонецДня(Данные.Дата), ВидГраницы.Включая);
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Распределение.СводЗаявок КАК СводЗаявок,
	               |	Распределение.Ссылка.НаправлениеДеятельности КАК НаправлениеДеятельности,
	               |	Распределение.Ссылка.Валюта КАК Валюта,
	               |	Распределение.Сумма КАК Сумма
	               |Поместить ВТ_ДанныеДокумента
	               |	ИЗ
	               |		Документ.ЗаявкаНаРасходованиеДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК Распределение
	               |	ГДЕ
	               |		Распределение.Ссылка = &СсылкаНаДокумент
	               |		И Распределение.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате) ;
				   |ВЫБРАТЬ
	               |	РС_АналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	               |	ВТ_ДанныеДокумента.СводЗаявок КАК СводЗаявок,
	               |	ВТ_ДанныеДокумента.Валюта КАК Валюта,
	               |	ВТ_ДанныеДокумента.Сумма КАК Показатель
	               |ИЗ
	               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РС_АналитикаУчетаПоПартнерам
	               |		ПО ВТ_ДанныеДокумента.СводЗаявок.Организация = РС_АналитикаУчетаПоПартнерам.Организация
	               |			И ВТ_ДанныеДокумента.СводЗаявок.Контрагент = РС_АналитикаУчетаПоПартнерам.Контрагент
	               |			И ВТ_ДанныеДокумента.СводЗаявок.Партнер = РС_АналитикаУчетаПоПартнерам.Партнер
	               |			И ВТ_ДанныеДокумента.СводЗаявок.Договор = РС_АналитикаУчетаПоПартнерам.Договор
	               |			И ВТ_ДанныеДокумента.НаправлениеДеятельности = РС_АналитикаУчетаПоПартнерам.НаправлениеДеятельности
	               |ГДЕ
	               |	ВТ_ДанныеДокумента.СводЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_ДанныеДокумента.СводЗаявок.Дата,
	               |	Показатель";
	Запрос.УстановитьПараметр("СсылкаНаДокумент", Ссылка);
	
	Распределение = Запрос.Выполнить().Выгрузить();
	
	//Распределение = РаспределитьОстаткиВзаиморасчетовЗаВычетом(Неопределено, ГраницаКонецДня, Показатель, Данные.СуммаДокумента, Ссылка);
	
	Если Распределение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	СнижениеНП = 0;
	
	Для Каждого Строка из Распределение Цикл
		Движение = Движения.Добавить();
		ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
		Движение.Период = Данные.Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.СводЗаявок = Строка.СводЗаявок;
		Движение.КоррСводЗаявок = Строка.СводЗаявок;
		Движение.СуммаНаложенногоПлатежа = Строка["Показатель"];
			
		Если Строка["Показатель"]<0 Тогда
			СнижениеНП = СнижениеНП - Строка["Показатель"];
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого Строка из Распределение Цикл
		Если Строка["Показатель"]>0 Тогда
			ТекущееУнижение = Мин(СнижениеНП, Строка["Показатель"]); 
			СнижениеНП = СнижениеНП-ТекущееУнижение;
			
			Если Строка["Показатель"]>ТекущееУнижение Тогда
				Движение = Движения.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
				Движение.Период = Данные.Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.СводЗаявок = Строка.СводЗаявок;
				Движение.КоррСводЗаявок = Строка.СводЗаявок;
				Движение.СуммаКОплате = Строка["Показатель"]-ТекущееУнижение;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры
Процедура ДвиженияЗаВычетомЗаявкаНаРасходованиеДенежныхСредств_бэкап(Ссылка, Договор, Движения)
	Показатель = "СуммаНаложенногоПлатежа";
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "СуммаДокумента, Дата");
	ГраницаКонецДня = Новый Граница(КонецДня(Данные.Дата), ВидГраницы.Включая);
	Распределение = РаспределитьОстаткиВзаиморасчетовЗаВычетом(Неопределено, ГраницаКонецДня, Показатель, Данные.СуммаДокумента, Ссылка);
	//Распределение = Логс_ДополнительныеПроцедурыИФункции.РаспределитьОстаткиВзаиморасчетовЗаВычетом(Неопределено, ГраницаКонецДня, Показатель, Данные.СуммаДокумента, Ссылка);
	
	Если Распределение.Распределение.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого Строка из Распределение.Распределение Цикл
		Если Строка[Показатель]>0 Тогда
			Движение = Движения.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
			Движение.Период = Данные.Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.СводЗаявок = Строка.СводЗаявок;
			Движение.КоррСводЗаявок = Строка.СводЗаявок;
			Движение.СуммаНаложенногоПлатежа = Строка[Показатель];
			
			Движение = Движения.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
			Движение.Период = Данные.Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.СводЗаявок = Строка.СводЗаявок;
			Движение.КоррСводЗаявок = Строка.СводЗаявок;
			Движение.СуммаКОплате = Строка[Показатель];
		КонецЕсли;
	КонецЦикла;

	
КонецПроцедуры

Процедура ДвиженияЗаВычетомВзаимозачетЗадолженности(Ссылка, Договор, Движения)

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Взаимозачет.Свод КАК Свод,
	               |	Взаимозачет.Сумма КАК СуммаСвода,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	               |ПОМЕСТИТЬ ВТ_Своды
	               |ИЗ
	               |	Документ.ВзаимозачетЗадолженности.СводыДебет КАК Взаимозачет
	               |ГДЕ
	               |	Взаимозачет.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	Взаимозачет.Свод,
	               |	Взаимозачет.Сумма,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	               |ИЗ
	               |	Документ.ВзаимозачетЗадолженности.СводыКредит КАК Взаимозачет
	               |ГДЕ
	               |	Взаимозачет.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	               |	Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок КАК СводЗаявок,
	               |	Логс_ВзаиморасчетыЗаВычетомОстатки.Валюта КАК Валюта,
	               |	Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаУслугОстаток КАК СуммаУслугОстаток,
	               |	Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаНаложенногоПлатежаОстаток КАК СуммаНаложенногоПлатежаОстаток,
	               |	Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаКОплатеОстаток КАК СуммаКОплатеОстаток,
	               |	ВТ_Своды.ВидДвижения КАК ВидДвижения,
	               |	ВТ_Своды.СуммаСвода КАК СуммаСвода
	               |ИЗ
	               |	ВТ_Своды КАК ВТ_Своды
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Логс_ВзаиморасчетыЗаВычетом.Остатки(
	               |				&Период,
	               |				СводЗаявок В
	               |					(ВЫБРАТЬ
	               |						вт_своды.Свод
	               |					ИЗ
	               |						вт_своды КАК вт_своды)) КАК Логс_ВзаиморасчетыЗаВычетомОстатки
	               |		ПО ВТ_Своды.Свод = Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок";
	
	
	Показатель = "СуммаУслуг";
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "СуммаДокумента, Дата, Логс_ФормироватьДвиженияПоУпрУчету");
	ГраницаКонецДня = Новый Граница(КонецДня(Данные.Дата), ВидГраницы.Включая);
	
	Если НЕ Данные.Логс_ФормироватьДвиженияПоУпрУчету Тогда
		Возврат;
	КонецЕсли;
	
	ОстатокДТ = Ссылка.ДебиторскаяЗадолженность.Итог("СуммаВзаиморасчетов");
	ОстатокКТ = Ссылка.КредиторскаяЗадолженность.Итог("СуммаВзаиморасчетов");
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Период", ГраницаКонецДня);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.СводЗаявок) Тогда
		
			Движение = Движения.Добавить();
			ЗаполнитьЗначенияСвойств(Движение, Выборка, "АналитикаУчетаПоПартнерам, Валюта, ВидДвижения, СводЗаявок"); 
			Движение.Период = Данные.Дата;
			Движение.КоррСводЗаявок = Выборка.СводЗаявок;
			Если Выборка.ВидДвижения = ВидДвиженияНакопления.Приход тогда
				Движение.СуммаКОплате = -Мин(Выборка.СуммаСвода, Выборка.СуммаКОплатеОстаток);
				Движение.СуммаНаложенногоПлатежа = -Мин(Выборка.СуммаНаложенногоПлатежаОстаток, Выборка.СуммаСвода+Движение.СуммаКОплате);
				ОстатокКТ = ОстатокКТ - Движение.СуммаКОплате - Движение.СуммаНаложенногоПлатежа;
			Иначе
				Движение.СуммаУслуг = Мин(Выборка.СуммаСвода, Выборка.СуммаУслугОстаток);
				ОстатокДТ = ОстатокДТ - Движение.СуммаУслуг;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Движения.Записать();
	
	Если ОстатокДТ>0 Тогда
		// Найдем ключ аналитики, он понадобится чтобы правильно сделать движения
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	АналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам,
		               |	ДебиторскаяЗадолженность.Партнер КАК Партнер,
		               |	ДебиторскаяЗадолженность.ОбъектРасчетов.Договор КАК ОснованиеПлатежа,
		               |	ДебиторскаяЗадолженность.Ссылка.Организация КАК Организация,
		               |	ДебиторскаяЗадолженность.Ссылка.КонтрагентДебитор КАК Контрагент,
		               |	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности
		               |ИЗ
		               |	Документ.ВзаимозачетЗадолженности.ДебиторскаяЗадолженность КАК ДебиторскаяЗадолженность
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		               |		ПО ДебиторскаяЗадолженность.Ссылка.Организация = АналитикаУчетаПоПартнерам.Организация
		               |			И ДебиторскаяЗадолженность.Ссылка.КонтрагентДебитор = АналитикаУчетаПоПартнерам.Контрагент
		               |			И ДебиторскаяЗадолженность.Партнер = АналитикаУчетаПоПартнерам.Партнер
		               |			И ДебиторскаяЗадолженность.ОбъектРасчетов.Договор = АналитикаУчетаПоПартнерам.Договор
		               |			И ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) = АналитикаУчетаПоПартнерам.НаправлениеДеятельности
		               |ГДЕ
		               |	ДебиторскаяЗадолженность.Ссылка = &Ссылка
		               |	И ДебиторскаяЗадолженность.ОбъектРасчетов.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() и ЗначениеЗаполнено(Выборка.АналитикаУчетаПоПартнерам) Тогда
			КлючАналитики = Выборка.АналитикаУчетаПоПартнерам;
			
			Показатель = "СуммаУслуг";
			ВидДвижения = ВидДвиженияНакопления.Расход;
			
			//распределяем ТЧ
			//РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Новый Граница( данные.дата, ВидГраницы.Включая), Показатель, ОстатокДт);
			РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, ГраницаКонецДня, Показатель, ОстатокДт);
			
			
			Если РаспределениеСвободное.Распределение.Количество() > 0 Тогда
			
				Для Каждого Строка из РаспределениеСвободное.Распределение Цикл
					Движение = Движения.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
					Движение.Период = Данные.Дата;
					Движение.ВидДвижения = ВидДвижения;
					Движение.СводЗаявок = Строка.СводЗаявок;
					Движение.КоррСводЗаявок = Строка.СводЗаявок;
					Движение[Показатель] = Строка[Показатель];
					
				КонецЦикла;
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
	
	Если ОстатокКТ>0 Тогда
		
		// Найдем ключ аналитики, он понадобится чтобы правильно сделать движения
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	АналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам,
		               |	КредиторскаяЗадолженность.Партнер КАК Партнер,
		               |	КредиторскаяЗадолженность.ОбъектРасчетов.Договор КАК ОснованиеПлатежа,
		               |	КредиторскаяЗадолженность.Ссылка.Организация КАК Организация,
		               |	КредиторскаяЗадолженность.Ссылка.КонтрагентДебитор КАК Контрагент,
		               |	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности
		               |ИЗ
		               |	Документ.ВзаимозачетЗадолженности.КредиторскаяЗадолженность КАК КредиторскаяЗадолженность
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		               |		ПО КредиторскаяЗадолженность.Ссылка.Организация = АналитикаУчетаПоПартнерам.Организация
		               |			И КредиторскаяЗадолженность.Ссылка.КонтрагентДебитор = АналитикаУчетаПоПартнерам.Контрагент
		               |			И КредиторскаяЗадолженность.Партнер = АналитикаУчетаПоПартнерам.Партнер
		               |			И КредиторскаяЗадолженность.ОбъектРасчетов.Договор = АналитикаУчетаПоПартнерам.Договор
		               |			И ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) = АналитикаУчетаПоПартнерам.НаправлениеДеятельности
		               |ГДЕ
		               |	КредиторскаяЗадолженность.Ссылка = &Ссылка
		               |	И КредиторскаяЗадолженность.ОбъектРасчетов.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() и ЗначениеЗаполнено(Выборка.АналитикаУчетаПоПартнерам) Тогда
			КлючАналитики = Выборка.АналитикаУчетаПоПартнерам;
			
			Показатель = "СуммаКОплате";
			ВидДвижения = ВидДвиженияНакопления.Расход;
			
			//распределяем ТЧ
			//РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Новый Граница( данные.дата, ВидГраницы.Включая), Показатель, ОстатокДт);
			РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, ГраницаКонецДня, Показатель, ОстатокДт);
			
			Если РаспределениеСвободное.Распределение.Количество() > 0 Тогда
			
				Для Каждого Строка из РаспределениеСвободное.Распределение Цикл
					Движение = Движения.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
					Движение.Период = Данные.Дата;
					Движение.ВидДвижения = ВидДвижения;
					Движение.СводЗаявок = Строка.СводЗаявок;
					Движение.КоррСводЗаявок = Строка.СводЗаявок;
					Движение[Показатель] = Строка[Показатель];
					
				КонецЦикла;
			КонецЕсли;
		
			Показатель = "СуммаНаложенногоПлатежа";
			ВидДвижения = ВидДвиженияНакопления.Расход;
			
			//распределяем ТЧ
			//РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Новый Граница( данные.дата, ВидГраницы.Включая), Показатель, РаспределениеСвободное.Остаток);
			РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, ГраницаКонецДня, Показатель, РаспределениеСвободное.Остаток);
			
			Если РаспределениеСвободное.Распределение.Количество() > 0 Тогда
			
				Для Каждого Строка из РаспределениеСвободное.Распределение Цикл
					Движение = Движения.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
					Движение.Период = Данные.Дата;
					Движение.ВидДвижения = ВидДвижения;
					Движение.СводЗаявок = Строка.СводЗаявок;
					Движение.КоррСводЗаявок = Строка.СводЗаявок;
					Движение[Показатель] = Строка[Показатель];
					
				КонецЦикла;
			КонецЕсли;
		
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
Процедура ДвиженияЗаВычетомСписаниеЗадолженности(Ссылка, Договор, Движения)
	
	Показатель = "СуммаУслуг";
	Данные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "Дата, ХозяйственнаяОперация");
	ГраницаКонецДня = Новый Граница(КонецДня(Данные.Дата), ВидГраницы.Включая);
	Данные.Вставить("СуммаДокумента", Ссылка.Задолженность.Итог("Сумма"));
	
	Если Данные.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности Тогда
	
		Показатель = "СуммаКОплате";
		ВидДвижения = ВидДвиженияНакопления.Расход;
		
		//распределяем неоплаченные суммы из указанных сводов
		Распределение = РаспределитьОстаткиВзаиморасчетовЗаВычетом(Неопределено, ГраницаКонецДня, Показатель, Данные.СуммаДокумента, Ссылка);
		
		Если Распределение.Распределение.Количество() > 0 Тогда
		
			
			Для Каждого Строка из Распределение.Распределение Цикл
				Движение = Движения.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
				Движение.Период = Данные.Дата;
				Движение.ВидДвижения = ВидДвижения;
				Движение.СводЗаявок = Строка.СводЗаявок;
				Движение.КоррСводЗаявок = Строка.СводЗаявок;
				Движение[Показатель] = Строка[Показатель];
				
			КонецЦикла;
			
			Движения.Записать();
		КонецЕсли;
	
		Показатель = "СуммаНаложенногоПлатежа";
		ВидДвижения = ВидДвиженияНакопления.Расход;
		
		//распределяем зависшие суммы НП из указанных сводов
		Распределение = РаспределитьОстаткиВзаиморасчетовЗаВычетом(Неопределено, ГраницаКонецДня, Показатель, Распределение.Остаток, Ссылка);
		
		Если Распределение.Распределение.Количество() > 0 Тогда
		
			
			Для Каждого Строка из Распределение.Распределение Цикл
				Движение = Движения.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
				Движение.Период = Данные.Дата;
				Движение.ВидДвижения = ВидДвижения;
				Движение.СводЗаявок = Строка.СводЗаявок;
				Движение.КоррСводЗаявок = Строка.СводЗаявок;
				Движение[Показатель] = Строка[Показатель];
				
			КонецЦикла;
			
			Движения.Записать();
		КонецЕсли;
		
	ИначеЕсли Данные.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности Тогда
		
		Показатель = "СуммаУслуг";
		ВидДвижения = ВидДвиженияНакопления.Расход;
		
		//распределяем задолженность по услугам
		Распределение = РаспределитьОстаткиВзаиморасчетовЗаВычетом(Неопределено, ГраницаКонецДня, Показатель, Данные.СуммаДокумента, Ссылка);
		
		Если Распределение.Распределение.Количество() > 0 Тогда
		
			
			Для Каждого Строка из Распределение.Распределение Цикл
				Движение = Движения.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
				Движение.Период = Данные.Дата;
				Движение.ВидДвижения = ВидДвижения;
				Движение.СводЗаявок = Строка.СводЗаявок;
				Движение.КоррСводЗаявок = Строка.СводЗаявок;
				Движение[Показатель] = Строка[Показатель];
				
			КонецЦикла;
			
			Движения.Записать();
		КонецЕсли;
		
		Показатель = "СуммаКОплате";
		ВидДвижения = ВидДвиженияНакопления.Приход;
		
		//распределяем задолженность по услугам
		Распределение = РаспределитьОстаткиВзаиморасчетовЗаВычетом(Неопределено, ГраницаКонецДня, Показатель, -Распределение.Остаток, Ссылка);
		
		Если Распределение.Распределение.Количество() > 0 Тогда
		
			
			Для Каждого Строка из Распределение.Распределение Цикл
				Движение = Движения.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
				Движение.Период = Данные.Дата;
				Движение.ВидДвижения = ВидДвижения;
				Движение.СводЗаявок = Строка.СводЗаявок;
				Движение.КоррСводЗаявок = Строка.СводЗаявок;
				Движение[Показатель] = Строка[Показатель];
				
			КонецЦикла;
			
			Движения.Записать();
		КонецЕсли;
	
	КонецЕсли;	
	
	
	Если Распределение.Остаток<>0 Тогда
		
		// Найдем ключ аналитики, он понадобится чтобы правильно сделать движения
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	АналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам,
		               |	Задолженность.Партнер КАК Партнер,
		               |	Задолженность.ОбъектРасчетов.Договор КАК ОснованиеПлатежа,
		               |	Задолженность.Ссылка.Организация КАК Организация,
		               |	Задолженность.Ссылка.Контрагент КАК Контрагент,
		               |	ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности
		               |ИЗ
		               |	Документ.КорректировкаЗадолженности.Задолженность КАК Задолженность
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
		               |		ПО Задолженность.Ссылка.Организация = АналитикаУчетаПоПартнерам.Организация
		               |			И Задолженность.Ссылка.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
		               |			И Задолженность.Партнер = АналитикаУчетаПоПартнерам.Партнер
		               |			И Задолженность.ОбъектРасчетов.Договор = АналитикаУчетаПоПартнерам.Договор
		               |			И ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) = АналитикаУчетаПоПартнерам.НаправлениеДеятельности
		               |ГДЕ
		               |	Задолженность.Ссылка = &Ссылка
		               |	И Задолженность.ОбъектРасчетов.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов";
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если НЕ Выборка.Следующий() или НЕ ЗначениеЗаполнено(Выборка.АналитикаУчетаПоПартнерам) Тогда
			Возврат;  // не нашли ключ аналитики
		КонецЕсли;
		КлючАналитики = Выборка.АналитикаУчетаПоПартнерам;
		
		Если Данные.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности Тогда
		
			Показатель = "СуммаКОплате";
			ВидДвижения = ВидДвиженияНакопления.Расход;
			
			//закрываем возможные ошибки
			
			РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Новый Граница( данные.дата, ВидГраницы.Включая), Показатель, Распределение.Остаток);
			
			Если РаспределениеСвободное.Распределение.Количество() > 0 Тогда
			
				Для Каждого Строка из РаспределениеСвободное.Распределение Цикл
					Движение = Движения.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
					Движение.Период = Данные.Дата;
					Движение.ВидДвижения = ВидДвижения;
					Движение.СводЗаявок = Строка.СводЗаявок;
					Движение.КоррСводЗаявок = Строка.СводЗаявок;
					Движение[Показатель] = Строка[Показатель];
					
				КонецЦикла;
			КонецЕсли;
			
			Показатель = "СуммаНаложенногоПлатежа";
			ВидДвижения = ВидДвиженияНакопления.Расход;
			
			//закрываем возможные ошибки
			
			РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Новый Граница( данные.дата, ВидГраницы.Включая), Показатель, РаспределениеСвободное.Остаток);
			
			Если РаспределениеСвободное.Распределение.Количество() > 0 Тогда
			
				Для Каждого Строка из РаспределениеСвободное.Распределение Цикл
					Движение = Движения.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
					Движение.Период = Данные.Дата;
					Движение.ВидДвижения = ВидДвижения;
					Движение.СводЗаявок = Строка.СводЗаявок;
					Движение.КоррСводЗаявок = Строка.СводЗаявок;
					Движение[Показатель] = Строка[Показатель];
					
				КонецЦикла;
			КонецЕсли;
			
			Если РаспределениеСвободное.Остаток >0 Тогда
				
					Движение = Движения.Добавить();
					Движение.АналитикаУчетаПоПартнерам = КлючАналитики;
					Движение.Валюта = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();//Константы.ВалютаРегламентированногоУчета.Получить();
					Движение.Период = Данные.Дата;
					Движение.ВидДвижения = ВидДвижения;
					Движение.СводЗаявок = Неопределено;
					Движение.КоррСводЗаявок = Неопределено;
					Движение[Показатель] = РаспределениеСвободное.Остаток;
				
			КонецЕсли;
			
		ИначеЕсли Данные.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности Тогда
		
			Показатель = "СуммаКОплате";
			ВидДвижения = ВидДвиженияНакопления.Приход;
			
			//закрываем возможные ошибки
			
			РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Новый Граница( данные.дата, ВидГраницы.Включая), Показатель, -Распределение.Остаток);
			
			Если РаспределениеСвободное.Распределение.Количество() > 0 Тогда
			
				Для Каждого Строка из РаспределениеСвободное.Распределение Цикл
					Движение = Движения.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
					Движение.Период = Данные.Дата;
					Движение.ВидДвижения = ВидДвижения;
					Движение.СводЗаявок = Строка.СводЗаявок;
					Движение.КоррСводЗаявок = Строка.СводЗаявок;
					Движение[Показатель] = Строка[Показатель];
					
				КонецЦикла;
			КонецЕсли;
			
			Показатель = "СуммаУслуг";
			ВидДвижения = ВидДвиженияНакопления.Расход;
			
			//закрываем возможные ошибки
			
			РаспределениеСвободное = РаспределитьОстаткиВзаиморасчетовЗаВычетом(КлючАналитики, Новый Граница( данные.дата, ВидГраницы.Включая), Показатель, РаспределениеСвободное.Остаток);
			
			Если РаспределениеСвободное.Распределение.Количество() > 0 Тогда
			
				Для Каждого Строка из РаспределениеСвободное.Распределение Цикл
					Движение = Движения.Добавить();
					ЗаполнитьЗначенияСвойств(Движение, Строка, "АналитикаУчетаПоПартнерам, Валюта"); 
					Движение.Период = Данные.Дата;
					Движение.ВидДвижения = ВидДвижения;
					Движение.СводЗаявок = Строка.СводЗаявок;
					Движение.КоррСводЗаявок = Строка.СводЗаявок;
					Движение[Показатель] = Строка[Показатель];
					
				КонецЦикла;
			КонецЕсли;
			
			Если РаспределениеСвободное.Остаток <>0 Тогда
				
				Движение = Движения.Добавить();
				Движение.АналитикаУчетаПоПартнерам = КлючАналитики;
				Движение.Валюта = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();//Константы.ВалютаРегламентированногоУчета.Получить();
				Движение.Период = Данные.Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;//ВидДвижения;
				Движение.СводЗаявок = Неопределено;
				Движение.КоррСводЗаявок = Неопределено;
				Движение[Показатель] = РаспределениеСвободное.Остаток;
				
			КонецЕсли;
	
		КонецЕсли;
	КонецЕсли;
		
КонецПроцедуры

Функция ПолучитьКлючАналитикиУчетаПоПартнерам(СтруктураДанных)
	
	ДанныеАналитики = Новый Структура;
	ДанныеАналитики.Вставить("Организация", СтруктураДанных.Организация);
	ДанныеАналитики.Вставить("Контрагент", СтруктураДанных.Контрагент);
	ДанныеАналитики.Вставить("Партнер", СтруктураДанных.Партнер);
	ДанныеАналитики.Вставить("Договор", СтруктураДанных.Договор);
	ДанныеАналитики.Вставить("НаправлениеДеятельности", Справочники.НаправленияДеятельности.ПустаяСсылка());
	
	Возврат РегистрыСведений.АналитикаУчетаПоПартнерам.ЗначениеКлючаАналитики(ДанныеАналитики);
	
КонецФункции 
Функция ПолучитьОстаткиВзаиморасчетовЗаВычетом(АналитикаУчетаПоПартнерам, Период, Показатель, СсылкаНаДокумент = Неопределено, Договор = Неопределено)
	
	Если СсылкаНаДокумент = Неопределено Тогда
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ
		               |	Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
		               |	Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок КАК СводЗаявок,
		               |	Логс_ВзаиморасчетыЗаВычетомОстатки.Валюта КАК Валюта,
		               |	&Показатель КАК Показатель
					   //|	Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаУслугОстаток КАК СуммаУслуг,
					   //|	Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаНаложенногоПлатежаОстаток КАК СуммаНаложенногоПлатежа,
					   //|	Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаКОплатеОстаток КАК СуммаКОплате
		               |ИЗ
		               |	РегистрНакопления.Логс_ВзаиморасчетыЗаВычетом.Остатки(&Период, АналитикаУчетаПоПартнерам = &АналитикаУчетаПоПартнерам) КАК Логс_ВзаиморасчетыЗаВычетомОстатки
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок.Дата";
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "&Показатель КАК Показатель","Логс_ВзаиморасчетыЗаВычетомОстатки."+Показатель+"Остаток КАК "+Показатель);
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", АналитикаУчетаПоПартнерам);
		
		Возврат Запрос.Выполнить().Выгрузить();
	Иначе
		Запрос = Новый Запрос;
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ДанныеРаспределения.СводЗаявок КАК СводЗаявок,
		               |	ДанныеРаспределения.НаправлениеДеятельности КАК НаправлениеДеятельности,
		               |	ДанныеРаспределения.Валюта КАК Валюта,
		               |	СУММА(ДанныеРаспределения.Сумма) КАК Сумма
		               |ПОМЕСТИТЬ ВТ_ДанныеДокумента
		               |ИЗ
		               |	(ВЫБРАТЬ
		               |		Распределение.СводЗаявок КАК СводЗаявок,
		               |		Распределение.Ссылка.НаправлениеДеятельности КАК НаправлениеДеятельности,
		               |		Распределение.Ссылка.Валюта КАК Валюта,
		               |		Распределение.Сумма КАК Сумма
		               |	ИЗ
		               |		Документ.СписаниеБезналичныхДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК Распределение
		               |	ГДЕ
		               |		Распределение.Ссылка = &СсылкаНаДокумент
		               |		И Распределение.Ссылка.ПроведеноБанком
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		Распределение.СводЗаявок,
		               |		Распределение.Ссылка.НаправлениеДеятельности,
		               |		Распределение.Ссылка.Валюта,
		               |		Распределение.Сумма
		               |	ИЗ
		               |		Документ.РасходныйКассовыйОрдер.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК Распределение
		               |	ГДЕ
		               |		Распределение.Ссылка = &СсылкаНаДокумент
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		Распределение.СводЗаявок,
		               |		Распределение.Ссылка.НаправлениеДеятельности,
		               |		Распределение.Ссылка.Валюта,
		               |		Распределение.Сумма
		               |	ИЗ
		               |		Документ.ПоступлениеБезналичныхДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК Распределение
		               |	ГДЕ
		               |		Распределение.Ссылка = &СсылкаНаДокумент
		               |		И Распределение.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика))
		               |		И Распределение.Ссылка.ПроведеноБанком
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		Распределение.СводЗаявок,
		               |		Распределение.Ссылка.НаправлениеДеятельности,
		               |		Распределение.Ссылка.Валюта,
		               |		Распределение.Сумма
		               |	ИЗ
		               |		Документ.ПриходныйКассовыйОрдер.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК Распределение
		               |	ГДЕ
		               |		Распределение.Ссылка = &СсылкаНаДокумент
		               |		И Распределение.Ссылка.ХозяйственнаяОперация В (ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента), ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика))
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		Распределение.Свод,
		               |		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
		               |		&РегВалюта,
		               |		Распределение.Сумма
		               |	ИЗ
		               |		Документ.КорректировкаЗадолженности.Своды КАК Распределение
		               |	ГДЕ
		               |		Распределение.Ссылка = &СсылкаНаДокумент
		               |		И Распределение.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности)
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ
		               |		Распределение.Свод,
		               |		ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
		               |		&РегВалюта,
		               |		Распределение.Сумма
		               |	ИЗ
		               |		Документ.КорректировкаЗадолженности.Своды КАК Распределение
		               |	ГДЕ
		               |		Распределение.Ссылка = &СсылкаНаДокумент
		               |		И Распределение.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности)
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |		Распределение.СводЗаявок,
		               |		Распределение.НаправлениеДеятельности,
		               |		Распределение.Валюта,
		               |		Распределение.Сумма
		               |	ИЗ
		               |		(ВЫБРАТЬ
		               |			Распределение.СводЗаявок КАК СводЗаявок,
		               |			Распределение.Ссылка.НаправлениеДеятельности КАК НаправлениеДеятельности,
		               |			Распределение.Ссылка.Валюта КАК Валюта,
		               |			Распределение.Сумма КАК Сумма
		               |		ИЗ
		               |			Документ.ЗаявкаНаРасходованиеДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК Распределение
		               |		ГДЕ
		               |			Распределение.Ссылка = &СсылкаНаДокумент
		               |			И Распределение.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате)
		               |		
		               |		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ
		               |			Распределение.СводЗаявок,
		               |			Распределение.Ссылка.НаправлениеДеятельности,
		               |			Распределение.Ссылка.Валюта,
		               |			Распределение.Сумма
		               |		ИЗ
		               |			Документ.ЗаявкаНаРасходованиеДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставкуДвижения КАК Распределение
		               |		ГДЕ
		               |			ЛОЖЬ
		               |			И Распределение.Ссылка = &СсылкаНаДокумент
		               |			И Распределение.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.КОплате)) КАК Распределение
		               |	
		               |	ОБЪЕДИНИТЬ ВСЕ
		               |	
		               |	ВЫБРАТЬ РАЗЛИЧНЫЕ
		               |		Распределение.СводЗаявок,
		               |		Распределение.НаправлениеДеятельности,
		               |		Распределение.Валюта,
		               |		Распределение.Сумма
		               |	ИЗ
		               |		(ВЫБРАТЬ
		               |			Распределение.Свод КАК СводЗаявок,
		               |			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) КАК НаправлениеДеятельности,
		               |			Распределение.Ссылка.Валюта КАК Валюта,
		               |			Распределение.Сумма КАК Сумма
		               |		ИЗ
		               |			Документ.ВзаимозачетЗадолженности.СводыКредит КАК Распределение
		               |		ГДЕ
		               |			Распределение.Ссылка = &СсылкаНаДокумент
		               |		
		               |		ОБЪЕДИНИТЬ ВСЕ
		               |		
		               |		ВЫБРАТЬ
		               |			Распределение.Свод,
		               |			ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка),
		               |			Распределение.Ссылка.Валюта,
		               |			-Распределение.Сумма
		               |		ИЗ
		               |			Документ.ВзаимозачетЗадолженности.СводыДебет КАК Распределение
		               |		ГДЕ
		               |			ЛОЖЬ
		               |			И Распределение.Ссылка = &СсылкаНаДокумент) КАК Распределение) КАК ДанныеРаспределения
		               |ГДЕ
		               |	ДанныеРаспределения.СводЗаявок.Договор = &Договор
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДанныеРаспределения.СводЗаявок,
		               |	ДанныеРаспределения.НаправлениеДеятельности,
		               |	ДанныеРаспределения.Валюта
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	РС_АналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам,
		               |	ВТ_ДанныеДокумента.СводЗаявок КАК СводЗаявок,
		               |	ВТ_ДанныеДокумента.Валюта КАК Валюта,
		               |	&Показатель КАК Показатель
		               |ИЗ
		               |	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Логс_ВзаиморасчетыЗаВычетом.Остатки(&Период, ) КАК Логс_ВзаиморасчетыЗаВычетомОстатки
		               |		ПО ВТ_ДанныеДокумента.СводЗаявок = Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РС_АналитикаУчетаПоПартнерам
		               |		ПО ВТ_ДанныеДокумента.СводЗаявок.Организация = РС_АналитикаУчетаПоПартнерам.Организация
		               |			И ВТ_ДанныеДокумента.СводЗаявок.Контрагент = РС_АналитикаУчетаПоПартнерам.Контрагент
		               |			И ВТ_ДанныеДокумента.СводЗаявок.Партнер = РС_АналитикаУчетаПоПартнерам.Партнер
		               |			И ВТ_ДанныеДокумента.СводЗаявок.Договор = РС_АналитикаУчетаПоПартнерам.Договор
		               |			И ВТ_ДанныеДокумента.НаправлениеДеятельности = РС_АналитикаУчетаПоПартнерам.НаправлениеДеятельности
		               |ГДЕ
		               |	ВТ_ДанныеДокумента.СводЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом)
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок.Дата,
		               |	Показатель";
					   //|	Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаУслугОстаток КАК СуммаУслуг,
					   //|	Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаНаложенногоПлатежаОстаток КАК СуммаНаложенногоПлатежа,
					   //|	Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаКОплатеОстаток КАК СуммаКОплате
					   
		ИмяПоказателя = "Логс_ВзаиморасчетыЗаВычетомОстатки."+Показатель+"Остаток";
		ФормулаПоля = "Выбор Когда ЕстьNull("+ИмяПоказателя+",0)<ВТ_ДанныеДокумента.Сумма Тогда ЕстьNull("+ИмяПоказателя+",0) Иначе ВТ_ДанныеДокумента.Сумма Конец";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&Показатель КАК Показатель", ФормулаПоля + " КАК " + Показатель);
		Если ЗначениеЗаполнено(Договор) Тогда
			Запрос.УстановитьПараметр("Договор", Договор);
		Иначе
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ДанныеРаспределения.СводЗаявок.Договор = &Договор", "Истина")
		КонецЕсли;
		Запрос.Текст = СтрЗаменить(ТекстЗапроса, "Показатель", Показатель);
		Запрос.УстановитьПараметр("Период", Период);
		Запрос.УстановитьПараметр("АналитикаУчетаПоПартнерам", АналитикаУчетаПоПартнерам);
		Запрос.УстановитьПараметр("СсылкаНаДокумент", СсылкаНаДокумент);
		Запрос.УстановитьПараметр("РегВалюта", ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета());
		
		Возврат Запрос.Выполнить().Выгрузить();
	КонецЕсли;
	
КонецФункции
Функция РаспределитьОстаткиВзаиморасчетовЗаВычетом(АналитикаУчетаПоПартнерам, Период, Показатель, Сумма, СсылкаНаДокумент = Неопределено, Договор = Неопределено) Экспорт
	
	Результат = Новый Структура("Распределение, Остаток");
	
	ТаблицаОстатков = ПолучитьОстаткиВзаиморасчетовЗаВычетом(АналитикаУчетаПоПартнерам, Период, Показатель, СсылкаНаДокумент, Договор);
	
	Остаток = Сумма;
	Распределение = ТаблицаОстатков.СкопироватьКолонки();
	
	Для Каждого Строка из ТаблицаОстатков Цикл
		Если Остаток = 0 Тогда
			Прервать;
		КонецЕсли;
		Если Строка[Показатель]>0 и Сумма>0 Тогда
		
			Новая = Распределение.Добавить();
			ЗаполнитьЗначенияСвойств(Новая, Строка);
			
			Если Строка[Показатель]>=Остаток Тогда
				Новая[Показатель] = Остаток;
				Остаток = 0;
			Иначе
				Остаток = Остаток - Новая[Показатель];
			КонецЕсли;
		ИначеЕсли Строка[Показатель]<0 и Сумма<0 Тогда
		
			Новая = Распределение.Добавить();
			ЗаполнитьЗначенияСвойств(Новая, Строка);
			
			Если Строка[Показатель]>=Остаток Тогда
				Новая[Показатель] = Остаток;
				Остаток = 0;
			Иначе
				Остаток = Остаток - Новая[Показатель];
			КонецЕсли;
			
		
		КонецЕсли;
		
	КонецЦикла;
	
	Результат.Распределение = Распределение;
	Результат.Остаток = Остаток;
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти

#Область ДвиженияРасчетовПоСводамЗаявокНаДоставку

Процедура ДвиженияРасчетовПоСводамЗаявокНаДоставкуЗаявкаНаРасходованиеДС(Источник, Отказ, РежимПроведения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Аналитика.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок КАК СводЗаявок,
	|	ДокСводЗаявокНаДоставку.Валюта КАК Валюта,
	|	0 КАК Сумма,
	|	0 КАК КОплате,
	|	РаспределениеПоСводамЗаявокНаДоставку.Сумма КАК Оплачивается
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК РаспределениеПоСводамЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.Ссылка = ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК ДокСводЗаявокНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО ДокСводЗаявокНаДоставку.Партнер = Аналитика.Партнер
	|				И ДокСводЗаявокНаДоставку.Организация = Аналитика.Организация
	|				И ДокСводЗаявокНаДоставку.Контрагент = Аналитика.Контрагент
	|				И ДокСводЗаявокНаДоставку.Договор = Аналитика.Договор
	|				И (Аналитика.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок = ДокСводЗаявокНаДоставку.Ссылка
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка = &Ссылка
	|	И ЗаявкаНаРасходованиеДенежныхСредств.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена)
	|	И ЗаявкаНаРасходованиеДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику)");
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	ЗаписатьДвиженияРасчетовПоНаложеннымПлатежам(Источник, ТаблицаДвижений);
	
КонецПроцедуры

Процедура ДвиженияРасчетовПоСводамЗаявокНаДоставкуЗаявкаНаРасходованиеДС_20(Источник, Отказ, РежимПроведения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Аналитика.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок КАК СводЗаявок,
	|	ДокСводЗаявокНаДоставку.Валюта КАК Валюта,
	|	РаспределениеПоСводамЗаявокНаДоставку.Сумма КАК Сумма
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК РаспределениеПоСводамЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.Ссылка = ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК ДокСводЗаявокНаДоставку
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИсторияФормыОплатыДоговоров.СрезПоследних(&Период, ) КАК Логс_ИсторияФормыОплатыДоговоровСрезПоследних
	|			ПО (ДокСводЗаявокНаДоставку.Договор = Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ДоговорКонтрагентов
	|					И Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.Оплата100))
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО ДокСводЗаявокНаДоставку.Партнер = Аналитика.Партнер
	|				И ДокСводЗаявокНаДоставку.Организация = Аналитика.Организация
	|				И ДокСводЗаявокНаДоставку.Контрагент = Аналитика.Контрагент
	|				И ДокСводЗаявокНаДоставку.Договор = Аналитика.Договор
	|				И (Аналитика.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок = ДокСводЗаявокНаДоставку.Ссылка
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка = &Ссылка
	|	И ЗаявкаНаРасходованиеДенежныхСредств.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена)
	|	И ЗаявкаНаРасходованиеДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Аналитика.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	ЗаявкаНаРасходованиеДенежныхСредств_РаспределениеПоСчетам.Счет КАК Счет,
	|	СчетНаОплатуКлиенту.Валюта КАК Валюта,
	|	ЗаявкаНаРасходованиеДенежныхСредств_РаспределениеПоСчетам.Сумма КАК Долг,
	|	ЕСТЬNULL(Логс_ВзаиморасчетыПоУслугам100Остатки.ПредоплатаОстаток, 0) КАК ПредоплатаОстаток,
	|	ВЗ_СчетДатаПлатежа.ДатаПлатежа КАК ДатаПлановогоПогашения
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.Логс_РаспределениеПоСчетам КАК ЗаявкаНаРасходованиеДенежныхСредств_РаспределениеПоСчетам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|		ПО ЗаявкаНаРасходованиеДенежныхСредств_РаспределениеПоСчетам.Ссылка = ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО СчетНаОплатуКлиенту.Партнер = Аналитика.Партнер
	|				И СчетНаОплатуКлиенту.Организация = Аналитика.Организация
	|				И СчетНаОплатуКлиенту.Контрагент = Аналитика.Контрагент
	|				И СчетНаОплатуКлиенту.Договор = Аналитика.Договор
	|				И (Аналитика.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|			ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|				СчетНаОплатуКлиентуЭтапыГрафикаОплаты.Ссылка КАК Ссылка,
	|				МАКСИМУМ(СчетНаОплатуКлиентуЭтапыГрафикаОплаты.ДатаПлатежа) КАК ДатаПлатежа
	|			ИЗ
	|				Документ.СчетНаОплатуКлиенту.ЭтапыГрафикаОплаты КАК СчетНаОплатуКлиентуЭтапыГрафикаОплаты
	|			
	|			СГРУППИРОВАТЬ ПО
	|				СчетНаОплатуКлиентуЭтапыГрафикаОплаты.Ссылка) КАК ВЗ_СчетДатаПлатежа
	|			ПО СчетНаОплатуКлиенту.Ссылка = ВЗ_СчетДатаПлатежа.Ссылка
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИсторияФормыОплатыДоговоров.СрезПоследних(&Период, ) КАК Логс_ИсторияФормыОплатыДоговоровСрезПоследних
	|			ПО (СчетНаОплатуКлиенту.Договор = Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ДоговорКонтрагентов
	|					И Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.Оплата100))
	|		ПО ЗаявкаНаРасходованиеДенежныхСредств_РаспределениеПоСчетам.Счет = СчетНаОплатуКлиенту.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Логс_ВзаиморасчетыПоУслугам100.Остатки(, ) КАК Логс_ВзаиморасчетыПоУслугам100Остатки
	|		ПО ЗаявкаНаРасходованиеДенежныхСредств_РаспределениеПоСчетам.Счет = Логс_ВзаиморасчетыПоУслугам100Остатки.Счет
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка = &Ссылка
	|	И ЗаявкаНаРасходованиеДенежныхСредств.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена)
	|	И ЗаявкаНаРасходованиеДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)");
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("Период", Источник.МоментВремени());
	
	Рез = Запрос.ВыполнитьПакет();
	
	ТаблицаДвижений = Рез[0].Выгрузить();
	ЗаписатьДвиженияЗаявкиНаРасход100(Источник, ТаблицаДвижений);
	
	ТаблицаДвижений = СоздатьТаблицуДвиженийВзаиморасчетыПоУслугам100();
	Выборка = Рез[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Сумма = Выборка.Долг;
		
		// по счету висит предоплата
		Если Выборка.ПредоплатаОстаток > 0 Тогда
			Строка =  ТаблицаДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, Выборка);
			Строка.ВидДвижения = ВидДвиженияНакопления.Расход;
			Строка.Долг = 0;
			Строка.Предоплата = Мин(Выборка.Долг, Выборка.ПредоплатаОстаток);
			Сумма = Сумма - Строка.Предоплата;
			Строка.ДатаПлановогоПогашения = Дата(1, 1, 1);
		КонецЕсли;
		
		Если Сумма > 0 Тогда
			Строка =  ТаблицаДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(Строка, Выборка);
			Строка.Долг = Сумма;
			Строка.Предоплата = 0;
		КонецЕсли;			
		
	КонецЦикла;	
	ЗаписатьДвиженияВзаиморасчетыПоУслугам100(Источник, ТаблицаДвижений);
	
КонецПроцедуры

Процедура ДвиженияРасчетовПоСводамЗаявокНаДоставкуСписаниеБезналичныхДС(Источник, Отказ, РежимПроведения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СписаниеБезналичныхДенежныхСредств.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Аналитика.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок КАК СводЗаявок,
	|	ДокСводЗаявокНаДоставку.Валюта КАК Валюта,
	|	РаспределениеПоСводамЗаявокНаДоставку.Сумма КАК Сумма,
	|	РаспределениеПоСводамЗаявокНаДоставку.Сумма КАК КОплате,
	|	РаспределениеПоСводамЗаявокНаДоставку.Сумма КАК Оплачивается
	|ИЗ
	|	Документ.СписаниеБезналичныхДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК РаспределениеПоСводамЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеБезналичныхДенежныхСредств
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.Ссылка = СписаниеБезналичныхДенежныхСредств.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК ДокСводЗаявокНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО ДокСводЗаявокНаДоставку.Партнер = Аналитика.Партнер
	|				И ДокСводЗаявокНаДоставку.Организация = Аналитика.Организация
	|				И ДокСводЗаявокНаДоставку.Контрагент = Аналитика.Контрагент
	|				И ДокСводЗаявокНаДоставку.Договор = Аналитика.Договор
	|				И (Аналитика.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок = ДокСводЗаявокНаДоставку.Ссылка
	|ГДЕ
	|	СписаниеБезналичныхДенежныхСредств.Ссылка = &Ссылка
	|	И СписаниеБезналичныхДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику)");
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	ЗаписатьДвиженияРасчетовПоНаложеннымПлатежам(Источник, ТаблицаДвижений);
	
	Источник.Движения.Логс_РасчетыПоНаложеннымПлатежам.Записать();
	
	СфорироватьСписокЗависимыхСводовЗаявокПоСписаниюБезналичныхДС(Источник);
	РегистрыСведений.Логс_СостоянияСводовЗаявокНаДоставку.ОтразитьСостояниеСводаЗаявокНаДоставку(Источник, Отказ);
	
КонецПроцедуры

Процедура ДвиженияРасчетовПоСводамЗаявокНаДоставкуРасходныйКассовыйОрдер(Источник, Отказ, РежимПроведения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Аналитика.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок КАК СводЗаявок,
	|	ДокСводЗаявокНаДоставку.Валюта КАК Валюта,
	|	РаспределениеПоСводамЗаявокНаДоставку.Сумма КАК Сумма,
	|	РаспределениеПоСводамЗаявокНаДоставку.Сумма КАК КОплате,
	|	РаспределениеПоСводамЗаявокНаДоставку.Сумма КАК Оплачивается
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК РаспределениеПоСводамЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.Ссылка = РасходныйКассовыйОрдер.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК ДокСводЗаявокНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО ДокСводЗаявокНаДоставку.Партнер = Аналитика.Партнер
	|				И ДокСводЗаявокНаДоставку.Организация = Аналитика.Организация
	|				И ДокСводЗаявокНаДоставку.Контрагент = Аналитика.Контрагент
	|				И ДокСводЗаявокНаДоставку.Договор = Аналитика.Договор
	|				И (Аналитика.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок = ДокСводЗаявокНаДоставку.Ссылка
	|ГДЕ
	|	РасходныйКассовыйОрдер.Ссылка = &Ссылка
	|	И РасходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику)");
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	ЗаписатьДвиженияРасчетовПоНаложеннымПлатежам(Источник, ТаблицаДвижений);
	
	Источник.Движения.Логс_РасчетыПоНаложеннымПлатежам.Записать();
	
	СфорироватьСписокЗависимыхСводовЗаявокПоРКО(Источник);
	РегистрыСведений.Логс_СостоянияСводовЗаявокНаДоставку.ОтразитьСостояниеСводаЗаявокНаДоставку(Источник, Отказ);
	
КонецПроцедуры

Процедура ДвиженияРасчетовПоСводамЗаявокНаДоставкуСчетНаОплатуКлиенту(Источник, Отказ, РежимПроведения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	МАКСИМУМ(СчетНаОплатуКлиентуЭтапыГрафикаОплаты.ДатаПлатежа) КАК ДатаПлатежа
	|ПОМЕСТИТЬ ГрафикОплаты
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту.ЭтапыГрафикаОплаты КАК СчетНаОплатуКлиентуЭтапыГрафикаОплаты
	|ГДЕ
	|	СчетНаОплатуКлиентуЭтапыГрафикаОплаты.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетНаОплатуКлиенту.Дата КАК Дата,
	|	СчетНаОплатуКлиенту.Номер КАК Номер,
	|	Аналитика.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок КАК СводЗаявок,
	|	ДокСводЗаявокНаДоставку.Валюта КАК Валюта,
	|	РаспределениеПоСводамЗаявокНаДоставку.Сумма КАК Сумма,
	|	КОНЕЦПЕРИОДА(ЕСТЬNULL(ГрафикОплаты.ДатаПлатежа, СчетНаОплатуКлиенту.Дата), ДЕНЬ) КАК ДатаПлатежаПоГрафику
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК РаспределениеПоСводамЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.Ссылка = СчетНаОплатуКлиенту.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК ДокСводЗаявокНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО ДокСводЗаявокНаДоставку.Партнер = Аналитика.Партнер
	|				И ДокСводЗаявокНаДоставку.Организация = Аналитика.Организация
	|				И ДокСводЗаявокНаДоставку.Контрагент = Аналитика.Контрагент
	|				И ДокСводЗаявокНаДоставку.Договор = Аналитика.Договор
	|				И (Аналитика.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок = ДокСводЗаявокНаДоставку.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикОплаты КАК ГрафикОплаты
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИсторияФормыОплатыДоговоров.СрезПоследних(&Период, ) КАК Логс_ИсторияФормыОплатыДоговоровСрезПоследних
	|		ПО (СчетНаОплатуКлиенту.Договор = Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ДоговорКонтрагентов)
	|			И (Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.Оплата100))
	|ГДЕ
	|	СчетНаОплатуКлиенту.Ссылка = &Ссылка
	|	И НЕ СчетНаОплатуКлиенту.Аннулирован
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.ДатаПлатежаПоГрафику КАК Период,
	|	Данные.Дата КАК ДатаРегистратора,
	|	Данные.Номер КАК НомерРегистратора,
	|	НАЧАЛОПЕРИОДА(Данные.ДатаПлатежаПоГрафику, ДЕНЬ) КАК ДатаПлатежа,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	Данные.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Данные.СводЗаявок КАК СводЗаявок,
	|	Данные.Валюта КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту) КАК ХозяйственнаяОперация,
	|	ИСТИНА КАК ИсключатьПриКонтроле,
	|	Данные.Сумма КАК КОплате,
	|	0 КАК КВыставлению,
	|	0 КАК Выставлено
	|ИЗ
	|	Данные КАК Данные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Данные.Дата,
	|	Данные.Дата,
	|	Данные.Номер,
	|	Данные.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Данные.АналитикаУчетаПоПартнерам,
	|	Данные.СводЗаявок,
	|	Данные.Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту),
	|	ИСТИНА,
	|	0,
	|	Данные.Сумма,
	|	0
	|ИЗ
	|	Данные КАК Данные
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Данные.Дата,
	|	Данные.Дата,
	|	Данные.Номер,
	|	НАЧАЛОПЕРИОДА(Данные.ДатаПлатежаПоГрафику, ДЕНЬ),
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Данные.АналитикаУчетаПоПартнерам,
	|	Данные.СводЗаявок,
	|	Данные.Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту),
	|	ИСТИНА,
	|	0,
	|	0,
	|	Данные.Сумма
	|ИЗ
	|	Данные КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Данные.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Данные.СводЗаявок КАК СводЗаявок,
	|	Данные.Валюта КАК Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту) КАК ХозяйственнаяОперация,
	|	Данные.Сумма КАК Сумма
	|ИЗ
	|	Данные КАК Данные
	|ГДЕ
	|	Данные.Сумма > 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Данные.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Данные.АналитикаУчетаПоПартнерам,
	|	Данные.СводЗаявок,
	|	Данные.Валюта,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВзаимозачетЗадолженности),
	|	-Данные.Сумма
	|ИЗ
	|	Данные КАК Данные
	|ГДЕ
	|	Данные.Сумма < 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетНаОплатуКлиенту.Дата КАК Период,
	|	Аналитика.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	КОНЕЦПЕРИОДА(ЕСТЬNULL(ГрафикОплаты.ДатаПлатежа, СчетНаОплатуКлиенту.Дата), ДЕНЬ) КАК ДатаПлановогоПогашения,
	|	СчетНаОплатуКлиенту.Ссылка КАК Счет,
	|	СчетНаОплатуКлиенту.Валюта КАК Валюта,
	|	СчетНаОплатуКлиенту.СуммаДокумента КАК Долг
	|ПОМЕСТИТЬ ДанныеСчет
	|ИЗ
	|	Документ.СчетНаОплатуКлиенту КАК СчетНаОплатуКлиенту
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|		ПО СчетНаОплатуКлиенту.Партнер = Аналитика.Партнер
	|			И СчетНаОплатуКлиенту.Организация = Аналитика.Организация
	|			И СчетНаОплатуКлиенту.Контрагент = Аналитика.Контрагент
	|			И СчетНаОплатуКлиенту.Договор = Аналитика.Договор
	|			И (Аналитика.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГрафикОплаты КАК ГрафикОплаты
	|		ПО (ИСТИНА)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИсторияФормыОплатыДоговоров.СрезПоследних(&Период, ) КАК Логс_ИсторияФормыОплатыДоговоровСрезПоследних
	|		ПО СчетНаОплатуКлиенту.Договор = Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ДоговорКонтрагентов
	|			И (Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.Оплата100))
	|ГДЕ
	|	СчетНаОплатуКлиенту.Ссылка = &Ссылка
	|	И НЕ СчетНаОплатуКлиенту.Аннулирован
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетНаОплатуКлиенту.Период КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	|	СчетНаОплатуКлиенту.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.РеализацияКлиенту) КАК ХозяйственнаяОперация,
	|	СчетНаОплатуКлиенту.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	СчетНаОплатуКлиенту.Счет КАК Счет,
	|	СчетНаОплатуКлиенту.Валюта КАК Валюта,
	|	СчетНаОплатуКлиенту.Долг КАК Долг,
	|	0 КАК Предоплата
	|ИЗ
	|	ДанныеСчет КАК СчетНаОплатуКлиенту
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Логс_ВзаиморасчетыПоУслугам100Остатки.ПредоплатаОстаток) КАК Предоплата,
	|	Логс_ВзаиморасчетыПоУслугам100Остатки.Счет КАК Счет,
	|	Логс_ВзаиморасчетыПоУслугам100Остатки.Валюта КАК Валюта
	|ИЗ
	|	ДанныеСчет КАК СчетНаОплатуКлиенту
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Логс_ВзаиморасчетыПоУслугам100.Остатки(&Период, ) КАК Логс_ВзаиморасчетыПоУслугам100Остатки
	|		ПО СчетНаОплатуКлиенту.АналитикаУчетаПоПартнерам = Логс_ВзаиморасчетыПоУслугам100Остатки.АналитикаУчетаПоПартнерам
	|			И СчетНаОплатуКлиенту.Счет = Логс_ВзаиморасчетыПоУслугам100Остатки.Счет
	|
	|СГРУППИРОВАТЬ ПО
	|	Логс_ВзаиморасчетыПоУслугам100Остатки.Счет,
	|	Логс_ВзаиморасчетыПоУслугам100Остатки.Валюта
	|
	|ИМЕЮЩИЕ
	|	СУММА(Логс_ВзаиморасчетыПоУслугам100Остатки.ПредоплатаОстаток) > 0");
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("Период", Источник.МоментВремени());
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Источник.Ссылка,
		Источник.ДополнительныеСвойства, РежимПроведения);
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый",    Источник.ЭтоНовый());
	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	Рез = Запрос.ВыполнитьПакет();
	
	ТаблицаДвижений = Рез[2].Выгрузить();
	ЗаписатьДвиженияРасчетовПоУслугамЗаДоставку(Источник, ТаблицаДвижений);
	
	ТаблицаДвижений = Рез[3].Выгрузить();
	ЗаписатьДвиженияСчетаПоУслугам100(Источник, ТаблицаДвижений);
	
	ТаблицаДвижений = Рез[5].Выгрузить();
	ТаблицаДвиженийАванс = ТаблицаДвижений.Скопировать();
	ТаблицаДвиженийАванс.Очистить();
	Если ТаблицаДвижений.Количество() > 0 Тогда
		
		// если были переплаты, то выполним зачет
		ТаблицаАванс = Рез[6].Выгрузить();
		Стр0 = ТаблицаДвижений[0];
		Ост = Стр0.Долг;
		Для каждого Строка Из ТаблицаАванс Цикл
			Если Ост = 0 Тогда
				Прервать;
			КонецЕсли;	
			Если Ост >= Строка.Предоплата Тогда
				СуммаАванс = Строка.Предоплата;
				Ост = Ост - Строка.Предоплата;
			Иначе
				СуммаАванс = Ост;
				Ост = 0;
			КонецЕсли;	
			НовСтрока = ТаблицаДвиженийАванс.Добавить();
			НовСтрока.Период = Стр0.Период;
			НовСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НовСтрока.АналитикаУчетаПоПартнерам = Стр0.АналитикаУчетаПоПартнерам;
			НовСтрока.Валюта = Строка.Валюта;
			НовСтрока.ХозяйственнаяОперация = перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности;
			НовСтрока.Счет = Строка.Счет;
			НовСтрока.Предоплата = СуммаАванс;
			
			НовСтрока = ТаблицаДвиженийАванс.Добавить();
			ЗаполнитьЗначенияСвойств(НовСтрока, Стр0); 
			НовСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НовСтрока.ХозяйственнаяОперация = перечисления.ХозяйственныеОперации.ВзаимозачетЗадолженности;
			НовСтрока.Долг = СуммаАванс;
			
		КонецЦикла;	
		
	КонецЕсли;	
	
	Для каждого Строка Из ТаблицаДвиженийАванс Цикл
		НовСтрока = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НовСтрока, Строка);
	КонецЦикла;	
	
	ЗаписатьДвиженияВзаиморасчетыПоУслугам100(Источник, ТаблицаДвижений);	
	
КонецПроцедуры 

Процедура ДвиженияРасчетовПоСводамЗаявокНаДоставкуПоступлениеБезналичныхДС(Источник, Отказ, РежимПроведения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПоступлениеБезналичныхДенежныхСредств.Дата КАК Дата,
	|	ПоступлениеБезналичныхДенежныхСредств.Номер КАК Номер,
	|	Аналитика.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	РаспределениеПоСводам.СводЗаявок КАК СводЗаявок,
	|	ДокСводЗаявокНаДоставку.Валюта КАК Валюта,
	|	ПоступлениеБезналичныхДенежныхСредств.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ПоступлениеБезналичныхДенежныхСредств.ПроведеноБанком КАК ПроведеноБанком,
	|	РаспределениеПоСводам.Сумма КАК Сумма
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК РаспределениеПоСводам
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
	|		ПО РаспределениеПоСводам.Ссылка = ПоступлениеБезналичныхДенежныхСредств.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК ДокСводЗаявокНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО ДокСводЗаявокНаДоставку.Партнер = Аналитика.Партнер
	|				И ДокСводЗаявокНаДоставку.Организация = Аналитика.Организация
	|				И ДокСводЗаявокНаДоставку.Контрагент = Аналитика.Контрагент
	|				И ДокСводЗаявокНаДоставку.Договор = Аналитика.Договор
	|				И (Аналитика.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ПО РаспределениеПоСводам.СводЗаявок = ДокСводЗаявокНаДоставку.Ссылка
	|ГДЕ
	|	РаспределениеПоСводам.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Данные.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	Данные.СводЗаявок КАК СводЗаявок,
	|	Данные.Валюта КАК Валюта,
	|	Данные.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Данные.Дата КАК ДатаРегистратора,
	|	Данные.Номер КАК НомерРегистратора,
	|	Данные.Сумма КАК Сумма,
	|	Данные.Сумма КАК КОплате,
	|	Данные.Сумма КАК Оплачивается,
	|	Данные.Сумма КАК Выставлено
	|ИЗ
	|	Данные КАК Данные
	|ГДЕ
	|	Данные.ПроведеноБанком
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Данные.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Данные.АналитикаУчетаПоПартнерам,
	|	Данные.СводЗаявок,
	|	Данные.Валюта,
	|	Данные.ХозяйственнаяОперация,
	|	Данные.Дата,
	|	Данные.Номер,
	|	0,
	|	0,
	|	Данные.Сумма,
	|	0
	|ИЗ
	|	Данные КАК Данные");
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Источник.Ссылка,
		Источник.ДополнительныеСвойства, РежимПроведения);
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый",    Источник.ЭтоНовый());
	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	ЗаписатьДвиженияРасчетовПоУслугамЗаДоставку(Источник, ТаблицаДвижений);
	            
	Источник.Движения.Логс_РасчетыПоУслугамЗаДоставку.Записать();
	Источник.Движения.Логс_РасчетыПоУслугамЗаДоставку.Записывать = Ложь; // Избежание повторной записи регистра.
	
	МассивЗавимыхСводовЗаявок = ТаблицаДвижений.ВыгрузитьКолонку("СводЗаявок");
	
	Источник.ДополнительныеСвойства.Вставить("МассивЗависимыхСводовЗаявок", Новый ФиксированныйМассив(МассивЗавимыхСводовЗаявок));
	РегистрыСведений.Логс_СостоянияСводовЗаявокНаДоставку.ОтразитьСостояниеСводаЗаявокНаДоставку(Источник, Отказ);
	
КонецПроцедуры

Процедура ДвиженияРасчетовПоСводамЗаявокНаДоставкуПоступлениеБезналичныхДСПоFIFO(Источник, Отказ, РежимПроведения)
	
	ТаблицаДвижений = СоздатьТаблицуДвиженийРасчетыПоУслугамЗаДоставку();
	МассивЗавимыхСводовЗаявок = Новый Массив;
	
	Запрос = Новый Запрос(ТекстЗапросаСводыЗаявокОплачиваемыеКлиентом());
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("Период", Источник.Дата);
	Запрос.УстановитьПараметр("ПериодГраница", Новый Граница(Источник.МоментВремени(), ВидГраницы.Исключая));
	
	ВыборкаАналитика = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаАналитика.Следующий() Цикл
		ВыборкаВалюта = ВыборкаАналитика.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВалюта.Следующий() Цикл
			
			Если ВыборкаВалюта.Сумма <= 0 Тогда
				// Нет положительного общего остатка по сводам. Закрывать нечего.
				Продолжить;
			КонецЕсли; 
			
			ТаблицаСводов = СоздатьТаблицуСводовЗаявокОплачиваемыхКлиентом();
			
			СуммаПлатежа = ВыборкаВалюта.СуммаПлатежа;
			
			// Заполним таблицу сводов, по которым есть остатки, чтобы потом "раскрутить"
			// её в обратном порядке для корректного зачёта отрицательных сумм.
			Выборка = ВыборкаВалюта.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрокаСвода = ТаблицаСводов.Добавить();
				СтрокаСвода.Период = Выборка.Период;
				СтрокаСвода.ДатаРегистратора = Выборка.ДатаРегистратора;
				СтрокаСвода.НомерРегистратора = Выборка.НомерРегистратора;
				СтрокаСвода.ХозяйственнаяОперация = Выборка.ХозяйственнаяОперация;
				СтрокаСвода.СводЗаявок = Выборка.СводЗаявок;
				СтрокаСвода.Сумма = Выборка.Сумма;
				СтрокаСвода.КОплате = Выборка.КОплате;
				СтрокаСвода.КВыставлению = Выборка.КВыставлению;
				СтрокаСвода.Выставлено = Выборка.Выставлено;
			КонецЦикла; 
			
			// В обратном порядке ищём свод, по которому возник отрацительный остаток.
			ТекОстаток = ВыборкаВалюта.Сумма;
			
			НомерПоследнейСтроки = ТаблицаСводов.Количество() - 1;
			Пока НомерПоследнейСтроки >= 0 Цикл
				СтрокаСвода = ТаблицаСводов[НомерПоследнейСтроки];
				
				ТекОстаток = ТекОстаток + СтрокаСвода.Сумма;
				Если ТекОстаток < 0 Тогда
					Прервать;
				КонецЕсли; 
				
				НомерПоследнейСтроки = НомерПоследнейСтроки - 1;
			КонецЦикла; 
			
			// Добавляем в движения все своды до того свода, по которому найден отрицательный остаток включительно.
			ТекОстаток = 0;
			
			Для НомерСтроки = 0 По НомерПоследнейСтроки Цикл
				СтрокаСвода = ТаблицаСводов[НомерСтроки];
				
				ДобавитьДвижениеРасчетыПоУслугамЗаДоставкуВТаблицу(ТаблицаДвижений, Источник, СтрокаСвода,
					ВыборкаВалюта.КлючАналитики, ВыборкаВалюта.Валюта, СтрокаСвода.Сумма);
				
				МассивЗавимыхСводовЗаявок.Добавить(СтрокаСвода.СводЗаявок);
				
				ТекОстаток = ТекОстаток + СтрокаСвода.Сумма;
			КонецЦикла;
			
			// Из оставшихся строк таблицы набираем своды на нужную сумму.
			Для НомерСтроки = НомерПоследнейСтроки + 1 По ТаблицаСводов.Количество() - 1 Цикл
				
				СтрокаСвода = ТаблицаСводов[НомерСтроки];
				
				МассивЗавимыхСводовЗаявок.Добавить(СтрокаСвода.СводЗаявок);
				
				Если ТекОстаток + СтрокаСвода.Сумма < СуммаПлатежа Тогда
					// Свод подходит в полном объёме.
					ДобавитьДвижениеРасчетыПоУслугамЗаДоставкуВТаблицу(ТаблицаДвижений, Источник, СтрокаСвода,
						ВыборкаВалюта.КлючАналитики, ВыборкаВалюта.Валюта, СтрокаСвода.Сумма);
				Иначе
					Сумма = СуммаПлатежа - ТекОстаток;
					ДобавитьДвижениеРасчетыПоУслугамЗаДоставкуВТаблицу(ТаблицаДвижений, Источник, СтрокаСвода,
						ВыборкаВалюта.КлючАналитики, ВыборкаВалюта.Валюта, Сумма);
						
					// Нужную сумму из сводов набрали.
					Прервать;
				КонецЕсли; 
				
				ТекОстаток = ТекОстаток + СтрокаСвода.Сумма;
				
			КонецЦикла;
			
		КонецЦикла; 
	КонецЦикла; 
	
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Источник.Ссылка,
		Источник.ДополнительныеСвойства, РежимПроведения);
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый",    Источник.ЭтоНовый());
	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	ЗаписатьДвиженияРасчетовПоУслугамЗаДоставку(Источник, ТаблицаДвижений);
	            
	Источник.Движения.Логс_РасчетыПоУслугамЗаДоставку.Записать();
	Источник.Движения.Логс_РасчетыПоУслугамЗаДоставку.Записывать = Ложь; // Избежание повторной записи регистра.
	
	Источник.ДополнительныеСвойства.Вставить("МассивЗависимыхСводовЗаявок", Новый ФиксированныйМассив(МассивЗавимыхСводовЗаявок));
	РегистрыСведений.Логс_СостоянияСводовЗаявокНаДоставку.ОтразитьСостояниеСводаЗаявокНаДоставку(Источник, Отказ);
	
КонецПроцедуры 

Процедура ДвиженияРасчетовПоСводамЗаявокНаДоставкуПоступлениеБезналичныхДС_20(Источник, Отказ, РежимПроведения)
	
	ТаблицаДвижений = СоздатьТаблицуДвиженийВзаиморасчетыПоУслугам100();

	Запрос = Новый Запрос(ТекстЗапросаСводыЗаявокОплачиваемыеКлиентом_20());
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("Период", Источник.Дата);
	Запрос.УстановитьПараметр("ПериодГраница", Новый Граница(Источник.МоментВремени(), ВидГраницы.Исключая));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Если Выборка.Долг = 0 Тогда
			Предоплата = Выборка.СуммаПлатежа;
			Долг = 0;
		ИначеЕсли Выборка.Долг >= Выборка.СуммаПлатежа Тогда
			Долг = Выборка.СуммаПлатежа;
			Предоплата = 0;
		Иначе
			Долг =  Выборка.Долг;
			Предоплата =  Выборка.СуммаПлатежа - Выборка.Долг;
		КонецЕсли;	
		
		Если Долг > 0 Тогда
			СтрокаДвижение = ТаблицаДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДвижение, Выборка);
			СтрокаДвижение.Долг = Долг;
		КонецЕсли;
		
		Если Предоплата > 0 Тогда
			СтрокаДвижение = ТаблицаДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДвижение, Выборка,,"ДатаПлановогоПогашения");
			СтрокаДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
			СтрокаДвижение.Долг = 0;
			СтрокаДвижение.Предоплата = Предоплата;
		КонецЕсли;			
		
	КонецЦикла; 
	
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Источник.Ссылка,
		Источник.ДополнительныеСвойства, РежимПроведения);
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый",    Источник.ЭтоНовый());
	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	ЗаписатьДвиженияВзаиморасчетыПоУслугам100(Источник, ТаблицаДвижений);
	            
	Источник.Движения.Логс_ВзаиморасчетыПоУслугам100.Записать();
	Источник.Движения.Логс_ВзаиморасчетыПоУслугам100.Записывать = Ложь; // Избежание повторной записи регистра.
	
КонецПроцедуры 

Процедура ДвиженияРасчетовПоСводамЗаявокНаДоставкуПКО_20(Источник, Отказ, РежимПроведения)
	
	ТаблицаДвижений = СоздатьТаблицуДвиженийВзаиморасчетыПоУслугам100();

	Запрос = Новый Запрос(ТекстЗапросаСводыЗаявокОплачиваемыеКлиентомПКО_20());
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("Период", Источник.Дата);
	Запрос.УстановитьПараметр("ПериодГраница", Новый Граница(Источник.МоментВремени(), ВидГраницы.Исключая));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
	
		Если Выборка.Долг = 0 Тогда
			Предоплата = Выборка.СуммаПлатежа;
			Долг = 0;
		ИначеЕсли Выборка.Долг >= Выборка.СуммаПлатежа Тогда
			Долг = Выборка.СуммаПлатежа;
			Предоплата = 0;
		Иначе
			Долг =  Выборка.Долг;
			Предоплата =  Выборка.СуммаПлатежа - Выборка.Долг;
		КонецЕсли;	
		
		Если Долг > 0 Тогда
			СтрокаДвижение = ТаблицаДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДвижение, Выборка);
			СтрокаДвижение.Долг = Долг;
		КонецЕсли;
		
		Если Предоплата > 0 Тогда
			СтрокаДвижение = ТаблицаДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДвижение, Выборка,,"ДатаПлановогоПогашения");
			СтрокаДвижение.ВидДвижения = ВидДвиженияНакопления.Приход;
			СтрокаДвижение.Долг = 0;
			СтрокаДвижение.Предоплата = Предоплата;
		КонецЕсли;			
		
	КонецЦикла; 
	
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Источник.Ссылка,
		Источник.ДополнительныеСвойства, РежимПроведения);
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый",    Источник.ЭтоНовый());
	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	ЗаписатьДвиженияВзаиморасчетыПоУслугам100(Источник, ТаблицаДвижений);
	            
	Источник.Движения.Логс_ВзаиморасчетыПоУслугам100.Записать();
	Источник.Движения.Логс_ВзаиморасчетыПоУслугам100.Записывать = Ложь; // Избежание повторной записи регистра.
	
КонецПроцедуры 

Процедура ДвиженияРасчетовПоСводамЗаявокНаДоставкуСписаниеЗадолженности_20(Источник, Отказ, РежимПроведения)
	
	ТаблицаДвижений = СоздатьТаблицуДвиженийВзаиморасчетыПоУслугам100();

	Запрос = Новый Запрос(ТекстЗапросаСводыЗаявокОплачиваемыеКлиентомСписаниеЗадолженности_20());
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("Период", Источник.Дата);
	Запрос.УстановитьПараметр("ПериодГраница", Новый Граница(Источник.МоментВремени(), ВидГраницы.Исключая));
	
	Рез = Запрос.ВыполнитьПакет();
	
	ТаблицаДвиженийСвод = Рез[7].Выгрузить();
	ЗаписатьДвиженияЗаявкиНаРасход100(Источник, ТаблицаДвиженийСвод);  
	
	ВыборкаАналитика = Рез[8].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаАналитика.Следующий() Цикл
			
		Выборка = ВыборкаАналитика.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтрокаДвижение = ТаблицаДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДвижение, Выборка);
			СтрокаДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;
			
		КонецЦикла;
	КонецЦикла;
	
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Источник.Ссылка,
		Источник.ДополнительныеСвойства, РежимПроведения);
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый",    Источник.ЭтоНовый());
	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	ЗаписатьДвиженияВзаиморасчетыПоУслугам100(Источник, ТаблицаДвижений);
	            
	Источник.Движения.Логс_ВзаиморасчетыПоУслугам100.Записать();
	Источник.Движения.Логс_ВзаиморасчетыПоУслугам100.Записывать = Ложь; // Избежание повторной записи регистра.
	
КонецПроцедуры 

Процедура ДвиженияРасчетовПоСводамЗаявокНаДоставкуВзаимозачетЗадолженности_20(Источник, Отказ, РежимПроведения)
	
	ТаблицаДвижений = СоздатьТаблицуДвиженийВзаиморасчетыПоУслугам100();

	Запрос = Новый Запрос(ТекстЗапросаСводыЗаявокОплачиваемыеКлиентомВзаимозачетЗадолженности_20());
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("Период", Источник.Дата);
	Запрос.УстановитьПараметр("ПериодГраница", Новый Граница(Источник.МоментВремени(), ВидГраницы.Исключая));
	
	Рез = Запрос.ВыполнитьПакет();
	
	ТаблицаДвиженийСвод = Рез[6].Выгрузить();
	ЗаписатьДвиженияЗаявкиНаРасход100(Источник, ТаблицаДвиженийСвод);  
	
	ВыборкаАналитика = Рез[7].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаАналитика.Следующий() Цикл
		
		СуммаОстатокПлатежа = ВыборкаАналитика.СуммаПлатежа; 		
			
		Выборка = ВыборкаАналитика.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			СтрокаДвижение = ТаблицаДвижений.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаДвижение, Выборка);
			СтрокаДвижение.ВидДвижения = ВидДвиженияНакопления.Расход;
			
		КонецЦикла;			
	КонецЦикла; 
	
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Источник.Ссылка,
		Источник.ДополнительныеСвойства, РежимПроведения);
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый",    Источник.ЭтоНовый());
	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	ЗаписатьДвиженияВзаиморасчетыПоУслугам100(Источник, ТаблицаДвижений);
	            
	Источник.Движения.Логс_ВзаиморасчетыПоУслугам100.Записать();
	Источник.Движения.Логс_ВзаиморасчетыПоУслугам100.Записывать = Ложь; // Избежание повторной записи регистра.
	
КонецПроцедуры 

Процедура ДвиженияЛогс_ВзаиморасчетыЗаВычетомЗаявкаНаРасходованиеДС(Источник, Отказ, РежимПроведения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Аналитика.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок КАК СводЗаявок,
	|	ДокСводЗаявокНаДоставку.Валюта КАК Валюта,
	|	РаспределениеПоСводамЗаявокНаДоставку.Сумма КАК СуммаНаложенногоПлатежа,
	|	0 КАК СуммаКОплате,
	|	0 КАК СуммаВозврата,
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок КАК КоррСводЗаявок
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставкуДвижения КАК РаспределениеПоСводамЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.Ссылка = ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК ДокСводЗаявокНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО ДокСводЗаявокНаДоставку.Партнер = Аналитика.Партнер
	|				И ДокСводЗаявокНаДоставку.Организация = Аналитика.Организация
	|				И ДокСводЗаявокНаДоставку.Контрагент = Аналитика.Контрагент
	|				И ДокСводЗаявокНаДоставку.Договор = Аналитика.Договор
	|				И (Аналитика.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок = ДокСводЗаявокНаДоставку.Ссылка
	|			И (РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом))
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка = &Ссылка
	|	И ЗаявкаНаРасходованиеДенежныхСредств.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена)
	|	И ЗаявкаНаРасходованиеДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику)
	|	И НЕ РаспределениеПоСводамЗаявокНаДоставку.ЭтоВозврат
	|	И РаспределениеПоСводамЗаявокНаДоставку.Сумма > 0 // костыль на переходный период
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход),
	|	Аналитика.КлючАналитики,
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок,
	|	ДокСводЗаявокНаДоставку.Валюта,
	|	0,
	|	РаспределениеПоСводамЗаявокНаДоставку.Сумма,
	|	0,
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставкуДвижения КАК РаспределениеПоСводамЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.Ссылка = ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК ДокСводЗаявокНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО ДокСводЗаявокНаДоставку.Партнер = Аналитика.Партнер
	|				И ДокСводЗаявокНаДоставку.Организация = Аналитика.Организация
	|				И ДокСводЗаявокНаДоставку.Контрагент = Аналитика.Контрагент
	|				И ДокСводЗаявокНаДоставку.Договор = Аналитика.Договор
	|				И (Аналитика.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок = ДокСводЗаявокНаДоставку.Ссылка
	|			И (РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом))
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка = &Ссылка
	|	И ЗаявкаНаРасходованиеДенежныхСредств.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена)
	|	И ЗаявкаНаРасходованиеДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику)
	|	И НЕ РаспределениеПоСводамЗаявокНаДоставку.ЭтоВозврат
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	Аналитика.КлючАналитики,
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок,
	|	ДокСводЗаявокНаДоставку.Валюта,
	|	0,
	|	0,
	|	РаспределениеПоСводамЗаявокНаДоставку.Сумма,
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок
	|ИЗ
	|	Документ.ЗаявкаНаРасходованиеДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставкуДвижения КАК РаспределениеПоСводамЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.Ссылка = ЗаявкаНаРасходованиеДенежныхСредств.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК ДокСводЗаявокНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО ДокСводЗаявокНаДоставку.Партнер = Аналитика.Партнер
	|				И ДокСводЗаявокНаДоставку.Организация = Аналитика.Организация
	|				И ДокСводЗаявокНаДоставку.Контрагент = Аналитика.Контрагент
	|				И ДокСводЗаявокНаДоставку.Договор = Аналитика.Договор
	|				И (Аналитика.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок = ДокСводЗаявокНаДоставку.Ссылка
	|			И (РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом))
	|ГДЕ
	|	ЗаявкаНаРасходованиеДенежныхСредств.Ссылка = &Ссылка
	|	И ЗаявкаНаРасходованиеДенежныхСредств.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена)
	|	И ЗаявкаНаРасходованиеДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратОплатыКлиенту)
	|	И РаспределениеПоСводамЗаявокНаДоставку.ЭтоВозврат");
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	Движения = Источник.Движения.Логс_ВзаиморасчетыЗаВычетом;
	
	ПроведениеСерверУТ.ЗаполнитьДополнительныеСвойстваНабораПоДокументу(Источник, Движения);
	
	Движения.Записывать = Истина;
	Движения.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры

Процедура ДвиженияЛогс_ВзаиморасчетыЗаВычетомПоступлениеБезналичныхДС(Источник, Отказ, РежимПроведения)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ПоступлениеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок КАК СводЗаявок,
	|	ПоступлениеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.Сумма КАК СуммаПоступления,
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	ПоступлениеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.Ссылка.Валюта КАК Валюта,
	|	ПоступлениеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.Ссылка.Дата КАК Дата
	|ПОМЕСТИТЬ РасшифровкаПлатежа
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК ПоступлениеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|		ПО ПоступлениеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок.Организация = АналитикаУчетаПоПартнерам.Организация
	|			И ПоступлениеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
	|			И ПоступлениеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок.Партнер = АналитикаУчетаПоПартнерам.Партнер
	|			И ПоступлениеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок.Договор = АналитикаУчетаПоПартнерам.Договор
	|			И ПоступлениеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.Ссылка.НаправлениеДеятельности = АналитикаУчетаПоПартнерам.НаправлениеДеятельности
	|ГДЕ
	|	ПоступлениеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом)
	|	И ПоступлениеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасшифровкаПлатежа.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	РасшифровкаПлатежа.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасшифровкаПлатежа.СводЗаявок КАК СводЗаявок,
	|	РасшифровкаПлатежа.СводЗаявок КАК КоррСводЗаявок,
	|	РасшифровкаПлатежа.Валюта КАК Валюта,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаУслугОстаток, 0) <= РасшифровкаПлатежа.СуммаПоступления
	|			ТОГДА РасшифровкаПлатежа.СуммаПоступления
	|		ИНАЧЕ ЕСТЬNULL(Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаУслугОстаток, 0)
	|	КОНЕЦ КАК СуммаУслуг,
	|	0 КАК СуммаКОплате
	|ИЗ
	|	РасшифровкаПлатежа КАК РасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Логс_ВзаиморасчетыЗаВычетом.Остатки(&Период, ) КАК Логс_ВзаиморасчетыЗаВычетомОстатки
	|		ПО РасшифровкаПлатежа.СводЗаявок = Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок
	|			И РасшифровкаПлатежа.АналитикаУчетаПоПартнерам = Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам
	|ГДЕ
	|	РасшифровкаПлатежа.СуммаПоступления >= ЕСТЬNULL(Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаУслугОстаток, 0)
	|	И ВЫБОР
	|			КОГДА ЕСТЬNULL(Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаУслугОстаток, 0) <= РасшифровкаПлатежа.СуммаПоступления
	|				ТОГДА РасшифровкаПлатежа.СуммаПоступления
	|			ИНАЧЕ ЕСТЬNULL(Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаУслугОстаток, 0)
	|		КОНЕЦ <> 0
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РасшифровкаПлатежа.Дата,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	РасшифровкаПлатежа.АналитикаУчетаПоПартнерам,
	|	РасшифровкаПлатежа.СводЗаявок,
	|	РасшифровкаПлатежа.СводЗаявок,
	|	РасшифровкаПлатежа.Валюта,
	|	0,
	|	РасшифровкаПлатежа.СуммаПоступления - ЕСТЬNULL(Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаУслугОстаток, 0)
	|ИЗ
	|	РасшифровкаПлатежа КАК РасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Логс_ВзаиморасчетыЗаВычетом.Остатки(&Период, ) КАК Логс_ВзаиморасчетыЗаВычетомОстатки
	|		ПО РасшифровкаПлатежа.СводЗаявок = Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок
	|			И РасшифровкаПлатежа.АналитикаУчетаПоПартнерам = Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам
	|ГДЕ
	|	ЕСТЬNULL(Логс_ВзаиморасчетыЗаВычетомОстатки.СуммаУслугОстаток, 0) - РасшифровкаПлатежа.СуммаПоступления > 0");
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("Период", Источник.Дата);
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения = Источник.Движения.Логс_ВзаиморасчетыЗаВычетом;
	
	ПроведениеСерверУТ.ЗаполнитьДополнительныеСвойстваНабораПоДокументу(Источник, Движения);
	
	Движения.Записывать = Истина;
	Движения.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры

Процедура ДвиженияЛогс_ВзаиморасчетыЗаВычетомСписаниеБезналичныхДС(Источник, Отказ, РежимПроведения)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	СписаниеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок КАК СводЗаявок,
	|	СписаниеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.Сумма КАК СуммаСписания,
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	СписаниеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.Ссылка.Валюта КАК Валюта,
	|	СписаниеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.Ссылка.Дата КАК Дата
	|ПОМЕСТИТЬ РасшифровкаПлатежа
	|ИЗ
	|	Документ.СписаниеБезналичныхДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК СписаниеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|		ПО СписаниеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок.Организация = АналитикаУчетаПоПартнерам.Организация
	|			И СписаниеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
	|			И СписаниеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок.Партнер = АналитикаУчетаПоПартнерам.Партнер
	|			И СписаниеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок.Договор = АналитикаУчетаПоПартнерам.Договор
	|			И СписаниеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.Ссылка.НаправлениеДеятельности = АналитикаУчетаПоПартнерам.НаправлениеДеятельности
	|ГДЕ
	|	СписаниеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом)
	|	И СписаниеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.Ссылка = &Ссылка  и СписаниеБезналичныхДенежныхСредствЛогс_РаспределениеПоСводамЗаявокНаДоставку.Ссылка.ПроведеноБанком
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасшифровкаПлатежа.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	РасшифровкаПлатежа.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам,
	|	РасшифровкаПлатежа.СводЗаявок КАК СводЗаявок,
	|	РасшифровкаПлатежа.СводЗаявок КАК КоррСводЗаявок,
	|	РасшифровкаПлатежа.Валюта КАК Валюта,
	|	0 КАК СуммаУслуг,
	|	0 КАК СуммаНаложенногоПлатежа,
	|	РасшифровкаПлатежа.СуммаСписания КАК СуммаКОплате
	|ИЗ
	|	РасшифровкаПлатежа КАК РасшифровкаПлатежа
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Логс_ВзаиморасчетыЗаВычетом.Остатки(&Период, ) КАК Логс_ВзаиморасчетыЗаВычетомОстатки
	|		ПО РасшифровкаПлатежа.СводЗаявок = Логс_ВзаиморасчетыЗаВычетомОстатки.СводЗаявок
	|			И РасшифровкаПлатежа.АналитикаУчетаПоПартнерам = Логс_ВзаиморасчетыЗаВычетомОстатки.АналитикаУчетаПоПартнерам");
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("Период", Источник.Дата);
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения = Источник.Движения.Логс_ВзаиморасчетыЗаВычетом;
	
	ПроведениеСерверУТ.ЗаполнитьДополнительныеСвойстваНабораПоДокументу(Источник, Движения);
	
	Движения.Записывать = Истина;
	Движения.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры

Процедура ДвиженияЛогс_ВзаиморасчетыЗаВычетомРасходныйКассовыйОрдер(Источник, Отказ, РежимПроведения)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	РасходныйКассовыйОрдер.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Аналитика.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок КАК СводЗаявок,
	|	РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок КАК КоррСводЗаявок,
	|	ДокСводЗаявокНаДоставку.Валюта КАК Валюта,
	|	0 КАК СуммаУслуг,
	|	0 КАК СуммаНаложенногоПлатежа,
	|	РаспределениеПоСводамЗаявокНаДоставку.Сумма КАК СуммаКОплате
	|ИЗ
	|	Документ.РасходныйКассовыйОрдер.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК РаспределениеПоСводамЗаявокНаДоставку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РасходныйКассовыйОрдер КАК РасходныйКассовыйОрдер
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.Ссылка = РасходныйКассовыйОрдер.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК ДокСводЗаявокНаДоставку
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК Аналитика
	|			ПО ДокСводЗаявокНаДоставку.Партнер = Аналитика.Партнер
	|				И ДокСводЗаявокНаДоставку.Организация = Аналитика.Организация
	|				И ДокСводЗаявокНаДоставку.Контрагент = Аналитика.Контрагент
	|				И ДокСводЗаявокНаДоставку.Договор = Аналитика.Договор
	|				И (Аналитика.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ПО РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок = ДокСводЗаявокНаДоставку.Ссылка
	|ГДЕ
	|	РасходныйКассовыйОрдер.Ссылка = &Ссылка
	|	И РаспределениеПоСводамЗаявокНаДоставку.СводЗаявок.ФормаОплаты = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом)
	|	И РасходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаПоставщику)");
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения = Источник.Движения.Логс_ВзаиморасчетыЗаВычетом;
	
	ПроведениеСерверУТ.ЗаполнитьДополнительныеСвойстваНабораПоДокументу(Источник, Движения);
	
	Движения.Записывать = Истина;
	Движения.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры

Процедура ДвиженияЛогс_ВзаиморасчетыЗаВычетомСписаниеЗадолженности(Источник, Отказ, РежимПроведения)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РегистрАналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблРасшифровкаПлатежа.Ссылка.Дата КАК Период,
	|	СписаниеЗадолженностиСводы.Свод КАК СводЗаявок,
	|	СписаниеЗадолженностиСводы.Свод.Валюта КАК Валюта,
	|	СписаниеЗадолженностиСводы.Сумма КАК СуммаУслуг,
	|	0 КАК СуммаНаложенногоПлатежа,
	|	0 КАК СуммаКОплате,
	|	СписаниеЗадолженностиСводы.Свод КАК КоррСводЗаявок
	|ИЗ
	|	Документ.СписаниеЗадолженности.Задолженность КАК ТаблРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеЗадолженности.Своды КАК СписаниеЗадолженностиСводы
	|		ПО ТаблРасшифровкаПлатежа.Ссылка = СписаниеЗадолженностиСводы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИсторияФормыОплатыДоговоров.СрезПоследних(&Период, ) КАК Логс_ИсторияФормыОплатыДоговоровСрезПоследних
	|		ПО ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор = Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ДоговорКонтрагентов
	|			И (Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|		ПО ТаблРасшифровкаПлатежа.Ссылка.Организация = РегистрАналитикаУчетаПоПартнерам.Организация
	|			И ТаблРасшифровкаПлатежа.Партнер = РегистрАналитикаУчетаПоПартнерам.Партнер
	|			И ТаблРасшифровкаПлатежа.Ссылка.Контрагент = РегистрАналитикаУчетаПоПартнерам.Контрагент
	|			И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор = РегистрАналитикаУчетаПоПартнерам.Договор
	|			И (ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) = РегистрАналитикаУчетаПоПартнерам.НаправлениеДеятельности)
	|ГДЕ
	|	ТаблРасшифровкаПлатежа.Ссылка = &Ссылка
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор.Логс_ВидКлиентаCRM <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.ПустаяСсылка)
	|	И ТаблРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегистрАналитикаУчетаПоПартнерам.КлючАналитики,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблРасшифровкаПлатежа.Ссылка.Дата,
	|	СписаниеЗадолженностиСводы.Свод,
	|	СписаниеЗадолженностиСводы.Свод.Валюта,
	|	0,
	|	СписаниеЗадолженностиСводы.Сумма,
	|	СписаниеЗадолженностиСводы.Сумма,
	|	СписаниеЗадолженностиСводы.Свод
	|ИЗ
	|	Документ.СписаниеЗадолженности.Задолженность КАК ТаблРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.СписаниеЗадолженности.Своды КАК СписаниеЗадолженностиСводы
	|		ПО ТаблРасшифровкаПлатежа.Ссылка = СписаниеЗадолженностиСводы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИсторияФормыОплатыДоговоров.СрезПоследних(&Период, ) КАК Логс_ИсторияФормыОплатыДоговоровСрезПоследних
	|		ПО ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор = Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ДоговорКонтрагентов
	|			И (Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|		ПО ТаблРасшифровкаПлатежа.Ссылка.Организация = РегистрАналитикаУчетаПоПартнерам.Организация
	|			И ТаблРасшифровкаПлатежа.Партнер = РегистрАналитикаУчетаПоПартнерам.Партнер
	|			И ТаблРасшифровкаПлатежа.Ссылка.Контрагент = РегистрАналитикаУчетаПоПартнерам.Контрагент
	|			И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор = РегистрАналитикаУчетаПоПартнерам.Договор
	|			И (ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) = РегистрАналитикаУчетаПоПартнерам.НаправлениеДеятельности)
	|ГДЕ
	|	ТаблРасшифровкаПлатежа.Ссылка = &Ссылка
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор.Логс_ВидКлиентаCRM <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.ПустаяСсылка)
	|	И ТаблРасшифровкаПлатежа.Ссылка.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности)");
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("Период", Источник.Дата);
	
	Движения = Источник.Движения.Логс_ВзаиморасчетыЗаВычетом;
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Источник.Ссылка,
		Источник.ДополнительныеСвойства, РежимПроведения);
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый",    Источник.ЭтоНовый());
	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	Движения.Загрузить(ТаблицаДвижений);
	
	Движения.Записать();
	Движения.Записывать = Ложь; // Избежание повторной записи регистра.
	
КонецПроцедуры 

Процедура ДвиженияЛогс_ВзаиморасчетыЗаВычетомВзаимозачетЗадолженности(Источник, Отказ, РежимПроведения)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	РегистрАналитикаУчетаПоПартнерам.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблРасшифровкаПлатежа.Ссылка.Дата КАК Период,
	|	СписаниеЗадолженностиСводы.Свод КАК СводЗаявок,
	|	СписаниеЗадолженностиСводы.Свод.Валюта КАК Валюта,
	|	СписаниеЗадолженностиСводы.Сумма КАК СуммаУслуг,
	|	0 КАК СуммаНаложенногоПлатежа,
	|	0 КАК СуммаКОплате,
	|	СписаниеЗадолженностиСводы.Свод КАК КоррСводЗаявок
	|ИЗ
	|	Документ.ВзаимозачетЗадолженности.ДебиторскаяЗадолженность КАК ТаблРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВзаимозачетЗадолженности.СводыДебет КАК СписаниеЗадолженностиСводы
	|		ПО ТаблРасшифровкаПлатежа.Ссылка = СписаниеЗадолженностиСводы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИсторияФормыОплатыДоговоров.СрезПоследних(&Период, ) КАК Логс_ИсторияФормыОплатыДоговоровСрезПоследних
	|		ПО ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор = Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ДоговорКонтрагентов
	|			И (Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|		ПО ТаблРасшифровкаПлатежа.Ссылка.Организация = РегистрАналитикаУчетаПоПартнерам.Организация
	|			И ТаблРасшифровкаПлатежа.Партнер = РегистрАналитикаУчетаПоПартнерам.Партнер
	|			И ТаблРасшифровкаПлатежа.Ссылка.КонтрагентДебитор = РегистрАналитикаУчетаПоПартнерам.Контрагент
	|			И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор = РегистрАналитикаУчетаПоПартнерам.Договор
	|			И (ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) = РегистрАналитикаУчетаПоПартнерам.НаправлениеДеятельности)
	|ГДЕ
	|	ТаблРасшифровкаПлатежа.Ссылка = &Ссылка
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор.Логс_ВидКлиентаCRM <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.ПустаяСсылка)
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РегистрАналитикаУчетаПоПартнерам.КлючАналитики,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход),
	|	ТаблРасшифровкаПлатежа.Ссылка.Дата,
	|	СписаниеЗадолженностиСводы.Свод,
	|	СписаниеЗадолженностиСводы.Свод.Валюта,
	|	0,
	|	СписаниеЗадолженностиСводы.Сумма,
	|	СписаниеЗадолженностиСводы.Сумма,
	|	СписаниеЗадолженностиСводы.Свод
	|ИЗ
	|	Документ.ВзаимозачетЗадолженности.КредиторскаяЗадолженность КАК ТаблРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВзаимозачетЗадолженности.СводыКредит КАК СписаниеЗадолженностиСводы
	|		ПО ТаблРасшифровкаПлатежа.Ссылка = СписаниеЗадолженностиСводы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИсторияФормыОплатыДоговоров.СрезПоследних(&Период, ) КАК Логс_ИсторияФормыОплатыДоговоровСрезПоследних
	|		ПО ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор = Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ДоговорКонтрагентов
	|			И (Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.ОплатаЗаВычетом))
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК РегистрАналитикаУчетаПоПартнерам
	|		ПО ТаблРасшифровкаПлатежа.Ссылка.Организация = РегистрАналитикаУчетаПоПартнерам.Организация
	|			И ТаблРасшифровкаПлатежа.Партнер = РегистрАналитикаУчетаПоПартнерам.Партнер
	|			И ТаблРасшифровкаПлатежа.Ссылка.КонтрагентКредитор = РегистрАналитикаУчетаПоПартнерам.Контрагент
	|			И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор = РегистрАналитикаУчетаПоПартнерам.Договор
	|			И (ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка) = РегистрАналитикаУчетаПоПартнерам.НаправлениеДеятельности)
	|ГДЕ
	|	ТаблРасшифровкаПлатежа.Ссылка = &Ссылка
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор.Логс_ВидКлиентаCRM <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.ПустаяСсылка)");
	
	Запрос.УстановитьПараметр("Ссылка", Источник.Ссылка);
	Запрос.УстановитьПараметр("Период", Источник.Дата);
	
	Движения = Источник.Движения.Логс_ВзаиморасчетыЗаВычетом;
	
	ТаблицаДвижений = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ПроведениеСерверУТ.ИнициализироватьДополнительныеСвойстваДляПроведения(Источник.Ссылка,
		Источник.ДополнительныеСвойства, РежимПроведения);
	
	Источник.ДополнительныеСвойства.Вставить("ЭтоНовый",    Источник.ЭтоНовый());
	Источник.ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписиДокумента.Проведение);
	
	Движения.Загрузить(ТаблицаДвижений);
	
	Движения.Записать();
	Движения.Записывать = Ложь; // Избежание повторной записи регистра.
	
КонецПроцедуры 

Функция ПолучитьПоследнийСчет()
	
	Счет = "";
	Возврат Счет;
	
КонецФункции

Функция ТекстЗапросаСводыЗаявокОплачиваемыеКлиентом()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблРасшифровкаПлатежа.Партнер КАК Партнер,
	|	ПоступлениеБезналичныхДенежныхСредств.Организация КАК Организация,
	|	ПоступлениеБезналичныхДенежныхСредств.Контрагент КАК Контрагент,
	|	ПоступлениеБезналичныхДенежныхСредств.Дата КАК Дата,
	|	ПоступлениеБезналичныхДенежныхСредств.Номер КАК Номер,
	|	ПоступлениеБезналичныхДенежныхСредств.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор КАК Договор,
	|	ПоступлениеБезналичныхДенежныхСредств.Валюта КАК Валюта,
	|	СУММА(ТаблРасшифровкаПлатежа.Сумма) КАК Сумма
	|ПОМЕСТИТЬ РасшифровкаПлатежа
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ТаблРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
	|		ПО ТаблРасшифровкаПлатежа.Ссылка = ПоступлениеБезналичныхДенежныхСредств.Ссылка
	|ГДЕ
	|	ТаблРасшифровкаПлатежа.Ссылка = &Ссылка
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
	|	И ПоступлениеБезналичныхДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблРасшифровкаПлатежа.Партнер,
	|	ПоступлениеБезналичныхДенежныхСредств.Организация,
	|	ПоступлениеБезналичныхДенежныхСредств.Контрагент,
	|	ПоступлениеБезналичныхДенежныхСредств.Дата,
	|	ПоступлениеБезналичныхДенежныхСредств.Номер,
	|	ПоступлениеБезналичныхДенежныхСредств.ХозяйственнаяОперация,
	|	ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор,
	|	ПоступлениеБезналичныхДенежныхСредств.Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики,
	|	РасшифровкаПлатежа.Дата КАК Дата,
	|	РасшифровкаПлатежа.Номер КАК Номер,
	|	РасшифровкаПлатежа.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	РасшифровкаПлатежа.Валюта КАК Валюта,
	|	РасшифровкаПлатежа.Сумма КАК Сумма
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	РасшифровкаПлатежа КАК РасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|		ПО РасшифровкаПлатежа.Партнер = АналитикаУчетаПоПартнерам.Партнер
	|			И РасшифровкаПлатежа.Организация = АналитикаУчетаПоПартнерам.Организация
	|			И РасшифровкаПлатежа.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
	|			И РасшифровкаПлатежа.Договор = АналитикаУчетаПоПартнерам.Договор
	|			И (АналитикаУчетаПоПартнерам.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючАналитики,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РасшифровкаПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Дата КАК Период,
	|	Данные.Дата КАК ДатаРегистратора,
	|	Данные.Номер КАК НомерРегистратора,
	|	Данные.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Данные.КлючАналитики КАК КлючАналитики,
	|	Данные.Валюта КАК Валюта,
	|	Данные.Сумма КАК СуммаПлатежа,
	|	РасчетыПоУслугамЗаДоставкуОстатки.СводЗаявок КАК СводЗаявок,
	|	РасчетыПоУслугамЗаДоставкуОстатки.СуммаОстаток КАК Сумма,
	|	РасчетыПоУслугамЗаДоставкуОстатки.КОплатеОстаток КАК КОплате,
	|	РасчетыПоУслугамЗаДоставкуОстатки.КВыставлениюОстаток КАК КВыставлению,
	|	РасчетыПоУслугамЗаДоставкуОстатки.ВыставленоОстаток КАК Выставлено
	|ИЗ
	|	Данные КАК Данные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.Логс_РасчетыПоУслугамЗаДоставку.Остатки(
	|				&ПериодГраница,
	|				(АналитикаУчетаПоПартнерам, Валюта) В
	|					(ВЫБРАТЬ
	|						Данные.КлючАналитики,
	|						Данные.Валюта
	|					ИЗ
	|						Данные)) КАК РасчетыПоУслугамЗаДоставкуОстатки
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК СводЗаявокНаДоставку
	|			ПО РасчетыПоУслугамЗаДоставкуОстатки.СводЗаявок = СводЗаявокНаДоставку.Ссылка
	|		ПО Данные.КлючАналитики = РасчетыПоУслугамЗаДоставкуОстатки.АналитикаУчетаПоПартнерам
	|			И Данные.Валюта = РасчетыПоУслугамЗаДоставкуОстатки.Валюта
	|ГДЕ
	|	РасчетыПоУслугамЗаДоставкуОстатки.СуммаОстаток <> 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	СводЗаявокНаДоставку.МоментВремени
	|ИТОГИ
	|	МАКСИМУМ(СуммаПлатежа),
	|	СУММА(Сумма)
	|ПО
	|	КлючАналитики,
	|	Валюта";
	
	Возврат ТекстЗапроса;
	
КонецФункции 

Функция СоздатьТаблицуДвиженийРасчетыПоУслугамЗаДоставку()
	
	ТаблицаДвижений = Новый ТаблицаЗначений;
	ТаблицаДвижений.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаДвижений.Колонки.Добавить("ВидДвижения", Новый ОписаниеТипов("ВидДвиженияНакопления"));
	ТаблицаДвижений.Колонки.Добавить("АналитикаУчетаПоПартнерам", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаПоПартнерам"));
	ТаблицаДвижений.Колонки.Добавить("СводЗаявок", Новый ОписаниеТипов("ДокументСсылка.Логс_СводЗаявокНаДоставку"));
	ТаблицаДвижений.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаДвижений.Колонки.Добавить("ДатаПлатежа", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаДвижений.Колонки.Добавить("ДатаРегистратора", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаДвижений.Колонки.Добавить("НомерРегистратора", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ТаблицаДвижений.Колонки.Добавить("ХозяйственнаяОперация", Новый ОписаниеТипов("ПеречислениеСсылка.ХозяйственныеОперации"));
	ТаблицаДвижений.Колонки.Добавить("ИсключатьПриКонтроле", Новый ОписаниеТипов("Булево"));
	ТаблицаДвижений.Колонки.Добавить("Сумма", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ТаблицаДвижений.Колонки.Добавить("КОплате", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ТаблицаДвижений.Колонки.Добавить("Оплачивается", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ТаблицаДвижений.Колонки.Добавить("КВыставлению", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ТаблицаДвижений.Колонки.Добавить("Выставлено", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	Возврат ТаблицаДвижений;
	
КонецФункции 

Функция СоздатьТаблицуДвиженийВзаиморасчетыПоУслугам100()
	
	ТаблицаДвижений = Новый ТаблицаЗначений;
	ТаблицаДвижений.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаДвижений.Колонки.Добавить("ВидДвижения", Новый ОписаниеТипов("ВидДвиженияНакопления"));
	ТаблицаДвижений.Колонки.Добавить("АналитикаУчетаПоПартнерам", Новый ОписаниеТипов("СправочникСсылка.КлючиАналитикиУчетаПоПартнерам"));
	ТаблицаДвижений.Колонки.Добавить("Счет", Новый ОписаниеТипов("ДокументСсылка.СчетНаОплатуКлиенту"));
	ТаблицаДвижений.Колонки.Добавить("Валюта", Новый ОписаниеТипов("СправочникСсылка.Валюты"));
	ТаблицаДвижений.Колонки.Добавить("ДатаПлановогоПогашения", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	ТаблицаДвижений.Колонки.Добавить("ХозяйственнаяОперация", Новый ОписаниеТипов("ПеречислениеСсылка.ХозяйственныеОперации"));
	ТаблицаДвижений.Колонки.Добавить("Долг", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	ТаблицаДвижений.Колонки.Добавить("Предоплата", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	Возврат ТаблицаДвижений;
	
КонецФункции 

Функция СоздатьТаблицуСводовЗаявокОплачиваемыхКлиентом()
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("Период", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Таблица.Колонки.Добавить("ДатаРегистратора", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя));
	Таблица.Колонки.Добавить("НомерРегистратора", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	Таблица.Колонки.Добавить("ХозяйственнаяОперация", Новый ОписаниеТипов("ПеречислениеСсылка.ХозяйственныеОперации"));
	Таблица.Колонки.Добавить("СводЗаявок", Новый ОписаниеТипов("ДокументСсылка.Логс_СводЗаявокНаДоставку"));
	Таблица.Колонки.Добавить("Сумма", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("КОплате", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("КВыставлению", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	Таблица.Колонки.Добавить("Выставлено", ОбщегоНазначения.ОписаниеТипаЧисло(15,2));
	
	Возврат Таблица;
	
КонецФункции 

Процедура ДобавитьДвижениеРасчетыПоУслугамЗаДоставкуВТаблицу(ТаблицаДвижений, Источник, СтрокаСвода, КлючАналитики, Валюта, Сумма)
	
	Если Источник.ПроведеноБанком Тогда
			
		Движение = ТаблицаДвижений.Добавить();
		Движение.Период = СтрокаСвода.Период;
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.АналитикаУчетаПоПартнерам = КлючАналитики;
		Движение.СводЗаявок = СтрокаСвода.СводЗаявок;
		Движение.Валюта = Валюта;
		Движение.ХозяйственнаяОперация = СтрокаСвода.ХозяйственнаяОперация;
		Движение.ДатаРегистратора = СтрокаСвода.ДатаРегистратора;
		Движение.НомерРегистратора = СтрокаСвода.НомерРегистратора;
		Движение.Сумма = Сумма;
		Движение.Оплачивается = Сумма;
		
		Если СтрокаСвода.Выставлено <> 0 Тогда
			// Был выставлен счёт.
			
			Если СтрокаСвода.Сумма = Сумма Тогда
				// Свод оплачен полностью. Так же полностью спишем остатки по счёту.
				// Например, свод был на 1000 руб, счёт выставили на 800, но оплатили полностью 1000.
				Выставлено = СтрокаСвода.Выставлено;
			Иначе
				Выставлено = Мин(СтрокаСвода.Выставлено, Сумма);
			КонецЕсли; 
			
			КВыставлению = Выставлено - Сумма; // Корректировка, если оплатили больше, чем сумма по счёту.
			
			Движение.КОплате = Выставлено;
			Движение.Выставлено = Выставлено;
			Движение.КВыставлению = КВыставлению;
			
		Иначе
			// Оплата без счёта.
			
			Движение.КВыставлению = -Сумма;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Движение = ТаблицаДвижений.Добавить();
	Движение.Период = СтрокаСвода.Период;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.АналитикаУчетаПоПартнерам = КлючАналитики;
	Движение.СводЗаявок = СтрокаСвода.СводЗаявок;
	Движение.Валюта = Валюта;
	Движение.ХозяйственнаяОперация = СтрокаСвода.ХозяйственнаяОперация;
	Движение.ДатаРегистратора = СтрокаСвода.ДатаРегистратора;
	Движение.НомерРегистратора = СтрокаСвода.НомерРегистратора;
	Движение.Сумма = 0;
	Движение.КОплате = 0;
	Движение.Оплачивается = Сумма;
	Движение.Выставлено = 0;
		
КонецПроцедуры 

Процедура ЗаписатьДвиженияРасчетовПоНаложеннымПлатежам(Источник, ТаблицаДвижений)
	
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения = Источник.Движения.Логс_РасчетыПоНаложеннымПлатежам;
	Движения.Загрузить(ТаблицаДвижений);
	Движения.Записывать = Истина;
	
КонецПроцедуры

Процедура ЗаписатьДвиженияЗаявкиНаРасход100(Источник, ТаблицаДвижений)
	
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения = Источник.Движения.Логс_ЗаявкиНаРасход100;
	Движения.Загрузить(ТаблицаДвижений);
	Движения.Записывать = Истина;
	
КонецПроцедуры

Процедура ЗаписатьДвиженияРасчетовПоУслугамЗаДоставку(Источник, ТаблицаДвижений)
	
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения = Источник.Движения.Логс_РасчетыПоУслугамЗаДоставку;
	
	ПроведениеСерверУТ.ЗаполнитьДополнительныеСвойстваНабораПоДокументу(Источник, Движения);
	
	ТипДокумента = ТипЗнч(Движения.Отбор.Регистратор.Значение);
	Если ТипДокумента <> Тип("ДокументСсылка.Логс_СводЗаявокНаДоставку") Тогда
		ДобавитьЗаполнитьПорядокРасчетовПоУслугамЗаДоставку(ТаблицаДвижений, ТипДокумента);
	КонецЕсли; 
	
	Движения.Записывать = Истина;
	Движения.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры

Процедура ЗаписатьДвиженияСчетаПоУслугам100(Источник, ТаблицаДвижений)
	
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения = Источник.Движения.Логс_СчетаПоУслугам100;
	
	ПроведениеСерверУТ.ЗаполнитьДополнительныеСвойстваНабораПоДокументу(Источник, Движения);
	
	Движения.Записывать = Истина;
	Движения.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры

Процедура ЗаписатьДвиженияВзаиморасчетыПоУслугам100(Источник, ТаблицаДвижений)
	
	Если ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения = Источник.Движения.Логс_ВзаиморасчетыПоУслугам100;
	
	ПроведениеСерверУТ.ЗаполнитьДополнительныеСвойстваНабораПоДокументу(Источник, Движения);
	
	Движения.Записывать = Истина;
	Движения.Загрузить(ТаблицаДвижений);
	
	РегВалюта = Константы.ВалютаРегламентированногоУчета.Получить();
	Для Каждого Строка из Движения Цикл
		Если Не ЗначениеЗаполнено(Строка.Валюта) Тогда
			Строка.Валюта = РегВалюта;
		КонецЕсли;		
	КонецЦикла;
	
КонецПроцедуры

Функция ТекстЗапросаСводыЗаявокОплачиваемыеКлиентом_20()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблРасшифровкаПлатежа.Партнер КАК Партнер,
	|	ПоступлениеБезналичныхДенежныхСредств.Организация КАК Организация,
	|	ПоступлениеБезналичныхДенежныхСредств.Контрагент КАК Контрагент,
	|	ПоступлениеБезналичныхДенежныхСредств.ДатаПроведенияБанком КАК Дата,
	|	ПоступлениеБезналичныхДенежныхСредств.Номер КАК Номер,
	|	ПоступлениеБезналичныхДенежныхСредств.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор КАК Договор,
	|	ТаблРасшифровкаПлатежа.Счет КАК Счет,
	|	ПоступлениеБезналичныхДенежныхСредств.Валюта КАК Валюта,
	|	СУММА(ТаблРасшифровкаПлатежа.Сумма) КАК Сумма,
	|	Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту КАК ФормаОплатыУслугАгенту
	|ПОМЕСТИТЬ РасшифровкаПлатежа
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа КАК ТаблРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
	|		ПО ТаблРасшифровкаПлатежа.Ссылка = ПоступлениеБезналичныхДенежныхСредств.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИсторияФормыОплатыДоговоров.СрезПоследних(&Период, ) КАК Логс_ИсторияФормыОплатыДоговоровСрезПоследних
	|		ПО ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор = Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ДоговорКонтрагентов
	|			И (Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.Оплата100))
	|ГДЕ
	|	ТаблРасшифровкаПлатежа.Ссылка = &Ссылка
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор.Логс_ВидКлиентаCRM <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.ПустаяСсылка)
	|	И (ПоступлениеБезналичныхДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
	|		ИлИ ПоступлениеБезналичныхДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика))
	|	И ПоступлениеБезналичныхДенежныхСредств.ПроведеноБанком
	|	И (ПоступлениеБезналичныхДенежныхСредств.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствОтПоставщика) или ТаблРасшифровкаПлатежа.Счет <> ЗНАЧЕНИЕ(Документ.СчетНаОплатуКлиенту.ПустаяСсылка) )
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблРасшифровкаПлатежа.Партнер,
	|	ПоступлениеБезналичныхДенежныхСредств.Организация,
	|	ПоступлениеБезналичныхДенежныхСредств.Контрагент,
	|	ПоступлениеБезналичныхДенежныхСредств.Номер,
	|	ПоступлениеБезналичныхДенежныхСредств.ХозяйственнаяОперация,
	|	ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор,
	|	ТаблРасшифровкаПлатежа.Счет,
	|	ПоступлениеБезналичныхДенежныхСредств.Валюта,
	|	ПоступлениеБезналичныхДенежныхСредств.ДатаПроведенияБанком,
	|	Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики,
	|	РасшифровкаПлатежа.ФормаОплатыУслугАгенту КАК ФормаОплаты,
	|	РасшифровкаПлатежа.Дата КАК Дата,
	|	РасшифровкаПлатежа.Номер КАК Номер,
	|	РасшифровкаПлатежа.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	РасшифровкаПлатежа.Валюта КАК Валюта,
	|	РасшифровкаПлатежа.Счет КАК Счет,
	|	РасшифровкаПлатежа.Сумма КАК Сумма
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	РасшифровкаПлатежа КАК РасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|		ПО РасшифровкаПлатежа.Партнер = АналитикаУчетаПоПартнерам.Партнер
	|			И РасшифровкаПлатежа.Организация = АналитикаУчетаПоПартнерам.Организация
	|			И РасшифровкаПлатежа.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
	|			И РасшифровкаПлатежа.Договор = АналитикаУчетаПоПартнерам.Договор
	|			И (АналитикаУчетаПоПартнерам.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РасшифровкаПлатежа.Договор = ДоговорыКонтрагентов.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючАналитики,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РасшифровкаПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Дата КАК Период,
	|	Данные.Дата КАК ДатаРегистратора,
	|	Данные.Номер КАК НомерРегистратора,
	|	Данные.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Данные.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	Данные.Валюта КАК Валюта,
	|	Данные.Сумма КАК СуммаПлатежа,
	|	Данные.ФормаОплаты КАК ФормаОплаты,
	|	ЕСТЬNULL(ВзаиморасчетыПоУслугам100Остатки.ДолгОстаток, 0) КАК Долг,
	|	Данные.Счет КАК Счет,
	|	ВзаиморасчетыПоУслугам100Остатки.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	|ИЗ
	|	Данные КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Логс_ВзаиморасчетыПоУслугам100.Остатки(
	|				&ПериодГраница,
	|				(АналитикаУчетаПоПартнерам, Валюта) В
	|					(ВЫБРАТЬ
	|						Данные.КлючАналитики,
	|						Данные.Валюта
	|					ИЗ
	|						Данные)) КАК ВзаиморасчетыПоУслугам100Остатки
	|		ПО Данные.КлючАналитики = ВзаиморасчетыПоУслугам100Остатки.АналитикаУчетаПоПартнерам
	|			И Данные.Валюта = ВзаиморасчетыПоУслугам100Остатки.Валюта
	|			И Данные.Счет = ВзаиморасчетыПоУслугам100Остатки.Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Данные.Счет.МоментВремени";
	
	Возврат ТекстЗапроса;
	
КонецФункции 

Функция ТекстЗапросаСводыЗаявокОплачиваемыеКлиентомПКО_20()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблРасшифровкаПлатежа.Партнер КАК Партнер,
	|	ПриходныйКассовыйОрдер.Организация КАК Организация,
	|	ПриходныйКассовыйОрдер.Контрагент КАК Контрагент,
	|	ПриходныйКассовыйОрдер.Дата КАК Дата,
	|	ПриходныйКассовыйОрдер.Номер КАК Номер,
	|	ПриходныйКассовыйОрдер.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор КАК Договор,
	|	ТаблРасшифровкаПлатежа.Счет КАК Счет,
	|	ПриходныйКассовыйОрдер.Валюта КАК Валюта,
	|	СУММА(ТаблРасшифровкаПлатежа.Сумма) КАК Сумма,
	|	Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту КАК ФормаОплатыУслугАгенту
	|ПОМЕСТИТЬ РасшифровкаПлатежа
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер.РасшифровкаПлатежа КАК ТаблРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|		ПО ТаблРасшифровкаПлатежа.Ссылка = ПриходныйКассовыйОрдер.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИсторияФормыОплатыДоговоров.СрезПоследних(&Период, ) КАК Логс_ИсторияФормыОплатыДоговоровСрезПоследних
	|		ПО ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор = Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ДоговорКонтрагентов
	|			И (Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.Оплата100))
	|ГДЕ
	|	ТаблРасшифровкаПлатежа.Ссылка = &Ссылка
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор.Логс_ВидКлиентаCRM <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.ПустаяСсылка)
	|	И ПриходныйКассовыйОрдер.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблРасшифровкаПлатежа.Партнер,
	|	ПриходныйКассовыйОрдер.Организация,
	|	ПриходныйКассовыйОрдер.Контрагент,
	|	ПриходныйКассовыйОрдер.Номер,
	|	ПриходныйКассовыйОрдер.ХозяйственнаяОперация,
	|	ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор,
	|	ТаблРасшифровкаПлатежа.Счет,
	|	ПриходныйКассовыйОрдер.Валюта,
	|	ПриходныйКассовыйОрдер.Дата,
	|	Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики,
	|	РасшифровкаПлатежа.ФормаОплатыУслугАгенту КАК ФормаОплаты,
	|	РасшифровкаПлатежа.Дата КАК Дата,
	|	РасшифровкаПлатежа.Номер КАК Номер,
	|	РасшифровкаПлатежа.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	РасшифровкаПлатежа.Валюта КАК Валюта,
	|	РасшифровкаПлатежа.Счет КАК Счет,
	|	РасшифровкаПлатежа.Сумма КАК Сумма
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	РасшифровкаПлатежа КАК РасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|		ПО РасшифровкаПлатежа.Партнер = АналитикаУчетаПоПартнерам.Партнер
	|			И РасшифровкаПлатежа.Организация = АналитикаУчетаПоПартнерам.Организация
	|			И РасшифровкаПлатежа.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
	|			И РасшифровкаПлатежа.Договор = АналитикаУчетаПоПартнерам.Договор
	|			И (АналитикаУчетаПоПартнерам.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РасшифровкаПлатежа.Договор = ДоговорыКонтрагентов.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючАналитики,
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РасшифровкаПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Дата КАК Период,
	|	Данные.Дата КАК ДатаРегистратора,
	|	Данные.Номер КАК НомерРегистратора,
	|	Данные.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Данные.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	Данные.Валюта КАК Валюта,
	|	Данные.Сумма КАК СуммаПлатежа,
	|	Данные.ФормаОплаты КАК ФормаОплаты,
	|	ЕСТЬNULL(ВзаиморасчетыПоУслугам100Остатки.ДолгОстаток, 0) КАК Долг,
	|	Данные.Счет КАК Счет,
	|	ВзаиморасчетыПоУслугам100Остатки.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения
	|ИЗ
	|	Данные КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Логс_ВзаиморасчетыПоУслугам100.Остатки(
	|				&ПериодГраница,
	|				(АналитикаУчетаПоПартнерам, Валюта) В
	|					(ВЫБРАТЬ
	|						Данные.КлючАналитики,
	|						Данные.Валюта
	|					ИЗ
	|						Данные)) КАК ВзаиморасчетыПоУслугам100Остатки
	|		ПО Данные.КлючАналитики = ВзаиморасчетыПоУслугам100Остатки.АналитикаУчетаПоПартнерам
	|			И Данные.Валюта = ВзаиморасчетыПоУслугам100Остатки.Валюта
	|			И Данные.Счет = ВзаиморасчетыПоУслугам100Остатки.Счет
	|
	|УПОРЯДОЧИТЬ ПО
	|	Данные.Счет.МоментВремени";
	
	Возврат ТекстЗапроса;
	
КонецФункции 

Функция ТекстЗапросаСводыЗаявокОплачиваемыеКлиентомСписаниеЗадолженности_20()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблРасшифровкаПлатежа.Партнер КАК Партнер,
	|	СписаниеЗадолженности.Организация КАК Организация,
	|	СписаниеЗадолженности.Контрагент КАК Контрагент,
	|	СписаниеЗадолженности.Дата КАК Дата,
	|	СписаниеЗадолженности.Номер КАК Номер,
	|	СписаниеЗадолженности.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор КАК Договор,
	|	СУММА(СписаниеЗадолженностиСчета.Сумма) КАК Сумма,
	|	СписаниеЗадолженностиСчета.Счет КАК Счет,
	|	Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту КАК ФормаОплатыУслугАгенту
	|ПОМЕСТИТЬ РасшифровкаПлатежа
	|ИЗ
	|	Документ.КорректировкаЗадолженности.Задолженность КАК ТаблРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаЗадолженности КАК СписаниеЗадолженности
	|		ПО ТаблРасшифровкаПлатежа.Ссылка = СписаниеЗадолженности.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаЗадолженности.Счета КАК СписаниеЗадолженностиСчета
	|		ПО ТаблРасшифровкаПлатежа.Ссылка = СписаниеЗадолженностиСчета.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИсторияФормыОплатыДоговоров.СрезПоследних(&Период, ) КАК Логс_ИсторияФормыОплатыДоговоровСрезПоследних
	|		ПО ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор = Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ДоговорКонтрагентов
	|			И (Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.Оплата100))
	|ГДЕ
	|	СписаниеЗадолженности.Ссылка = &Ссылка
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор.Логс_ВидКлиентаCRM <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.ПустаяСсылка)
	|	И СписаниеЗадолженности.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеДебиторскойЗадолженности)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблРасшифровкаПлатежа.Партнер,
	|	СписаниеЗадолженности.Организация,
	|	СписаниеЗадолженности.Контрагент,
	|	СписаниеЗадолженности.Номер,
	|	СписаниеЗадолженности.ХозяйственнаяОперация,
	|	ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор,
	|	СписаниеЗадолженности.Дата,
	|	СписаниеЗадолженностиСчета.Счет,
	|	Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписаниеЗадолженности.Дата КАК Дата,
	|	ТаблРасшифровкаПлатежа.Партнер КАК Партнер,
	|	СписаниеЗадолженности.Организация КАК Организация,
	|	СписаниеЗадолженности.Контрагент КАК Контрагент,
	|	ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор КАК Договор,
	|	СУММА(СписаниеЗадолженностиСводы.Сумма) КАК Сумма,
	|	СписаниеЗадолженностиСводы.Свод КАК СводЗаявок,
	|	ТаблРасшифровкаПлатежа.ВалютаВзаиморасчетов КАК Валюта
	|ПОМЕСТИТЬ РасшифровкаПлатежаСвод
	|ИЗ
	|	Документ.КорректировкаЗадолженности.Задолженность КАК ТаблРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаЗадолженности КАК СписаниеЗадолженности
	|		ПО ТаблРасшифровкаПлатежа.Ссылка = СписаниеЗадолженности.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.КорректировкаЗадолженности.Своды КАК СписаниеЗадолженностиСводы
	|		ПО ТаблРасшифровкаПлатежа.Ссылка = СписаниеЗадолженностиСводы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИсторияФормыОплатыДоговоров.СрезПоследних(&Период, ) КАК Логс_ИсторияФормыОплатыДоговоровСрезПоследних
	|		ПО ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор = Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ДоговорКонтрагентов
	|			И (Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.Оплата100))
	|ГДЕ
	|	СписаниеЗадолженностиСводы.Ссылка = &Ссылка
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор.Логс_ВидКлиентаCRM <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.ПустаяСсылка)
	|	И СписаниеЗадолженности.ХозяйственнаяОперация = ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.СписаниеКредиторскойЗадолженности)
	|
	|СГРУППИРОВАТЬ ПО
	|	СписаниеЗадолженности.Дата,
	|	ТаблРасшифровкаПлатежа.Партнер,
	|	СписаниеЗадолженности.Организация,
	|	СписаниеЗадолженности.Контрагент,
	|	ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор,
	|	СписаниеЗадолженностиСводы.Свод,
	|	ТаблРасшифровкаПлатежа.ВалютаВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СписаниеЗадолженностиСчета.Счет КАК Счет,
	|	МАКСИМУМ(ЕСТЬNULL(СчетНаОплатуКлиентуЭтапыГрафикаОплаты.ДатаПлатежа, СписаниеЗадолженностиСчета.Ссылка.Дата)) КАК ДатаПлановогоПогашения
	|ПОМЕСТИТЬ ДатыПлановогоПогашения
	|ИЗ
	|	Документ.КорректировкаЗадолженности.Счета КАК СписаниеЗадолженностиСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СчетНаОплатуКлиенту.ЭтапыГрафикаОплаты КАК СчетНаОплатуКлиентуЭтапыГрафикаОплаты
	|		ПО СписаниеЗадолженностиСчета.Счет = СчетНаОплатуКлиентуЭтапыГрафикаОплаты.Ссылка
	|ГДЕ
	|	СписаниеЗадолженностиСчета.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	СписаниеЗадолженностиСчета.Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасшифровкаПлатежа.Дата КАК Дата,
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики,
	|	РасшифровкаПлатежа.Сумма КАК Сумма,
	|	РасшифровкаПлатежа.СводЗаявок КАК СводЗаявок,
	|	РасшифровкаПлатежа.Валюта КАК Валюта
	|ПОМЕСТИТЬ ДанныеСвод
	|ИЗ
	|	РасшифровкаПлатежаСвод КАК РасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|		ПО РасшифровкаПлатежа.Партнер = АналитикаУчетаПоПартнерам.Партнер
	|			И РасшифровкаПлатежа.Организация = АналитикаУчетаПоПартнерам.Организация
	|			И РасшифровкаПлатежа.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
	|			И РасшифровкаПлатежа.Договор = АналитикаУчетаПоПартнерам.Договор
	|			И (АналитикаУчетаПоПартнерам.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РасшифровкаПлатежа.Договор = ДоговорыКонтрагентов.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючАналитики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики,
	|	РасшифровкаПлатежа.ФормаОплатыУслугАгенту КАК ФормаОплаты,
	|	РасшифровкаПлатежа.Дата КАК Дата,
	|	РасшифровкаПлатежа.Номер КАК Номер,
	|	РасшифровкаПлатежа.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	РасшифровкаПлатежа.Сумма КАК Сумма,
	|	РасшифровкаПлатежа.Счет КАК Счет,
	|	ДатыПлановогоПогашения.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	РасшифровкаПлатежа КАК РасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|		ПО РасшифровкаПлатежа.Партнер = АналитикаУчетаПоПартнерам.Партнер
	|			И РасшифровкаПлатежа.Организация = АналитикаУчетаПоПартнерам.Организация
	|			И РасшифровкаПлатежа.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
	|			И РасшифровкаПлатежа.Договор = АналитикаУчетаПоПартнерам.Договор
	|			И (АналитикаУчетаПоПартнерам.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РасшифровкаПлатежа.Договор = ДоговорыКонтрагентов.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДатыПлановогоПогашения КАК ДатыПлановогоПогашения
	|		ПО РасшифровкаПлатежа.Счет = ДатыПлановогоПогашения.Счет
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючАналитики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РасшифровкаПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РасшифровкаПлатежаСвод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Данные.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	Данные.Сумма КАК Сумма,
	|	Данные.СводЗаявок КАК СводЗаявок,
	|	Данные.Валюта КАК Валюта
	|ИЗ
	|	ДанныеСвод КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Дата КАК Период,
	|	Данные.Дата КАК ДатаРегистратора,
	|	Данные.Номер КАК НомерРегистратора,
	|	Данные.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Данные.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	Данные.Сумма КАК СуммаПлатежа,
	|	Данные.ФормаОплаты КАК ФормаОплаты,
	|	Данные.Сумма КАК Долг,
	|	Данные.ДатаПлановогоПогашения КАК ДатаПлановогоПогашения,
	|	Данные.Счет КАК Счет,
	|	Данные.Счет.Валюта КАК Валюта
	|ИЗ
	|	Данные КАК Данные
	|ИТОГИ
	|	МАКСИМУМ(СуммаПлатежа),
	|	СУММА(Долг)
	|ПО
	|	АналитикаУчетаПоПартнерам";
	
	Возврат ТекстЗапроса;
	
КонецФункции 

Функция ТекстЗапросаСводыЗаявокОплачиваемыеКлиентомВзаимозачетЗадолженности_20()
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблРасшифровкаПлатежа.Партнер КАК Партнер,
	|	ВзаимозачетЗадолженности.Организация КАК Организация,
	|	ВзаимозачетЗадолженности.КонтрагентДебитор КАК Контрагент,
	|	ВзаимозачетЗадолженности.Дата КАК Дата,
	|	ВзаимозачетЗадолженности.Номер КАК Номер,
	|	ВзаимозачетЗадолженности.ВидОперации КАК ХозяйственнаяОперация,
	|	ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор КАК Договор,
	|	СУММА(ВзаимозачетЗадолженностиСчета.Сумма) КАК Сумма,
	|	ВзаимозачетЗадолженностиСчета.Счет КАК Счет,
	|	Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту КАК ФормаОплатыУслугАгенту
	|ПОМЕСТИТЬ РасшифровкаПлатежа
	|ИЗ
	|	Документ.ВзаимозачетЗадолженности.ДебиторскаяЗадолженность КАК ТаблРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВзаимозачетЗадолженности КАК ВзаимозачетЗадолженности
	|		ПО ТаблРасшифровкаПлатежа.Ссылка = ВзаимозачетЗадолженности.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВзаимозачетЗадолженности.Счета КАК ВзаимозачетЗадолженностиСчета
	|		ПО ТаблРасшифровкаПлатежа.Ссылка = ВзаимозачетЗадолженностиСчета.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИсторияФормыОплатыДоговоров.СрезПоследних(&Период, ) КАК Логс_ИсторияФормыОплатыДоговоровСрезПоследних
	|		ПО ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор = Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ДоговорКонтрагентов
	|			И (Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.Оплата100))
	|ГДЕ
	|	ВзаимозачетЗадолженности.Ссылка = &Ссылка
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор.Логс_ВидКлиентаCRM <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблРасшифровкаПлатежа.Партнер,
	|	ВзаимозачетЗадолженности.Организация,
	|	ВзаимозачетЗадолженности.КонтрагентДебитор,
	|	ВзаимозачетЗадолженности.Номер,
	|	ВзаимозачетЗадолженности.ВидОперации,
	|	ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор,
	|	ВзаимозачетЗадолженности.Дата,
	|	ВзаимозачетЗадолженностиСчета.Счет,
	|	Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВзаимозачетЗадолженности.Дата КАК Дата,
	|	ТаблРасшифровкаПлатежа.Партнер КАК Партнер,
	|	ВзаимозачетЗадолженности.Организация КАК Организация,
	|	ВзаимозачетЗадолженности.КонтрагентДебитор КАК Контрагент,
	|	ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор КАК Договор,
	|	СУММА(ВзаимозачетЗадолженностиСводы.Сумма) КАК Сумма,
	|	ВзаимозачетЗадолженностиСводы.Свод КАК СводЗаявок,
	|	ТаблРасшифровкаПлатежа.ВалютаВзаиморасчетов КАК Валюта
	|ПОМЕСТИТЬ РасшифровкаПлатежаСвод
	|ИЗ
	|	Документ.ВзаимозачетЗадолженности.ДебиторскаяЗадолженность КАК ТаблРасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВзаимозачетЗадолженности КАК ВзаимозачетЗадолженности
	|		ПО ТаблРасшифровкаПлатежа.Ссылка = ВзаимозачетЗадолженности.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ВзаимозачетЗадолженности.Своды КАК ВзаимозачетЗадолженностиСводы
	|		ПО ТаблРасшифровкаПлатежа.Ссылка = ВзаимозачетЗадолженностиСводы.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИсторияФормыОплатыДоговоров.СрезПоследних(&Период, ) КАК Логс_ИсторияФормыОплатыДоговоровСрезПоследних
	|		ПО ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор = Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ДоговорКонтрагентов
	|			И (Логс_ИсторияФормыОплатыДоговоровСрезПоследних.ФормаОплатыУслугАгенту = ЗНАЧЕНИЕ(Перечисление.Логс_ФормыОплатыУслугАгенту.Оплата100))
	|ГДЕ
	|	ВзаимозачетЗадолженности.Ссылка = &Ссылка
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Объект ССЫЛКА Справочник.ДоговорыКонтрагентов
	|	И ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор.Логс_ВидКлиентаCRM <> ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.ПустаяСсылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВзаимозачетЗадолженности.Дата,
	|	ТаблРасшифровкаПлатежа.Партнер,
	|	ВзаимозачетЗадолженности.Организация,
	|	ВзаимозачетЗадолженности.КонтрагентДебитор,
	|	ТаблРасшифровкаПлатежа.ОбъектРасчетов.Договор,
	|	ВзаимозачетЗадолженностиСводы.Свод,
	|	ТаблРасшифровкаПлатежа.ВалютаВзаиморасчетов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасшифровкаПлатежа.Дата КАК Дата,
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики,
	|	РасшифровкаПлатежа.Сумма КАК Сумма,
	|	РасшифровкаПлатежа.СводЗаявок КАК СводЗаявок,
	|	ДоговорыКонтрагентов.ВалютаВзаиморасчетов КАК Валюта
	|ПОМЕСТИТЬ ДанныеСвод
	|ИЗ
	|	РасшифровкаПлатежаСвод КАК РасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|		ПО РасшифровкаПлатежа.Партнер = АналитикаУчетаПоПартнерам.Партнер
	|			И РасшифровкаПлатежа.Организация = АналитикаУчетаПоПартнерам.Организация
	|			И РасшифровкаПлатежа.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
	|			И РасшифровкаПлатежа.Договор = АналитикаУчетаПоПартнерам.Договор
	|			И (АналитикаУчетаПоПартнерам.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РасшифровкаПлатежа.Договор = ДоговорыКонтрагентов.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючАналитики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	АналитикаУчетаПоПартнерам.КлючАналитики КАК КлючАналитики,
	|	РасшифровкаПлатежа.ФормаОплатыУслугАгенту КАК ФормаОплаты,
	|	РасшифровкаПлатежа.Дата КАК Дата,
	|	РасшифровкаПлатежа.Номер КАК Номер,
	|	РасшифровкаПлатежа.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	РасшифровкаПлатежа.Сумма КАК Сумма,
	|	РасшифровкаПлатежа.Счет КАК Счет,
	|	РасшифровкаПлатежа.Счет.Валюта КАК Валюта
	|ПОМЕСТИТЬ Данные
	|ИЗ
	|	РасшифровкаПлатежа КАК РасшифровкаПлатежа
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.АналитикаУчетаПоПартнерам КАК АналитикаУчетаПоПартнерам
	|		ПО РасшифровкаПлатежа.Партнер = АналитикаУчетаПоПартнерам.Партнер
	|			И РасшифровкаПлатежа.Организация = АналитикаУчетаПоПартнерам.Организация
	|			И РасшифровкаПлатежа.Контрагент = АналитикаУчетаПоПартнерам.Контрагент
	|			И РасшифровкаПлатежа.Договор = АналитикаУчетаПоПартнерам.Договор
	|			И (АналитикаУчетаПоПартнерам.НаправлениеДеятельности = ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка))
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ПО РасшифровкаПлатежа.Договор = ДоговорыКонтрагентов.Ссылка
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	КлючАналитики
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РасшифровкаПлатежа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ РасшифровкаПлатежаСвод
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Дата КАК Период,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	Данные.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	Данные.Сумма КАК Сумма,
	|	Данные.СводЗаявок КАК СводЗаявок,
	|	Данные.Валюта КАК Валюта
	|ИЗ
	|	ДанныеСвод КАК Данные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Данные.Дата КАК Период,
	|	Данные.Дата КАК ДатаРегистратора,
	|	Данные.Номер КАК НомерРегистратора,
	|	Данные.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	Данные.КлючАналитики КАК АналитикаУчетаПоПартнерам,
	|	Данные.Сумма КАК СуммаПлатежа,
	|	Данные.ФормаОплаты КАК ФормаОплаты,
	|	Данные.Сумма КАК Долг,
	|	ВЗ_СчетДатаПлатежа.ДатаПлатежа КАК ДатаПлановогоПогашения,
	|	Данные.Счет КАК Счет,
	|	Данные.Валюта КАК Валюта
	|ИЗ
	|	Данные КАК Данные
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			СчетНаОплатуКлиентуЭтапыГрафикаОплаты.Ссылка КАК Ссылка,
	|			МАКСИМУМ(СчетНаОплатуКлиентуЭтапыГрафикаОплаты.ДатаПлатежа) КАК ДатаПлатежа
	|		ИЗ
	|			Документ.СчетНаОплатуКлиенту.ЭтапыГрафикаОплаты КАК СчетНаОплатуКлиентуЭтапыГрафикаОплаты
	|		    Внутреннее соединение Данные как Данные ПО СчетНаОплатуКлиентуЭтапыГрафикаОплаты.Ссылка = Данные.Счет
	|		СГРУППИРОВАТЬ ПО
	|			СчетНаОплатуКлиентуЭтапыГрафикаОплаты.Ссылка) КАК ВЗ_СчетДатаПлатежа
	|		ПО Данные.Счет = ВЗ_СчетДатаПлатежа.Ссылка
	|ИТОГИ
	|	МАКСИМУМ(СуммаПлатежа),
	|	СУММА(Долг)
	|ПО
	|	АналитикаУчетаПоПартнерам";
	
	Возврат ТекстЗапроса;
	
КонецФункции 

Процедура ДобавитьЗаполнитьПорядокРасчетовПоУслугамЗаДоставку(ТаблицаРасчеты, ТипДокумента)
	
	ТаблицаРасчеты.Колонки.Добавить("ПорядокОперации", Новый ОписаниеТипов("Строка"));
	ТаблицаРасчеты.Колонки.Добавить("ПорядокЗачетаПоДатеПлатежа", Новый ОписаниеТипов("Строка"));
	
	ВидТипДокумента = ?(ТипДокумента = Тип("ДокументСсылка.СчетНаОплатуКлиенту"),
		Новый Структура("Вид,Тип", "2", "91"),
		ОперативныеВзаиморасчетыСервер.ВидТипДокумента(ТипДокумента));
	
	Для каждого СтрокаТаблицы Из ТаблицаРасчеты Цикл
		
		ДатаПлатежа = СтрокаТаблицы.ДатаПлатежа;
		
		// План оплаты
		Если СтрокаТаблицы.Выставлено = 0 И СтрокаТаблицы.КОплате <> 0 Тогда
			
			//СтрокаТаблицы.ПорядокОперации = ОперативныеВзаиморасчетыСервер.Порядок(
			//	СтрокаТаблицы.ДатаРегистратора, СтрокаТаблицы.НомерРегистратора, ВидТипДокумента);
			//СтрокаТаблицы.ПорядокЗачетаПоДатеПлатежа = ОперативныеВзаиморасчетыСервер.Порядок(
			//	ДатаПлатежа, СтрокаТаблицы.НомерРегистратора, ВидТипДокумента); 
						
			СтрокаТаблицы.ПорядокОперации = ОперативныеВзаиморасчетыСервер.Порядок(
				СтрокаТаблицы.ДатаРегистратора, СтрокаТаблицы.НомерРегистратора, ВидТипДокумента.Тип, ВидТипДокумента.Вид, ВидТипДокумента.Тип);
			СтрокаТаблицы.ПорядокЗачетаПоДатеПлатежа = ОперативныеВзаиморасчетыСервер.Порядок(
				ДатаПлатежа, СтрокаТаблицы.НомерРегистратора, ВидТипДокумента.Тип, ВидТипДокумента.Вид, ВидТипДокумента.Тип); 
				
		// Платежные документы и сторно отгрузки
		ИначеЕсли СтрокаТаблицы.ВидДвижения = ВидДвиженияНакопления.Расход
						И СтрокаТаблицы.Выставлено > 0
					Или СтрокаТаблицы.ВидДвижения = ВидДвиженияНакопления.Приход
						И СтрокаТаблицы.Выставлено < 0 Тогда
			
			СтрокаТаблицы.ПорядокОперации = ОперативныеВзаиморасчетыСервер.Порядок(
				СтрокаТаблицы.Период, СтрокаТаблицы.НомерРегистратора, ВидТипДокумента.Тип, ВидТипДокумента.Вид);
			СтрокаТаблицы.ПорядокЗачетаПоДатеПлатежа = СтрокаТаблицы.ПорядокОперации;
			
		// Накладные и пр.
		ИначеЕсли СтрокаТаблицы.Выставлено <> 0 Или СтрокаТаблицы.КОплате <> 0 Тогда
			
			СтрокаТаблицы.ПорядокОперации = ОперативныеВзаиморасчетыСервер.Порядок(
				СтрокаТаблицы.ДатаРегистратора, СтрокаТаблицы.НомерРегистратора, ВидТипДокумента.Тип, ВидТипДокумента.Вид, ВидТипДокумента.Тип);
			СтрокаТаблицы.ПорядокЗачетаПоДатеПлатежа = ОперативныеВзаиморасчетыСервер.Порядок(
				ДатаПлатежа, СтрокаТаблицы.НомерРегистратора, ВидТипДокумента.Тип, ВидТипДокумента.Вид, ВидТипДокумента.Тип);
			
		КонецЕсли; 
		
	КонецЦикла;
	
КонецПроцедуры 

Функция СфорироватьСписокЗависимыхСводовЗаявокПоСписаниюБезналичныхДС(Объект)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СводЗаявокНаДоставку.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку КАК СводЗаявокНаДоставку
	|ГДЕ
	|	СводЗаявокНаДоставку.Ссылка В(&МассивСводов)
	|
	|СГРУППИРОВАТЬ ПО
	|	СводЗаявокНаДоставку.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СводЗаявокНаДоставку.Ссылка
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку КАК СводЗаявокНаДоставку
	|ГДЕ
	|	СводЗаявокНаДоставку.Ссылка В
	|			(ВЫБРАТЬ
	|				РасшифровкаПоСводам.СводЗаявок
	|			ИЗ
	|				Документ.СписаниеБезналичныхДенежныхСредств.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК РасшифровкаПоСводам
	|			ГДЕ
	|				РасшифровкаПоСводам.Ссылка = &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	СводЗаявокНаДоставку.Ссылка");
	Запрос.УстановитьПараметр("МассивСводов", Объект.Логс_РаспределениеПоСводамЗаявокНаДоставку.ВыгрузитьКолонку("СводЗаявок"));
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	МассивЗавимыхСводовЗаявок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Объект.ДополнительныеСвойства.Вставить("МассивЗависимыхСводовЗаявок", Новый ФиксированныйМассив(МассивЗавимыхСводовЗаявок));
	
КонецФункции 

Функция СфорироватьСписокЗависимыхСводовЗаявокПоРКО(Объект)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СводЗаявокНаДоставку.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку КАК СводЗаявокНаДоставку
	|ГДЕ
	|	СводЗаявокНаДоставку.Ссылка В(&МассивСводов)
	|
	|СГРУППИРОВАТЬ ПО
	|	СводЗаявокНаДоставку.Ссылка
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	СводЗаявокНаДоставку.Ссылка
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку КАК СводЗаявокНаДоставку
	|ГДЕ
	|	СводЗаявокНаДоставку.Ссылка В
	|			(ВЫБРАТЬ
	|				РасшифровкаПоСводам.СводЗаявок
	|			ИЗ
	|				Документ.РасходныйКассовыйОрдер.Логс_РаспределениеПоСводамЗаявокНаДоставку КАК РасшифровкаПоСводам
	|			ГДЕ
	|				РасшифровкаПоСводам.Ссылка = &Ссылка)
	|
	|СГРУППИРОВАТЬ ПО
	|	СводЗаявокНаДоставку.Ссылка");
	Запрос.УстановитьПараметр("МассивСводов", Объект.Логс_РаспределениеПоСводамЗаявокНаДоставку.ВыгрузитьКолонку("СводЗаявок"));
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	УстановитьПривилегированныйРежим(Истина);
	МассивЗавимыхСводовЗаявок = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	Объект.ДополнительныеСвойства.Вставить("МассивЗависимыхСводовЗаявок", Новый ФиксированныйМассив(МассивЗавимыхСводовЗаявок));
	
КонецФункции 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СоздатьСводыЗаявокНаДоставку(НачалоПериода, КонецПериода, ПериодФормирования = Неопределено,
									Партнер = Неопределено, ОтправлятьПоПочте = Ложь, Хаб = Неопределено) Экспорт
	                                                                  
	ЕстьОшибки = Ложь;
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ПоместитьВоВременнуюТаблицуСводыЗаявокНаДоставкуКОформлениюСводов(Запрос.МенеджерВременныхТаблиц,
		НачалоПериода, КонецПериода, ПериодФормирования, Партнер, Хаб);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаявкиКОформлению.Период КАК Дата,
	|	Заявка.Ссылка КАК ЗаявкаНаДоставку,
	|	Заявка.Организация КАК Организация,
	|	Заявка.Партнер КАК Партнер,
	|	Заявка.Контрагент КАК Контрагент,
	|	Заявка.Договор КАК Договор,
	|	Заявка.ФормаОплаты КАК ФормаОплаты,
	|	Заявка.НалогообложениеНДС КАК НалогообложениеНДС,
	|	Заявка.Валюта КАК Валюта,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Логс_ИдентификаторCRM, """") КАК ИдентификаторКлиента,
	|	ДоговорыКонтрагентов.Логс_ВидКлиентаCRM КАК ВидКлиента,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Логс_НеОтправлятьСтандартныеОтчетыАгента, ЛОЖЬ) КАК Логс_НеОтправлятьСтандартныеОтчетыАгента,
	|	Заявка.Дата КАК ДатаДоставки,
	|	Заявка.Номер КАК НомерЗаказа,
	|	Заявка.НомерЗаказаКлиента КАК НомерЗаказаКлиента,
	|	Заявка.СтавкаНДС КАК СтавкаНДС,
	|	Заявка.Статус КАК Статус,
	|	Заявка.Курьер КАК Курьер,
	|	Заявка.Вес КАК Вес,
	|	Заявка.ОбъемныйВес КАК ОбъемныйВес,
	|	Заявка.РасстояниеОтМКАД КАК РасстояниеОтМКАД,
	|	Заявка.ОценочнаяСтоимость КАК ОценочнаяСтоимость,
	|	Заявка.НаложенныйПлатеж КАК НаложенныйПлатеж,
	|	Заявка.Тариф КАК Тариф,
	|	Заявка.ПовторнаяДоставка КАК ПовторнаяДоставка,
	|	Заявка.КассовоеОбслуживание КАК КассовоеОбслуживание,
	|	Заявка.Эквайринг КАК Эквайринг,
	|	Заявка.Страхование КАК Страхование,
	|	Заявка.ЗаносКГТ КАК ЗаносКГТ,
	|	Заявка.ВозвратныеДокументы КАК ВозвратныеДокументы,
	|	Заявка.СМС КАК СМС,
	|	Заявка.Прозвон КАК Прозвон,
	|	Заявка.ПолнаяСтоимость КАК ПолнаяСтоимость,
	|	Заявка.ПолнаяСтоимостьНДС КАК ПолнаяСтоимостьНДС,
	|	Заявка.ПолнаяСтоимостьСНДС КАК ПолнаяСтоимостьСНДС,
	|	Заявка.КПеречислению КАК КПеречислению,
	|	Заявка.СтоимостьЗаказа КАК СтоимостьЗаказа,
	|	Заявка.ДатаЗабора КАК ДатаЗабора,
	|	Заявка.ДатаВозврата КАК ДатаВозврата,
	|	Заявка.СуммаВозврата КАК СуммаВозврата,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.Логс_НеРазделятьОтчетыАгентовПоРегионам
	|			ТОГДА ЛОЖЬ
	|		КОГДА Заявка.Хаб = ЗНАЧЕНИЕ(Справочник.Логс_Хабы.ТД)
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ Заявка.РегиональнаяЗаявка
	|	КОНЕЦ КАК РегиональнаяЗаявка,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.Логс_НеРазделятьОтчетыАгентовПоРегионам
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Логс_Хабы.Москва)
	|		КОГДА Заявка.Хаб = ЗНАЧЕНИЕ(Справочник.Логс_Хабы.ТД)
	|				ИЛИ Заявка.РегиональнаяЗаявка
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.Логс_Хабы.ПустаяСсылка)
	|		КОГДА НЕ Заявка.Хаб.РодительскийХаб = ЗНАЧЕНИЕ(Справочник.Логс_Хабы.ПустаяСсылка)
	|			ТОГДА Заявка.Хаб.РодительскийХаб
	|		ИНАЧЕ Заявка.Хаб
	|	КОНЕЦ КАК Хаб,
	|	ВЫБОР
	|		КОГДА ДоговорыКонтрагентов.Логс_НеРазделятьОтчетыАгентовПоРегионам
	|			ТОГДА ""MSK""
	|		КОГДА НЕ Заявка.Хаб.РодительскийХаб = ЗНАЧЕНИЕ(Справочник.Логс_Хабы.ПустаяСсылка)
	|			ТОГДА Заявка.Хаб.РодительскийХаб.ПрефиксЗаявок
	|		ИНАЧЕ Заявка.Хаб.ПрефиксЗаявок
	|	КОНЕЦ КАК ПрефиксХаба,
	|	Заявка.ОбработкаЧастичногоВыкупа КАК ОбработкаЧастичногоВыкупа,
	|	Заявка.ОбработкаВозврата КАК ОбработкаВозврата,
	|	Заявка.СуммаКлиентскогоВозврата КАК СуммаКлиентскогоВозврата,
	|	Заявка.СуммаКлиентскогоОбмена КАК СуммаКлиентскогоОбмена,
	|	Заявка.МагистральноеПеремещение КАК МагистральноеПеремещение, 
	|	Заявка.Хранение КАК Хранение
	|ИЗ
	|	ЗаявкиКОформлению КАК ЗаявкиКОформлению
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Логс_ЗаявкаНаДоставку КАК Заявка
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ПО Заявка.Договор = ДоговорыКонтрагентов.Ссылка
	|		ПО ЗаявкиКОформлению.ЗаявкаНаДоставку = Заявка.Ссылка
	|ГДЕ
	|	(&Хаб = ЗНАЧЕНИЕ(Справочник.Логс_Хабы.ПустаяСсылка)
	|			ИЛИ &хаб = НЕОПРЕДЕЛЕНО
	|			ИЛИ ВЫБОР
	|				КОГДА ДоговорыКонтрагентов.Логс_НеРазделятьОтчетыАгентовПоРегионам
	|					ТОГДА ЗНАЧЕНИЕ(Справочник.Логс_Хабы.Москва)
	|				ИНАЧЕ Заявка.Хаб
	|			КОНЕЦ = &Хаб)
	|
	|УПОРЯДОЧИТЬ ПО
	|	РегиональнаяЗаявка,
	|	Дата,
	|	ДатаДоставки,
	|	НомерЗаказа
	|ИТОГИ
	|	МАКСИМУМ(ИдентификаторКлиента),
	|	МАКСИМУМ(ВидКлиента),
	|	МАКСИМУМ(ПрефиксХаба)
	|ПО
	|	Хаб,
	|	РегиональнаяЗаявка,
	|	Дата,
	|	Организация,
	|	Партнер,
	|	Контрагент,
	|	Договор,
	|	ФормаОплаты,
	|	Валюта,
	|	НалогообложениеНДС
	|АВТОУПОРЯДОЧИВАНИЕ";
	Запрос.УстановитьПараметр("Хаб", Хаб);
	ВыборкаХаб = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаХаб.Следующий() Цикл
		ВыборкаДата = ВыборкаХаб.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаДата.Следующий() Цикл
			ВыборкаОрганизация = ВыборкаДата.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Пока ВыборкаОрганизация.Следующий() Цикл
				ВыборкаПартнер = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				Пока ВыборкаПартнер.Следующий() Цикл
					ВыборкаКонтрагент = ВыборкаПартнер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					Пока ВыборкаКонтрагент.Следующий() Цикл
						ВыборкаДоговор = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
						Пока ВыборкаДоговор.Следующий() Цикл
							ВыборкаРегион = ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
							Пока ВыборкаРегион.Следующий() Цикл
								ВыборкаФормаОплаты = ВыборкаРегион.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
								Пока ВыборкаФормаОплаты.Следующий() Цикл
									ВыборкаВалюта = ВыборкаФормаОплаты.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
									Пока ВыборкаВалюта.Следующий() Цикл
										ВыборкаНалогообложение = ВыборкаВалюта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
										Пока ВыборкаНалогообложение.Следующий() Цикл
											
											СводЗаявок = Документы.Логс_СводЗаявокНаДоставку.СоздатьДокумент();
											СводЗаявок.Дата = КонецДня(ВыборкаНалогообложение.Дата);
											СводЗаявок.Организация = ВыборкаНалогообложение.Организация;
											СводЗаявок.Партнер = ВыборкаНалогообложение.Партнер;
											СводЗаявок.Контрагент = ВыборкаНалогообложение.Контрагент;
											СводЗаявок.Договор = ВыборкаНалогообложение.Договор;
											СводЗаявок.ФормаОплаты = ВыборкаНалогообложение.ФормаОплаты;
											СводЗаявок.НалогообложениеНДС = ВыборкаНалогообложение.НалогообложениеНДС;
											СводЗаявок.Валюта = ВыборкаНалогообложение.Валюта;
											СводЗаявок.ВидКлиента = ВыборкаНалогообложение.ВидКлиента;
											СводЗаявок.РегиональныйСвод = ВыборкаНалогообложение.РегиональнаяЗаявка;
											СводЗаявок.Ответственный = Пользователи.ТекущийПользователь();
											
											
											НеОтправлятьСтандартные = Ложь;
											Выборка = ВыборкаНалогообложение.Выбрать();
											Пока Выборка.Следующий() Цикл
												СтрокаЗаявки = СводЗаявок.Заявки.Добавить();
												ЗаполнитьЗначенияСвойств(СтрокаЗаявки, Выборка);
												НеОтправлятьСтандартные = Выборка.Логс_НеОтправлятьСтандартныеОтчетыАгента;
											КонецЦикла;
											СводЗаявок.ЗаполнитьДатуВыставленияСчета();

											//Префикс = СтрШаблон(НСтр("ru='%1%2-'"),
											//	ВыборкаНалогообложение.Договор.Логс_ИдентификаторCRM,
											//	?(СводЗаявок.РегиональныйСвод, "REG", "MSK"));
											//Префикс = СтрШаблон(НСтр("ru='%1%2-'"),
											//	ВыборкаНалогообложение.Договор.Логс_ИдентификаторCRM,
											//	?(СводЗаявок.РегиональныйСвод, "REG", "MSK"));
											ПрефиксРегиона = ?(ВыборкаХаб.ПрефиксХаба = "", "MSK", ВыборкаХаб.ПрефиксХаба);
											Префикс = СтрШаблон(НСтр("ru='%1%2-'"),
												ВыборкаНалогообложение.Договор.Логс_ИдентификаторCRM,
												?(СводЗаявок.РегиональныйСвод, "REG", ПрефиксРегиона));
												
											СводЗаявок.Хаб = ВыборкаХаб.Хаб;	
											СводЗаявок.УстановитьНовыйНомер(Префикс);
											СводЗаявок.Записать(РежимЗаписиДокумента.Запись);
											
											Попытка
												СводЗаявок.Записать(РежимЗаписиДокумента.Проведение);
											Исключение
												ТекстСообщения = СтрШаблон(
													НСтр("ru='Произошла ошибка при проведении свода заявок № %1 от %2: %3'"),
													СводЗаявок.Номер, СводЗаявок.Дата,
													КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
												ЗаписьЖурналаРегистрации("Обмен с CRM. Создание сводов заявок",
													УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
												ЕстьОшибки = Истина;
												Продолжить;
											КонецПопытки; 
											
											//Fil
											Если СводЗаявок.Проведен И ОтправлятьПоПочте и НЕ НеОтправлятьСтандартные Тогда
												ОтправитьПоПочтеСчетОтчет(СводЗаявок.Ссылка, "Отчет");
											КонецЕсли;									
										КонецЦикла; // Налогообложение
									КонецЦикла; // Валюта
								КонецЦикла; // Форма оплаты
							КонецЦикла; // Регионы
						КонецЦикла; // Договор
					КонецЦикла; // Контрагент
				КонецЦикла; // Партнер
			КонецЦикла; // Организация
		КонецЦикла; // Дата
	КонецЦикла; // Хаб
	
	Возврат Не ЕстьОшибки;
	
КонецФункции

Процедура СоздатьСводыЗаявокНаДоставкуВФоне(Параметры, АдресХранилища) Экспорт
	Перем Партнер, Хаб;
	
	Параметры.Свойство("Партнер", Партнер);
	Параметры.Свойство("Хаб", Хаб);
	
	БылиОшибки = Не СоздатьСводыЗаявокНаДоставку(Параметры.НачалоПериода, Параметры.КонецПериода,
		Параметры.ПериодыФормированияСводов, Партнер, Параметры.ОтправлятьПоЭлектроннойПочте, Хаб);
	
	Результат = Новый Структура("Успешно", Не БылиОшибки);
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры

Функция СоздатьСводыЗаявокСКС(ДатаСводов, НачалоПериода, КонецПериода, Партнер = Неопределено) Экспорт
	
	ЕстьОшибки = Ложь;
	
	ЛогсисОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9725007793");
    ОрионОрганизация = Справочники.Организации.НайтиПоРеквизиту("ИНН", "9728051543");
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	РегистрыСведений.Логс_ОтборЗаявокНаДоставкуСКС.ПоместитьЗаявкиПоОтборуВоВременнуюТаблицуДляСводов(
		МенеджерВременныхТаблиц, НачалоПериода, КонецПериода, Партнер);
		
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));   
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СводЗаявокНаДоставкуЗаявки.ЗаявкаНаДоставку КАК ЗаявкаНаДоставку
	|ПОМЕСТИТЬ СуществующиеСводы
	|ИЗ
	|	Документ.Логс_СводЗаявокНаДоставку.Заявки КАК СводЗаявокНаДоставкуЗаявки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку КАК СводЗаявокНаДоставку
	|		ПО СводЗаявокНаДоставкуЗаявки.Ссылка = СводЗаявокНаДоставку.Ссылка
	|ГДЕ
	|	СводЗаявокНаДоставку.Дата >= &НачалоПериода
	|	И СводЗаявокНаДоставку.ВидКлиента = ЗНАЧЕНИЕ(Перечисление.Логс_ВидыКлиентовCRM.СКС)
	|	И НЕ СводЗаявокНаДоставку.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ЗаявкаНаДоставку
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заявка.Ссылка КАК ЗаявкаНаДоставку,
	|	Заявка.Договор КАК ДоговорИсходный,
	|	Заявка.Организация КАК Организация,
	|	НАЧАЛОПЕРИОДА(Заявка.Дата, ДЕНЬ) КАК Период,
	|	Заявка.Дата КАК ДатаДоставки,
	|	Заявка.Номер КАК НомерЗаказа,
	|	Заявка.НомерЗаказаКлиента КАК НомерЗаказаКлиента,
	|	Заявка.Валюта КАК Валюта,
	|	Заявка.Статус КАК Статус,
	|	Заявка.Курьер КАК Курьер,
	|	Заявка.Вес КАК Вес,
	|	Заявка.РасстояниеОтМКАД КАК РасстояниеОтМКАД,
	|	Заявка.ОценочнаяСтоимость КАК ОценочнаяСтоимость,
	|	Заявка.ОплатаНаличные КАК ОплатаНаличные,
	|	ВЫБОР
	|		КОГДА Заявка.ОплатаНаличные
	|			ТОГДА Заявка.НаложенныйПлатеж
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК НаложенныйПлатеж,
	|	Заявка.Тариф КАК Тариф,
	|	Заявка.ПовторнаяДоставка КАК ПовторнаяДоставка,
	|	Заявка.КассовоеОбслуживание КАК КассовоеОбслуживание,
	|	Заявка.Эквайринг КАК Эквайринг,
	|	Заявка.Страхование КАК Страхование,
	|	Заявка.ЗаносКГТ КАК ЗаносКГТ,
	|	Заявка.ВозвратныеДокументы КАК ВозвратныеДокументы,
	|	Заявка.СМС КАК СМС,
	|	Заявка.ПолнаяСтоимостьСНДС КАК ПолнаяСтоимостьСНДС,
	|	Заявка.ПолнаяСтоимостьНДС КАК ПолнаяСтоимостьНДС,
	|	Заявка.ПолнаяСтоимость КАК ПолнаяСтоимость,
	|	ЗаявкиСКС.Партнер КАК Партнер,
	|	ЗаявкиСКС.Контрагент КАК Контрагент,
	|	ЗаявкиСКС.Договор КАК Договор,
	|	ЗаявкиСКС.ДоговорРеализации КАК ДоговорРеализации,
	|	ЗаявкиСКС.Доля КАК Доля,
	|	ЗаявкиСКС.ПроцентОтСтоимостиУслуг КАК ПроцентОтСтоимостиУслуг,
	|	Заявка.ФормаОплаты КАК ФормаОплаты
	|ПОМЕСТИТЬ ВТ_Заявки
	|ИЗ
	|	Документ.Логс_ЗаявкаНаДоставку КАК Заявка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ЗаявкиСКС КАК ЗаявкиСКС
	|		ПО Заявка.Ссылка = ЗаявкиСКС.Ссылка
	|	Левое Соединение Справочник.Сотрудники как Курьеры
	|		По Заявка.Курьер = Курьеры.Ссылка
	|	Левое Соединение Справочник.ДоговорыКонтрагентов как КурьерыСЗ
	|		По Заявка.Курьер = КурьерыСЗ.Ссылка
	|	
	|ГДЕ
	|	Заявка.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	|	И &ТекстОтбораПоПартнеру
	|	И НЕ Заявка.Ссылка В
	|				(ВЫБРАТЬ
	|					СуществующиеСводы.ЗаявкаНаДоставку
	|				ИЗ
	|					СуществующиеСводы)
	|	И Заявка.Проведен
	////с августа 21 не включаются СЗ курьеры
	//|	И (Заявка.Дата<ДатаВремя(2021,08,01,0,0,0)
	//|		ИЛИ (Курьеры.Ссылка есть NULL и КурьерыСЗ.Ссылка есть NULL)
	//|		ИЛИ (НЕ Курьеры.Ссылка есть NULL и НЕ Курьеры.Логс_Самозанятый)
	//|		ИЛИ (НЕ КурьерыСЗ.Ссылка есть NULL и НЕ КурьерыСЗ.Логс_ВидКлиентаCRM = Значение(Перечисление.Логс_ВидыКлиентовCRM.СамозанятыйКурьер)) )
	
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	//|ВЫБРАТЬ
	//|	Заявки.Период КАК Период,
	//|	Заявки.Договор КАК Договор,
	//|	ЕСТЬNULL(Настройки.ОтражатьРеализациюНаРозничногоПокупателя, ЛОЖЬ) КАК ОтражатьРеализациюНаРозничногоПокупателя
	//|ПОМЕСТИТЬ ВТ_ИндивидуальныеНастройкиДоговоров
	//|ИЗ
	//|	(ВЫБРАТЬ
	//|		Заявки.Период КАК Период,
	//|		Заявки.Договор КАК Договор,
	//|		МАКСИМУМ(Настройки.Период) КАК МаксПериод
	//|	ИЗ
	//|		(ВЫБРАТЬ РАЗЛИЧНЫЕ
	//|			Заявки.Период КАК Период,
	//|			Заявки.ДоговорИсходный КАК Договор
	//|		ИЗ
	//|			ВТ_Заявки КАК Заявки) КАК Заявки
	//|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИндивидуальныеНастройкиДоговоров КАК Настройки
	//|			ПО Заявки.Договор = Настройки.Договор
	//|				И Заявки.Период >= Настройки.Период
	//|	
	//|	СГРУППИРОВАТЬ ПО
	//|		Заявки.Период,
	//|		Заявки.Договор) КАК Заявки
	//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Логс_ИндивидуальныеНастройкиДоговоров КАК Настройки
	//|		ПО Заявки.Договор = Настройки.Договор
	//|			И Заявки.МаксПериод = Настройки.Период
	//|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Заявки.ЗаявкаНаДоставку КАК ЗаявкаНаДоставку,
	|	Заявки.ДоговорИсходный КАК ДоговорИсходный,
	|	Заявки.Организация КАК Организация,
	|	Заявки.Период КАК Период,
	|	Заявки.ДатаДоставки КАК ДатаДоставки,
	|	Заявки.НомерЗаказа КАК НомерЗаказа,
	|	Заявки.НомерЗаказаКлиента КАК НомерЗаказаКлиента,
	|	Заявки.Валюта КАК Валюта,
	|	Заявки.Статус КАК Статус,
	|	Заявки.Курьер КАК Курьер,
	|	Заявки.Вес КАК Вес,
	|	Заявки.РасстояниеОтМКАД КАК РасстояниеОтМКАД,
	|	Заявки.ОценочнаяСтоимость КАК ОценочнаяСтоимость,
	|	Заявки.НаложенныйПлатеж КАК НаложенныйПлатеж,
	|	Заявки.Тариф КАК Тариф,
	|	Заявки.ПовторнаяДоставка КАК ПовторнаяДоставка,
	|	Заявки.КассовоеОбслуживание КАК КассовоеОбслуживание,
	|	Заявки.Эквайринг КАК Эквайринг,
	|	Заявки.Страхование КАК Страхование,
	|	Заявки.ЗаносКГТ КАК ЗаносКГТ,
	|	Заявки.ВозвратныеДокументы КАК ВозвратныеДокументы,
	|	Заявки.СМС КАК СМС,
	|	Заявки.ПолнаяСтоимостьСНДС КАК ПолнаяСтоимостьСНДС, 
	|	Заявки.ПолнаяСтоимостьНДС КАК ПолнаяСтоимостьНДС,
	|	Заявки.ПолнаяСтоимость КАК ПолнаяСтоимость,
	|	Заявки.Партнер КАК Партнер,
	|	Заявки.Контрагент КАК Контрагент,
	|	Заявки.Договор КАК Договор,
	|	Заявки.ДоговорРеализации КАК ДоговорРеализации,
	|	Заявки.Доля КАК Доля,
	|	Заявки.ОплатаНаличные КАК ОплатаНаличные,
	|	Заявки.ПроцентОтСтоимостиУслуг КАК ПроцентОтСтоимостиУслуг,
	|	Заявки.ФормаОплаты КАК ФормаОплаты
	|ИЗ
	|	ВТ_Заявки КАК Заявки 
	//|	Левое соединение ВТ_ИндивидуальныеНастройкиДоговоров как ВТ_ИндивидуальныеНастройкиДоговоров по Заявки.ДоговорИсходный = ВТ_ИндивидуальныеНастройкиДоговоров.Договор и Заявки.Период = ВТ_ИндивидуальныеНастройкиДоговоров.Период и Заявки.ОплатаНаличные
	//|ГДЕ ВТ_ИндивидуальныеНастройкиДоговоров.ОтражатьРеализациюНаРозничногоПокупателя есть null или ВТ_ИндивидуальныеНастройкиДоговоров.ОтражатьРеализациюНаРозничногоПокупателя =ЛОЖЬ
	|УПОРЯДОЧИТЬ ПО
	|	ДатаДоставки,
	|	НомерЗаказа
	|ИТОГИ
	|	МАКСИМУМ(ПроцентОтСтоимостиУслуг)
	|ПО
	|	Партнер,
	|	Контрагент,
	|	Договор, 
	|	ОплатаНаличные 
	|АВТОУПОРЯДОЧИВАНИЕ"; 
	
	Если Партнер <> Неопределено Тогда
		Запрос.УстановитьПараметр("Партнер", Партнер);
		ТекстОтбораПоПартнеру = "Заявка.Партнер = &Партнер";
	Иначе
		ТекстОтбораПоПартнеру = "ИСТИНА";
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтбораПоПартнеру", ТекстОтбораПоПартнеру);
	
	ВыборкаПартнер = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Партнер");
	
	Пока ВыборкаПартнер.Следующий() Цикл
		
		ВыборкаКонтрагент = ВыборкаПартнер.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Контрагент");
		Пока ВыборкаКонтрагент.Следующий() Цикл
			
			ВыборкаДоговор = ВыборкаКонтрагент.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Договор");
			Пока ВыборкаДоговор.Следующий() Цикл
				
				ВыборкаОплата = ВыборкаДоговор.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "ОплатаНаличные");
				Пока ВыборкаОплата.Следующий() Цикл
			
					ПроцентОтСтоимостиУслуг = ВыборкаОплата.ПроцентОтСтоимостиУслуг / 100;
				
					СводЗаявок = Документы.Логс_СводЗаявокНаДоставку.СоздатьДокумент();
					СводЗаявок.Дата = КонецДня(ДатаСводов);
					СводЗаявок.Организация = ВыборкаОплата.Договор.Организация;
					СводЗаявок.Партнер = ВыборкаОплата.Партнер;
					СводЗаявок.Контрагент = ВыборкаОплата.Контрагент;
					СводЗаявок.Договор = ВыборкаОплата.Договор;
					СводЗаявок.ФормаОплаты = ВыборкаОплата.ФормаОплаты; 
					
					//++ Ким Виктор 17.02.2026
					//НДС для СКС
					//https://logit.okdesk.ru/issues/1051
					Если УчетнаяПолитикаПереопределяемый.ПрименяетсяУСН(СводЗаявок.Организация, ДатаСводов) Тогда
						НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС;
					Иначе
						НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
					КонецЕсли;	
					
					Если СводЗаявок.Организация = ОрионОрганизация Тогда
						НалогообложениеНДС = перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
					КонецЕсли;
					
					//НалогообложениеНДС = ВыборкаОплата.Договор.НалогообложениеНДС;
					СводЗаявок.НалогообложениеНДС = НалогообложениеНДС;  
					
				    //-- Ким Виктор 17.02.2026
					
					СводЗаявок.Валюта = ВыборкаОплата.Договор.ВалютаВзаиморасчетов;
					СводЗаявок.ВидКлиента = Перечисления.Логс_ВидыКлиентовCRM.СКС;
					СводЗаявок.Ответственный = Пользователи.ТекущийПользователь();
					
					Выборка = ВыборкаОплата.Выбрать();
					Пока Выборка.Следующий() Цикл
						
						СтрокаЗаявки = СводЗаявок.Заявки.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаЗаявки, Выборка);
						СтрокаЗаявки.ОценочнаяСтоимость = Выборка.ОценочнаяСтоимость * ПроцентОтСтоимостиУслуг;
						СтрокаЗаявки.НаложенныйПлатеж = Выборка.НаложенныйПлатеж;
						СтрокаЗаявки.Тариф = Выборка.Тариф * ПроцентОтСтоимостиУслуг;
						СтрокаЗаявки.ПовторнаяДоставка = Выборка.ПовторнаяДоставка * ПроцентОтСтоимостиУслуг;
						СтрокаЗаявки.КассовоеОбслуживание = Выборка.КассовоеОбслуживание * ПроцентОтСтоимостиУслуг;
						СтрокаЗаявки.Эквайринг = Выборка.Эквайринг * ПроцентОтСтоимостиУслуг;
						СтрокаЗаявки.Страхование = Выборка.Страхование * ПроцентОтСтоимостиУслуг;
						СтрокаЗаявки.ЗаносКГТ = Выборка.ЗаносКГТ * ПроцентОтСтоимостиУслуг;
						СтрокаЗаявки.СМС = Выборка.СМС * ПроцентОтСтоимостиУслуг;
						СтрокаЗаявки.ВозвратныеДокументы = Выборка.ВозвратныеДокументы * ПроцентОтСтоимостиУслуг;
						//2 раза одна и таже строка.
						//СтрокаЗаявки.ПолнаяСтоимостьСНДС = Выборка.ПолнаяСтоимостьСНДС * ПроцентОтСтоимостиУслуг;
						
						//++ Ким Виктор 18.04.2025
						//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/16/TSLOG-16282  
						ИзПолнойСтоимостииНДС = Ложь;
						Если НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС Тогда
							СтрокаЗаявки.ПолнаяСтоимость = Выборка.ПолнаяСтоимостьСНДС * ПроцентОтСтоимостиУслуг;
							СтрокаЗаявки.ПолнаяСтоимостьНДС = 0;
						Иначе
							Если ВыборкаОплата.Договор.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("5%") 
								ИЛИ ВыборкаОплата.Договор.СтавкаНДС = Справочники.СтавкиНДС.НайтиПоНаименованию("22%") Тогда 
								СтавкаИзДоговора = ВыборкаОплата.Договор.СтавкаНДС.Ставка;
								ЧислительНДС   = СтавкаИзДоговора / 100;
								ЗнаменательНДС = 1 +(СтавкаИзДоговора / 100 );  
								СтрокаЗаявки.ПолнаяСтоимостьСНДС = (Выборка.ПолнаяСтоимость + Выборка.ПолнаяСтоимость * ЧислительНДС); 
								СтрокаЗаявки.ПолнаяСтоимость = (СтрокаЗаявки.ПолнаяСтоимостьСНДС - СтрокаЗаявки.ПолнаяСтоимостьСНДС * ЧислительНДС / ЗнаменательНДС) * ПроцентОтСтоимостиУслуг;
								СтрокаЗаявки.ПолнаяСтоимостьНДС = (СтрокаЗаявки.ПолнаяСтоимостьСНДС * ЧислительНДС / ЗнаменательНДС) * ПроцентОтСтоимостиУслуг;	
								СтрокаЗаявки.ПолнаяСтоимостьСНДС = СтрокаЗаявки.ПолнаяСтоимостьСНДС * ПроцентОтСтоимостиУслуг;
								ИзПолнойСтоимостииНДС = Истина;	
								//СтрокаЗаявки.ПолнаяСтоимость = (Выборка.ПолнаяСтоимостьСНДС - Выборка.ПолнаяСтоимостьСНДС * 0.05 / 1.05 ) * ПроцентОтСтоимостиУслуг;
								//СтрокаЗаявки.ПолнаяСтоимостьНДС = (Выборка.ПолнаяСтоимостьСНДС * 0.05 / 1.05) * ПроцентОтСтоимостиУслуг;											
							ИначеЕсли ВыборкаОплата.Договор.СтавкаНДС = Справочники.СтавкиНДС.БезНДС Тогда
								СтрокаЗаявки.ПолнаяСтоимость = Выборка.ПолнаяСтоимостьСНДС * ПроцентОтСтоимостиУслуг;
								СтрокаЗаявки.ПолнаяСтоимостьНДС = 0;
							Иначе
								СтрокаЗаявки.ПолнаяСтоимость = (Выборка.ПолнаяСтоимостьСНДС - Выборка.ПолнаяСтоимостьСНДС * 0.2 / 1.2) * ПроцентОтСтоимостиУслуг;
								СтрокаЗаявки.ПолнаяСтоимостьНДС = (Выборка.ПолнаяСтоимостьСНДС * 0.2 / 1.2) * ПроцентОтСтоимостиУслуг;											
							КонецЕсли;
						КонецЕсли;
						//-- Ким Виктор 18.04.2025 
						
						//СтрокаЗаявки.ПолнаяСтоимость = ?(НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС, 
						//								Выборка.ПолнаяСтоимостьСНДС, 
						//								Выборка.ПолнаяСтоимостьСНДС - Выборка.ПолнаяСтоимостьСНДС * 0.2 / 1.2) * ПроцентОтСтоимостиУслуг;
						//СтрокаЗаявки.ПолнаяСтоимостьНДС = ?(НалогообложениеНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС, 
						//									0, 
						//									Выборка.ПолнаяСтоимостьСНДС * 0.2 / 1.2) * ПроцентОтСтоимостиУслуг;	
						Если НЕ ИзПолнойСтоимостииНДС Тогда 
							СтрокаЗаявки.ПолнаяСтоимостьСНДС = Выборка.ПолнаяСтоимостьСНДС * ПроцентОтСтоимостиУслуг;  
						КонецЕсли;
						СтрокаЗаявки.КПеречислению = СтрокаЗаявки.НаложенныйПлатеж - ?(СводЗаявок.ФормаОплаты = Перечисления.Логс_ФормыОплатыУслугАгенту.Оплата100, 0, СтрокаЗаявки.ПолнаяСтоимостьСНДС);
						
					КонецЦикла;	
					
					СводЗаявок.ЗаполнитьДатуВыставленияСчета();

					СводЗаявок.УстановитьНовыйНомер(СокрЛП(ВыборкаОплата.Договор.Номер) + "SKS-");
					СводЗаявок.Записать(РежимЗаписиДокумента.Запись);
					
					Попытка
						СводЗаявок.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						ТекстСообщения = СтрШаблон(
							НСтр("ru='Произошла ошибка при проведении свода заявок № %1 от %2: %3'"),
							СводЗаявок.Номер, СводЗаявок.Дата,
							КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
						ЗаписьЖурналаРегистрации("Создание сводов заявок СКС", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
						ЕстьОшибки = Истина;
						Продолжить;
					КонецПопытки;    				
				КонецЦикла;	
			КонецЦикла;  
			
		КонецЦикла; 		
				
	КонецЦикла;	
	
	Возврат Не ЕстьОшибки;

КонецФункции 

//++ Ким Виктор 14.01.2025
//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15412
Функция СоздатьСводыЗаявокСКСТМС(ДатаСводов, НачалоПериода, КонецПериода, Партнер = Неопределено) Экспорт 
	
	ЕстьОшибки = Ложь;
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	ПараметрыСТ = Новый Структура;
	ПараметрыСТ.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыСТ.Вставить("КонецПериода",  КонецПериода);
	ПараметрыСТ.Вставить("Партнер", 		Партнер);
	РегистрыСведений.Логс_ПроцентыСтоимостиУслугСКСTMS.ПоместитьДанныеВоВременнуюТаблицуСписокРеестровАвито(МенеджерВременныхТаблиц, ПараметрыСТ);
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц; 
	Запрос.УстановитьПараметр("Период", НачалоПериода);
	Запрос.УстановитьПараметр("ПартнерСКС", Партнер);
	Запрос.УстановитьПараметр("ПартнерЗаполнен", ЗначениеЗаполнено(Партнер));
	Запрос.Текст = ( "ВЫБРАТЬ
	                 |	ВЫРАЗИТЬ(втРеестрыСамозанятых.Контрагент КАК Справочник.Контрагенты) КАК Контрагент,
	                 |	ВЫРАЗИТЬ(втРеестрыСамозанятых.Партнер КАК Справочник.Партнеры) КАК Партнер,
	                 |	ВЫРАЗИТЬ(втРеестрыСамозанятых.Договор КАК Справочник.ДоговорыКонтрагентов) КАК Договор,
	                 |	втРеестрыСамозанятых.ДатаОказанияУслуг КАК ДатаОказанияУслуг,
	                 |	СУММА(втРеестрыСамозанятых.Сумма) КАК Сумма,
	                 |	СУММА(втРеестрыСамозанятых.СуммаСНалогом) КАК СуммаСНалогом,
	                 |	СУММА(втРеестрыСамозанятых.КоличествоМаршрутов) КАК КоличествоТочек,
	                 |	ВЫРАЗИТЬ(втРеестрыСамозанятых.Договор КАК Справочник.ДоговорыКонтрагентов).Организация КАК Организация,
	                 |	1 КАК КоличествоМаршрутов
	                 |ПОМЕСТИТЬ втРеестрыОрганизация
	                 |ИЗ
	                 |	втРеестрыСамозанятых КАК втРеестрыСамозанятых
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	ВЫРАЗИТЬ(втРеестрыСамозанятых.Договор КАК Справочник.ДоговорыКонтрагентов),
	                 |	ВЫРАЗИТЬ(втРеестрыСамозанятых.Договор КАК Справочник.ДоговорыКонтрагентов).Организация,
	                 |	втРеестрыСамозанятых.ДатаОказанияУслуг,
	                 |	ВЫРАЗИТЬ(втРеестрыСамозанятых.Партнер КАК Справочник.Партнеры),
	                 |	ВЫРАЗИТЬ(втРеестрыСамозанятых.Контрагент КАК Справочник.Контрагенты)
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	втРеестрыОрганизация.Контрагент КАК Контрагент,
	                 |	втРеестрыОрганизация.Партнер КАК Партнер,
	                 |	втРеестрыОрганизация.Договор КАК Договор,
	                 |	втРеестрыОрганизация.ДатаОказанияУслуг КАК ДатаОказанияУслуг,
	                 |	втРеестрыОрганизация.Сумма КАК Сумма,
	                 |	втРеестрыОрганизация.СуммаСНалогом КАК СуммаСНалогом,
	                 |	втРеестрыОрганизация.Организация КАК Организация,
	                 |	ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) КАК КонтрагентСКС,
	                 |	ЗНАЧЕНИЕ(Справочник.Партнеры.ПустаяССылка) КАК ПартнерСКС,
	                 |	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорСКС,
	                 |	0 КАК ПроцентОтСтоимостиУслуг,
	                 |	0 КАК Доля,
	                 |	0 КАК РаспределениеСКС,
	                 |	ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка) КАК ДоговорРеализации,
	                 |	втРеестрыОрганизация.КоличествоТочек КАК КоличествоТочек,
	                 |	втРеестрыОрганизация.КоличествоМаршрутов КАК КоличествоМаршрутов
	                 |ИЗ
	                 |	втРеестрыОрганизация КАК втРеестрыОрганизация
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	втРеестрыОрганизация.Организация КАК Организация,
	                 |	СУММА(втРеестрыОрганизация.Сумма) КАК Сумма,
	                 |	СУММА(втРеестрыОрганизация.СуммаСНалогом) КАК СуммаСНалогом
	                 |ПОМЕСТИТЬ втРеестрыИтогиПоОрганизации
	                 |ИЗ
	                 |	втРеестрыОрганизация КАК втРеестрыОрганизация
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	втРеестрыОрганизация.Организация
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Организация КАК Организация,
	                 |	Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Партнер КАК ПартнерСКС,
	                 |	Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Контрагент КАК КонтрагентСКС,
	                 |	Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Договор КАК ДоговорСКС,
	                 |	Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.ПроцентОтСтоимостиУслуг КАК ПроцентОтСтоимостиУслуг,
	                 |	Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Доля КАК Доля,
	                 |	Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.ДоговорРеализации КАК ДоговорРеализации,
	                 |	0 КАК КоличествоЛимитаРаспределения,
	                 |	втРеестрыИтогиПоОрганизации.СуммаСНалогом * (Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.ПроцентОтСтоимостиУслуг / 100) * Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Доля КАК СуммаЛимитаРаспределения
	                 |ИЗ
	                 |	РегистрСведений.Логс_ПроцентыСтоимостиУслугСКСTMS.СрезПоследних(&Период, ) КАК Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ втРеестрыИтогиПоОрганизации КАК втРеестрыИтогиПоОрганизации
	                 |		ПО Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Организация = втРеестрыИтогиПоОрганизации.Организация
	                 |ГДЕ
	                 |	ВЫБОР
	                 |			КОГДА &ПартнерЗаполнен
	                 |				ТОГДА Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Партнер = &ПартнерСКС
	                 |			ИНАЧЕ ИСТИНА
	                 |		КОНЕЦ
	                 |
	                 |СГРУППИРОВАТЬ ПО
	                 |	Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Партнер,
	                 |	Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Контрагент,
	                 |	Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Организация,
	                 |	Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Договор,
	                 |	Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.ДоговорРеализации,
	                 |	Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.ПроцентОтСтоимостиУслуг,
	                 |	Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Доля,
	                 |	втРеестрыИтогиПоОрганизации.СуммаСНалогом * (Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.ПроцентОтСтоимостиУслуг / 100) * Логс_ПроцентыСтоимостиУслугСКСTMSСрезПоследних.Доля") ;  
	
	Результат = Запрос.ВыполнитьПакет();
	
	ТаблицаРеестров 		= Результат[1].Выгрузить();
	ТаблицаУсловийПроцентов = Результат[3].Выгрузить();  
	
	ИтогРаспределения = 0;
	
	Для Каждого СтрУсловий из  ТаблицаУсловийПроцентов Цикл 
		
		ИтогРаспределения = СтрУсловий.СуммаЛимитаРаспределения;
		ОтборНеРаспределенных = Новый Структура;
		ОтборНеРаспределенных.Вставить("ПроцентОтСтоимостиУслуг", 0);
		ОтборНеРаспределенных.Вставить("Доля", 0);
		ОтборНеРаспределенных.Вставить("РаспределениеСКС", 0);
		ОтборНеРаспределенных.Вставить("Организация", СтрУсловий.Организация);
		
		МассивСтрок = ТаблицаРеестров.НайтиСтроки(ОтборНеРаспределенных);
		
		Для Каждого Стр из МассивСтрок Цикл 
			
			Если ИтогРаспределения < 0 Тогда 
				Прервать;
			КонецЕсли;   
			
			ЗаполнитьЗначенияСвойств(Стр, СтрУсловий, "КонтрагентСКС, ПартнерСКС, ДоговорСКС, ПроцентОтСтоимостиУслуг, Доля, ДоговорРеализации");  
			Стр.РаспределениеСКС 		= Стр.СуммаСНалогом * (СтрУсловий.ПроцентОтСтоимостиУслуг / 100);
						
			ИтогРаспределения = ИтогРаспределения - Стр.РаспределениеСКС;
			
		КонецЦикла;
					
	КонецЦикла; 

	
	Запрос = Новый Запрос;
	Запрос.Текст =  ("ВЫБРАТЬ
	                 |	втРеестрыОрганизация.Контрагент КАК Контрагент,
	                 |	втРеестрыОрганизация.Партнер КАК Партнер,
	                 |	втРеестрыОрганизация.Договор КАК Договор,
	                 |	втРеестрыОрганизация.ДатаОказанияУслуг КАК ДатаОказанияУслуг,
	                 |	втРеестрыОрганизация.Сумма КАК Сумма,
	                 |	втРеестрыОрганизация.СуммаСНалогом КАК СуммаСНалогом,
	                 |	втРеестрыОрганизация.Организация КАК Организация,
	                 |	втРеестрыОрганизация.КонтрагентСКС КАК КонтрагентСКС,
	                 |	втРеестрыОрганизация.ПартнерСКС КАК ПартнерСКС,
	                 |	втРеестрыОрганизация.ДоговорСКС КАК ДоговорСКС,
	                 |	втРеестрыОрганизация.ПроцентОтСтоимостиУслуг КАК ПроцентОтСтоимостиУслуг,
	                 |	втРеестрыОрганизация.КоличествоМаршрутов КАК КоличествоМаршрутов,
	                 |	втРеестрыОрганизация.КоличествоТочек КАК КоличествоТочек,
	                 |	втРеестрыОрганизация.Доля КАК Доля,
	                 |	втРеестрыОрганизация.РаспределениеСКС КАК РаспределениеСКС,
	                 |	втРеестрыОрганизация.ДоговорРеализации КАК ДоговорРеализации
	                 |ПОМЕСТИТЬ втРаспределение
	                 |ИЗ
	                 |	&втРеестрыОрганизация КАК втРеестрыОрганизация
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	Логс_СводМаршрутовРаспределениеСКС.Ссылка КАК СводМашрутов,
	                 |	Логс_СводМаршрутовРаспределениеСКС.Партнер КАК Партнер,
	                 |	Логс_СводМаршрутовРаспределениеСКС.Контрагент КАК Контрагент,
	                 |	Логс_СводМаршрутовРаспределениеСКС.Договор КАК Договор,
	                 |	Логс_СводМаршрутовРаспределениеСКС.ДатаОказанияУслуг КАК ДатаОказанияУслуг
	                 |ПОМЕСТИТЬ втСозданныеСводыМашрутов
	                 |ИЗ
	                 |	Документ.Логс_СводМаршрутов.РаспределениеСКС КАК Логс_СводМаршрутовРаспределениеСКС
	                 |ГДЕ
	                 |	Логс_СводМаршрутовРаспределениеСКС.ДатаОказанияУслуг МЕЖДУ &НачалоПериода И &КонецПериода
	                 |	И Логс_СводМаршрутовРаспределениеСКС.Ссылка.Проведен
	                 |;
	                 |
	                 |////////////////////////////////////////////////////////////////////////////////
	                 |ВЫБРАТЬ
	                 |	втРаспределение.Контрагент КАК Контрагент,
	                 |	втРаспределение.Партнер КАК Партнер,
	                 |	втРаспределение.Договор КАК Договор,
	                 |	втРаспределение.ДатаОказанияУслуг КАК ДатаОказанияУслуг,
	                 |	втРаспределение.Сумма КАК Сумма,
	                 |	втРаспределение.СуммаСНалогом КАК СуммаСНалогом,
	                 |	втРаспределение.Организация КАК Организация,
	                 |	втРаспределение.КонтрагентСКС КАК КонтрагентСКС,
	                 |	втРаспределение.ПартнерСКС КАК ПартнерСКС,
	                 |	втРаспределение.ДоговорСКС КАК ДоговорСКС,
	                 |	втРаспределение.ПроцентОтСтоимостиУслуг КАК ПроцентОтСтоимостиУслуг,
	                 |	втРаспределение.Доля КАК Доля,
	                 |	втРаспределение.РаспределениеСКС КАК СуммаРаспределения,
	                 |	втРаспределение.ДоговорРеализации КАК ДоговорРеализации,
	                 |	ЕСТЬNULL(втСозданныеСводыМашрутов.СводМашрутов, НЕОПРЕДЕЛЕНО) КАК СводМаршрутов,
	                 |	втРаспределение.КоличествоТочек КАК КоличествоТочек,
	                 |	втРаспределение.КоличествоМаршрутов КАК КоличествоМаршрутов
	                 |ИЗ
	                 |	втРаспределение КАК втРаспределение
	                 |		ЛЕВОЕ СОЕДИНЕНИЕ втСозданныеСводыМашрутов КАК втСозданныеСводыМашрутов
	                 |		ПО втРаспределение.Контрагент = втСозданныеСводыМашрутов.Контрагент
	                 |			И втРаспределение.Партнер = втСозданныеСводыМашрутов.Партнер
	                 |			И втРаспределение.Договор = втСозданныеСводыМашрутов.Договор
	                 |			И втРаспределение.ДатаОказанияУслуг = втСозданныеСводыМашрутов.ДатаОказанияУслуг
	                 |ГДЕ
	                 |	втСозданныеСводыМашрутов.СводМашрутов ЕСТЬ NULL
	                 |	И втРаспределение.РаспределениеСКС <> 0
	                 |ИТОГИ
	                 |	СУММА(СуммаРаспределения)
	                 |ПО
	                 |	Организация,
	                 |	КонтрагентСКС,
	                 |	ПартнерСКС,
	                 |	ДоговорСКС");   
	Запрос.УстановитьПараметр("втРеестрыОрганизация", ТаблицаРеестров);   
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
	
	
	Результат = Запрос.Выполнить();
	
	ВыборкаОрганизации  = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОрганизации.Следующий() Цикл 
		
		ВыборкаПоКонтрагентам = ВыборкаОрганизации.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока ВыборкаПоКонтрагентам.Следующий() Цикл 
			
			ВыборкаПоПартнерам = ВыборкаПоКонтрагентам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаПоПартнерам.Следующий() Цикл 
			
				ВыборкаПоДоговорам = ВыборкаПоПартнерам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
				
				Пока ВыборкаПоДоговорам.Следующий() Цикл 
					
					СводМаршрутов 			 			 = Документы.Логс_СводМаршрутов.СоздатьДокумент();
					СводМаршрутов.Дата 		 			 = КонецДня(ДатаСводов);
					СводМаршрутов.Организация 			 = ВыборкаОрганизации.Организация;
					СводМаршрутов.Система     			 = Справочники.Логс_ВнешниеСистемы.TMS;
					СводМаршрутов.СамозанятыеНерезиденты = Истина;
					СводМаршрутов.СуммаДокумента		 = ВыборкаПоДоговорам.СуммаРаспределения;
					СводМаршрутов.КонтрагентСКС			 = ВыборкаПоКонтрагентам.КонтрагентСКС;
					СводМаршрутов.ПартнерСКС			 = ВыборкаПоКонтрагентам.КонтрагентСКС.Партнер;
					СводМаршрутов.ДоговорСКС			 = ВыборкаПоДоговорам.ДоговорСКС;  
					СводМаршрутов.Ответственный			 = ПараметрыСеанса.ТекущийПользователь;
					
					ВыборкаДетальная = ВыборкаПоДоговорам.Выбрать();
					//КолВоМаршрутов = 0;
					Пока ВыборкаДетальная.Следующий() Цикл 
						
						//КолВоМаршрутов = КолВоМаршрутов + 1;
						СтрокаСвода = СводМаршрутов.РаспределениеСКС.Добавить();
						ЗаполнитьЗначенияСвойств(СтрокаСвода, ВыборкаДетальная);
						//Это количество точек!!!
						//Если СтрокаСвода.КоличествоМаршрутов = 0 Тогда 
							СтрокаСвода.КоличествоМаршрутов = ВыборкаДетальная.КоличествоТочек;	
						//КонецЕсли;
												
					КонецЦикла;
					
					СводМаршрутов.УстановитьНовыйНомер(СокрЛП(ВыборкаПоДоговорам.ДоговорСКС.Номер) + "TMS-");
					СводМаршрутов.Записать(РежимЗаписиДокумента.Запись);
					
					
					Попытка
						СводМаршрутов.Записать(РежимЗаписиДокумента.Проведение);
					Исключение
						ТекстСообщения = СтрШаблон(
						НСтр("ru='Произошла ошибка при проведении свода маршрутов № %1 от %2: %3'"),
						СводМаршрутов.Номер, СводМаршрутов.Дата,
						КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
						ЗаписьЖурналаРегистрации("Создание сводов маршрутов СКС", УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
						ЕстьОшибки = Истина;
						Продолжить;
					КонецПопытки;   
					
				КонецЦикла;  //Договор
				
			КонецЦикла; //Партнер
			
		КонецЦикла; //Контрагент
		
	КонецЦикла; //Организация
	
	Возврат Не ЕстьОшибки;
    	
КонецФункции
//-- Ким Виктор 14.01.2025


Процедура СоздатьСводыЗаявокСКСВФоне(Параметры, АдресХранилища) Экспорт
	Перем Партнер;
	
	Параметры.Свойство("Партнер", Партнер);
	
	БылиОшибки = Не СоздатьСводыЗаявокСКС(Параметры.Дата, Параметры.НачалоПериода, Параметры.КонецПериода, Партнер);
	
	Результат = Новый Структура("Успешно", Не БылиОшибки);
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры  

//++ Ким Виктор 14.01.2025
//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15412

Процедура СоздатьСводыЗаявокСКСТМСВФоне(Параметры, АдресХранилища) Экспорт
	Перем Партнер;
	
	Параметры.Свойство("Партнер", Партнер);
	
	БылиОшибки = Не СоздатьСводыЗаявокСКСТМС(Параметры.Дата, Параметры.НачалоПериода, Параметры.КонецПериода, Партнер);
	
	Результат = Новый Структура("Успешно", Не БылиОшибки);
	ПоместитьВоВременноеХранилище(Результат, АдресХранилища);
	
КонецПроцедуры  
//-- Ким Виктор 14.01.2025


Процедура ПоместитьВоВременнуюТаблицуСводыЗаявокНаДоставкуКОформлениюСводов(МенеджерВременныхТаблиц, НачалоПериода, КонецПериода,
			ПериодФормирования = Неопределено, Партнер = Неопределено, Хаб = Неопределено)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоДня(НачалоПериода));
	Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецПериода));
	
	ТекстОтбора = "";
	Если Партнер <> Неопределено Тогда
		Запрос.УстановитьПараметр("Партнер", Партнер);
		ТекстОтбора = ТекстОтбора + "ЗаявкаНаДоставку.Партнер = &Партнер";
	КонецЕсли; 
	//Если Хаб <> Неопределено Тогда
	//	Запрос.УстановитьПараметр("Хаб", Хаб);
	//	ТекстОтбора = ТекстОтбора + "ЗаявкаНаДоставку.Хаб = &Хаб";
	//КонецЕсли; 
	Если ПериодФормирования <> Неопределено Тогда
		Запрос.УстановитьПараметр("ПериодФормирования", ПериодФормирования);
		
		Если ТекстОтбора <> "" Тогда
			ТекстОтбора = ТекстОтбора + " И ";
		КонецЕсли; 
		
		Если ТипЗнч(ПериодФормирования) = Тип("Массив") Тогда
			ТекстОтбора = ТекстОтбора + "(СостоянияЗаявокНаДоставку.ЗаявкаНаДоставку.Договор.Логс_ПериодФормированияСводовАгента В(&ПериодФормирования) ИЛИ " +
				"СостоянияЗаявокНаДоставку.ЗаявкаНаДоставку.Договор.Логс_ПериодФормированияСводовАгентаРег В(&ПериодФормирования))";
		Иначе
			ТекстОтбора = ТекстОтбора + "(СостоянияЗаявокНаДоставку.ЗаявкаНаДоставку.Договор.Логс_ПериодФормированияСводовАгента = &ПериодФормирования ИЛИ " +
				"СостоянияЗаявокНаДоставку.ЗаявкаНаДоставку.Договор.Логс_ПериодФормированияСводовАгентаРег = &ПериодФормирования)";
		КонецЕсли;
	КонецЕсли; 
	Если ТекстОтбора = "" Тогда
		ТекстОтбора = "ИСТИНА";
	КонецЕсли; 
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СостоянияЗаявокНаДоставку.ЗаявкаНаДоставку КАК ЗаявкаНаДоставку,
	|	СостоянияЗаявокНаДоставку.ДатаФормированияСвода КАК Период
	|ПОМЕСТИТЬ ЗаявкиКОформлению
	|ИЗ
	|	РегистрСведений.Логс_СостоянияЗаявокНаДоставку КАК СостоянияЗаявокНаДоставку
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Логс_СводЗаявокНаДоставку.Заявки КАК Логс_СводЗаявокНаДоставкуЗаявки
	|		ПО СостоянияЗаявокНаДоставку.ЗаявкаНаДоставку = Логс_СводЗаявокНаДоставкуЗаявки.ЗаявкаНаДоставку
	|			И (Логс_СводЗаявокНаДоставкуЗаявки.Ссылка.Проведен)
	|ГДЕ
	|	НЕ СостоянияЗаявокНаДоставку.СводСформирован
	|	И СостоянияЗаявокНаДоставку.ДатаФормированияСвода МЕЖДУ &НачалоПериода И &КонецПериода
	|	И Логс_СводЗаявокНаДоставкуЗаявки.Ссылка ЕСТЬ NULL
	|	И &ТекстОтбора ";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ТекстОтбора", ТекстОтбора);
	
	Запрос.Выполнить();
	
КонецПроцедуры 

Процедура ОтправитьПоПочтеСчетОтчет(Док, СчетОтчет, НужноОтправлять = Ложь, ТекстПисьма = "") Экспорт
	//Док = Объект.Свод.Ссылка;
	Если СокрЛП(Док.Организация.Наименование) = "Организация Логсис" Тогда
		Возврат;
	КонецЕсли;
	Если Док.Договор.Статус <> Перечисления.СтатусыДоговоровКонтрагентов.Действует Тогда
		Возврат;
	КонецЕсли;
	Если СокрЛП(Док.Контрагент.Код) = "00-00000753" И НужноОтправлять = Ложь Тогда
		Возврат;
	КонецЕсли;
	ДокМас = Новый Массив;
	ДокМас.Добавить(Док);	
	Путь = КаталогВременныхФайлов();
	ИмяДжсонФайла = "send"+Формат(ТекущаяДата()-Дата("19700101"), "ЧГ=")+".json";  // timestamp
	КонтрагентНаименование = Док.Контрагент.НаименованиеПолное;		
	
	//АдресаРассылок = Новый Массив;
	Если СокрЛП(СчетОтчет) = "Счет" Тогда
		ПолноеИмяФайлаОтчета = "" + Путь + Док.Номер + ".pdf";
		ИмяФайлаОтчета = "" + Док.Номер + ".pdf";
		ТаблицаАдресов = Док.Договор.Логс_EmailДляСчетов;
		Тема = "Счет на оплату № " + Док.Номер + Формат(Док.Дата,"ДФ=dd.MM.yyyy") + "г., " + Док.Организация.НаименованиеСокращенное + " для " + КонтрагентНаименование;
		Если ПустаяСтрока(ТекстПисьма) Тогда
			СодержаниеПисьма = "<p>Добрый день. Направляем счет на оплату № " + Док.Номер + " от " + Формат(Док.Дата,"ДФ=dd.MM.yyyy") + "г.</p>";
			//++ Ким Виктор 23.05.2025
			//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15587
			СодержаниеПисьма = СодержаниеПисьма + "<br><br><br><br><br>Данное письмо создано автоматически. Не направляйте сообщений в ответ." +
			"<br>В случае возникновения вопросов, Вы можете написать на почту Info@logsis.ru или обратиться к своему аккаунт-менеджеру";
			//-- Ким Виктор 23.05.2025
		Иначе
			СодержаниеПисьма = "<p>Добрый день. " + ТекстПисьма;
		КонецЕсли;
		
		КоллекцияПечатныхФорм = Новый ТаблицаЗначений;
		КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
		КоллекцияПечатныхФорм.Колонки.Добавить("ВРЕГ");
		КоллекцияПечатныхФорм.Колонки.Добавить("Экземпляров");
		НС = КоллекцияПечатныхФорм.Добавить();
		НС.ИмяМакета = "СчетНаОплату";
		НС.ВРЕГ = "СЧЕТНАОПЛАТУ";
		НС.Экземпляров = 1;
		//ТабДок = Обработки.ПечатьСчетовНаОплату.Печать(ДокМас,Новый Структура("ОтображатьФаксимиле,ДополнитьКомплектВнешнимиПечатнымиФормами",Истина,Ложь),КоллекцияПечатныхФорм,Новый СписокЗначений(),Новый Структура("ДоступнаПечатьПоКомплектно,ПараметрыОтправки",Ложь,Новый Структура));
		СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(ДокМас);
		ТабДок = Обработки.ПечатьСчетовНаОплату.СформироватьПечатнуюФормуСчетНаОплату(СтруктураТипов,Новый СписокЗначений,Новый Структура("ОтображатьФаксимиле,ДополнитьКомплектВнешнимиПечатнымиФормами",Истина,Ложь));
		ТабДок.Записать(ПолноеИмяФайлаОтчета,ТипФайлаТабличногоДокумента.PDF);
		
	ИначеЕсли СокрЛП(СчетОтчет) = "Отчет" Тогда
		ПолноеИмяФайлаОтчета = "" + Путь + Док.Номер + ".xlsx";
		ИмяФайлаОтчета = "" + Док.Номер + ".xlsx";
		ТаблицаАдресов = Док.Договор.Логс_EmailДляОтчетов;
		Если Док.Договор.Логс_ВидКлиентаCRM = Перечисления.Логс_ВидыКлиентовCRM.Принципал Тогда
			ВидОтчетаНадпись = "агента";
		ИначеЕсли Док.Договор.Логс_ВидКлиентаCRM = Перечисления.Логс_ВидыКлиентовCRM.Принципал Тогда
			ВидОтчетаНадпись = "субагента";
		КонецЕсли;		
		Тема = "Отчет " + ВидОтчетаНадпись + " № " + СокрЛП(Док.Номер) + " от " + Формат(Док.Дата,"ДФ=dd.MM.yyyy") + "г., Расшифровка к отчету " + ВидОтчетаНадпись + " № " + СокрЛП(Док.Номер) + " от " + Формат(Док.Дата,"ДФ=dd.MM.yyyy") + "г., " + Док.Организация.НаименованиеСокращенное + " для " + КонтрагентНаименование;
		Если ПустаяСтрока(ТекстПисьма) Тогда
			СодержаниеПисьма = "<p>Добрый день. Направляем отчет " + ВидОтчетаНадпись + " № " + СокрЛП(Док.Номер) + " от " + Формат(Док.Дата,"ДФ=dd.MM.yyyy") + "г., расшифровка к отчету " + ВидОтчетаНадпись + " № " + СокрЛП(Док.Номер) + " от " + Формат(Док.Дата,"ДФ=dd.MM.yyyy") + "г.</p>";
			//++ Ким Виктор 23.05.2025
			//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15587
			СодержаниеПисьма = СодержаниеПисьма + "<br><br><br><br><br>Данное письмо создано автоматически. Не направляйте сообщений в ответ." +
			"<br>В случае возникновения вопросов, Вы можете написать на почту Info@logsis.ru или обратиться к своему аккаунт-менеджеру";
			//-- Ким Виктор 23.05.2025
		Иначе
			СодержаниеПисьма = "<p>Добрый день. " + ТекстПисьма;
		КонецЕсли;
		
		ТабДок = Документы.Логс_СводЗаявокНаДоставку.СформироватьПечатнуюФормуОтчетАгента(ДокМас,Новый СписокЗначений());
		ТабДок.Записать(ПолноеИмяФайлаОтчета,ТипФайлаТабличногоДокумента.XLSX);
		
		ПолноеИмяФайлаОтчетаРасширенный = "" + Путь + Док.Номер + " расширенный.xlsx";
		ИмяФайлаОтчетаРасширенный = "" + Док.Номер + " расширенный.xlsx";
		ТабДокРасширенная = Документы.Логс_СводЗаявокНаДоставку.СформироватьПечатнуюФормуРасшифровкаОтчетаАгента(ДокМас,Новый СписокЗначений());
		ТабДокРасширенная.Записать(ПолноеИмяФайлаОтчетаРасширенный,ТипФайлаТабличногоДокумента.XLSX);
	ИначеЕсли СокрЛП(СчетОтчет) = "УПД" Тогда
		ПолноеИмяФайлаОтчета = "" + Путь + Док.Номер + ".xlsx";
		ИмяФайлаОтчета = "" + Док.Номер + ".xlsx";
		ТаблицаАдресов = Док.Договор.Логс_EmailДляОтчетов;
		//Если Док.Договор.Логс_ВидКлиентаCRM = Перечисления.Логс_ВидыКлиентовCRM.Принципал Тогда
		//	ВидОтчетаНадпись = "агента";
		//ИначеЕсли Док.Договор.Логс_ВидКлиентаCRM = Перечисления.Логс_ВидыКлиентовCRM.Принципал Тогда
		//	ВидОтчетаНадпись = "субагента";
		//КонецЕсли;		
		Тема = "Расшифровка к УПД № " + СокрЛП(Док.Номер) + " от " + Формат(Док.Дата,"ДФ=dd.MM.yyyy") + "г., " + Док.Организация.НаименованиеСокращенное;
		СодержаниеПисьма = "<p>Добрый день. Направляем расшифровку к УПД № " + СокрЛП(Док.Номер) + " от " + Формат(Док.Дата,"ДФ=dd.MM.yyyy") + "г.</p>";
		//++ Ким Виктор 23.05.2025
		//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15587
		СодержаниеПисьма = СодержаниеПисьма + "<br><br><br><br><br>Данное письмо создано автоматически. Не направляйте сообщений в ответ." +
		"<br>В случае возникновения вопросов, Вы можете написать на почту Info@logsis.ru или обратиться к своему аккаунт-менеджеру";
		//-- Ким Виктор 23.05.2025
		Если ТипЗнч(Док) = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
			ТабДок = Документы.ОтчетКомитенту.СформироватьПечатнуюФормуРасшифровкаОтчетаАгента(ДокМас,Новый СписокЗначений());
		ИначеЕсли ТипЗнч(Док) = Тип("ДокументСсылка.АктВыполненныхРабот") Тогда
			ТабДок = Документы.АктВыполненныхРабот.СформироватьПечатнуюФормуРасшифровкаОтчетаАгента(ДокМас,Новый СписокЗначений());
		КонецЕсли;
		
		Если ТабДок.ВысотаТаблицы = 0 Тогда
			//тихий возврат;
			Возврат;
		КонецЕсли;
		ТабДок.Записать(ПолноеИмяФайлаОтчета,ТипФайлаТабличногоДокумента.XLSX);
	КонецЕсли;
	
	
	
	
	//Начинаем запись json
	Запись = Новый ЗаписьJSON;
	Запись.ОткрытьФайл("" + Путь + ИмяДжсонФайла);
	
	НастройкиСериализации = Новый НастройкиСериализацииJSON;
    НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
    НастройкиСериализации.ВариантЗаписиДаты = ВариантЗаписиДатыJSON.ЛокальнаяДата;
    
	
	//СписокАдресов в ТЕСТЕ только троим
	МассивАдресов = Новый Массив;
	АдресаСтрокой = "";
	
	Для каждого ЭлСтроки из ТаблицаАдресов Цикл
		Если ПустаяСтрока(ЭлСтроки.Адрес) Тогда
			Продолжить;
		КонецЕсли;		
		МассивАдресов.Добавить(Новый Структура("email,name,type",СокрЛП(ЭлСтроки.Адрес), СокрЛП(ЭлСтроки.Контакт), "to"));
		АдресаСтрокой = АдресаСтрокой + ?(СтрДлина(АдресаСтрокой)=0,"","; ") + СокрЛП(ЭлСтроки.Адрес);
	КонецЦикла;	
	Если МассивАдресов.Количество() = 0 Тогда
		МассивАдресов.Добавить(Новый Структура("email,name,type","t.zolina@logsis.ru", "Татьяна", "to"));
		Тема = Тема + " НЕТ АДРЕСОВ ДЛЯ РАССЫЛКИ, клиент " + СокрЛП(Док.Контрагент);		
	КонецЕсли;
	МассивАдресов.Добавить(Новый Структура("email,name,type","1c-robot@logsis.ru", "Robot", "to"));
	//Вставляем файл отчета
	МассивФайлов = Новый Массив;
	//Текст = Новый ДвоичныеДанные(ПолноеИмяФайлаОтчета);
	//МассивФайлов.Добавить(Новый Структура("type,name,content","application/vnd-excel", ИмяФайлаОтчета, Текст));
	//
	//Если СчетОтчет = "Отчет" Тогда
	//	ТекстРасширенный = Новый ДвоичныеДанные(ПолноеИмяФайлаОтчетаРасширенный);
	//	МассивФайлов.Добавить(Новый Структура("type,name,content","application/vnd-excel", ИмяФайлаОтчетаРасширенный, ТекстРасширенный));
	//КонецЕсли;	
	
	ИспользуетсяМандрил = Ложь;
	Если ИспользуетсяМандрил Тогда
		Текст = Base64Строка(Новый ДвоичныеДанные(ПолноеИмяФайлаОтчета));
		МассивФайлов.Добавить(Новый Структура("type,name,content","application/vnd-excel", ИмяФайлаОтчета, """" + Текст + """"));
		
		Если СчетОтчет = "Отчет" Тогда
			ТекстРасширенный = Base64Строка(Новый ДвоичныеДанные(ПолноеИмяФайлаОтчетаРасширенный));
			МассивФайлов.Добавить(Новый Структура("type,name,content","application/vnd-excel", ИмяФайлаОтчетаРасширенный, """" + ТекстРасширенный + """"));
		КонецЕсли;	
		МассивПолей = Новый Массив;
		МассивПолей.Добавить(Новый Структура("name,content","my-label", СодержаниеПисьма));
		
		//Начинаем структурировать json
		ДанныеСообщения = Новый Структура;
		ДанныеСообщения.Вставить("html", "" + СодержаниеПисьма + "<p><img src=""cid:logo""></p>");
		ДанныеСообщения.Вставить("subject", Тема);
		ДанныеСообщения.Вставить("from_email", "info@logsis.ru");
		ДанныеСообщения.Вставить("from_name", "logsis");
		ДанныеСообщения.Вставить("to", МассивАдресов);
		ДанныеСообщения.Вставить("important", "false");
		ДанныеСообщения.Вставить("track_opens", "null");
	    ДанныеСообщения.Вставить("track_clicks", "null");
	    ДанныеСообщения.Вставить("auto_text", "null");
	    ДанныеСообщения.Вставить("auto_html", "null");
	    ДанныеСообщения.Вставить("inline_css", "null");
	    ДанныеСообщения.Вставить("url_strip_qs", "null");
	    ДанныеСообщения.Вставить("preserve_recipients", "null");
	    ДанныеСообщения.Вставить("view_content_link", "null");
		ДанныеСообщения.Вставить("attachments", МассивФайлов);	
			
		Данные = Новый Структура;
		КлючАПИ = Константы.Логс_КлючАпиСервисаПочтовыхРассылок.Получить();
		КлючАПИ = ?(ЗначениеЗаполнено(КлючАПИ), КлючАПИ, "jUibmIWtROAJMMScZZiwDA");
		
		МассивКартинок = Новый Массив;
		//ПолноеИмяФайлаКартинки = "" + Путь + "logo.png";
		//Текст = Base64Строка(Новый ДвоичныеДанные(ПолноеИмяФайлаКартинки));
		//МассивФайлов.Добавить(Новый Структура("type,name,content","image/png", "logo", """" + Текст + """"));
		
		Данные.Вставить("key", КлючАПИ);
		Данные.Вставить("message",ДанныеСообщения);
		Данные.Вставить("images",МассивКартинок);
		Данные.Вставить("async", "false");
	    Данные.Вставить("ip_pool", "Main Pool");
	    Данные.Вставить("send_at", "2019-08-20 20:20:20");
	    
		ЗаписатьJSON(Запись, Данные, НастройкиСериализации);
	    Запись.Закрыть();
		
		//POST запрос к мандрилу
		АдресСервера = "mandrillapp.com";
		HTTPСоединение = Новый HTTPСоединение(АдресСервера,443,,,,,Новый ЗащищенноеСоединениеOpenSSL);
		
		ЗаголовокЗапросаHTTP = Новый Соответствие();	
		ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json; charset=utf-8");	
		
		запросPOST = Новый HTTPЗапрос("/api/1.0/messages/send.json", ЗаголовокЗапросаHTTP);
	//	запросPOST.УстановитьИмяФайлаТела("" + Путь + "send.json");
		запросPOST.УстановитьИмяФайлаТела("" + Путь + ИмяДжсонФайла);
		
		//ФайлРезультата = ПолучитьИмяВременногоФайла();
	//	HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(запросPOST, ФайлРезультата);
		HTTPОтвет = HTTPСоединение.ОтправитьДляОбработки(запросPOST);
		
		//Ответ = Новый ТекстовыйДокумент();
		//Ответ.Прочитать(ФайлРезультата, КодировкаТекста.UTF8);
		//ТекстОтвета = Ответ.ПолучитьТекст();
		
		РегистрыСведений.Логс_ПочтовыеРассылки.ЗарегистрироватьРассылку(АдресаСтрокой, Тема, СодержаниеПисьма, "Отправка отчетов", ТекущаяДата(), 
			HTTPОтвет.ПолучитьТелоКакСтроку(), , , Новый ХранилищеЗначения(Новый Структура("ИсходящийJSON", запросPOST.ПолучитьТелоКакСтроку())));
			
	Иначе //НЕ ИспользуетсяМандрил
		Текст = Новый ДвоичныеДанные(ПолноеИмяФайлаОтчета);
		МассивФайлов.Добавить(Новый Структура("type,name,content","application/vnd-excel", ИмяФайлаОтчета, Текст));
		
		Если СчетОтчет = "Отчет" Тогда
			ТекстРасширенный = Новый ДвоичныеДанные(ПолноеИмяФайлаОтчетаРасширенный);
			МассивФайлов.Добавить(Новый Структура("type,name,content","application/vnd-excel", ИмяФайлаОтчетаРасширенный, ТекстРасширенный));
		КонецЕсли;	

		РегистрыСведений.Логс_ПочтовыеРассылки.ОтправитьРассылку_В2(МассивАдресов, Тема, СодержаниеПисьма, Новый ХранилищеЗначения(Новый Структура("Вложения", МассивФайлов)),  "Отправка отчетов");
			
	КонецЕсли;			
			
			
	Попытка              
		УдалитьФайлы("" + Путь + ИмяДжсонФайла);
	Исключение КонецПопытки;
	
	Попытка              
		УдалитьФайлы(ПолноеИмяФайлаОтчета);
	Исключение КонецПопытки;

КонецПроцедуры

Функция НайтиСчетПоНазначениюПлатежаСтарый(Знач НазначениеТекст, Партнер) Экспорт
	
	Счет = Неопределено;
	
	Массив = Новый массив;
	Массив.Добавить("оплата по сч.");
	Массив.Добавить("счету");
	Массив.Добавить("№");
	Исключения = Новый Массив;
	Исключения.Добавить("-");
	Для каждого СтрПоиск Из Массив Цикл 
		Если ЗначениеЗаполнено(Счет) Тогда
			Прервать;
		КонецЕсли;	
	
		НомерСчета = "";
		НазначениеТекст = НРег(НазначениеТекст);
		Поз = СтрНайти(НазначениеТекст, СтрПоиск);
		Если Поз <> 0 Тогда
			Назначение = Прав(НазначениеТекст, СтрДлина(НазначениеТекст) - Поз+1);
			Назначение = СокрЛП(СтрЗаменить(Назначение, СтрПоиск, ""));
			ПерваяЦифраНайдена = Ложь;
			Пока Истина Цикл
				Если СтрДлина(Назначение) = 0 Тогда
					Прервать;
				КонецЕсли;
				Символ = Лев(Назначение, 1);
				
				// убираем возможные символы перед номеров (№ и т.д)
				Если Не ПерваяЦифраНайдена Тогда
					Если Не ЭтоЦифра(Символ, Исключения) Тогда
						Назначение = Прав(Назначение, СтрДлина(Назначение) - 1);
						Продолжить;
					Иначе
						ПерваяЦифраНайдена = Истина;
					КонецЕсли;
				КонецЕсли;
				
				// как только заканчиваются цифры - перестаем формировать номер
				Если Не ЭтоЦифра(Символ, Исключения) Тогда
					Прервать;
				КонецЕсли;
				НомерСчета = НомерСчета + Символ;
				Назначение = Прав(Назначение, СтрДлина(Назначение) - 1);			
			КонецЦикла;
			Если НЕ ПустаяСтрока(НомерСчета) Тогда
				Счет = Документы.СчетНаОплатуКлиенту.НайтиПоНомеру(НомерСчета, ТекущаяДата());
				НомерСчета = "";
				Если ЗначениеЗаполнено(Счет) Тогда
					Прервать;
				КонецЕсли;	
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;	
	
	Возврат Счет;
	        
КонецФункции

Функция НайтиСчетПоНазначениюПлатежа(Знач НазначениеТекст, Организация, Договор) Экспорт
	
	Счет = Неопределено;
	
	RegExp = Новый COMОбъект("VBScript.RegExp");// создаем объект для работы с регулярными выражениями
	RegExp.MultiLine = Истина;  // истина — текст многострочный, ложь — одна строка
	RegExp.Global = Истина;     // истина — поиск по всей строке, ложь — до первого совпадения
	RegExp.IgnoreCase = Истина; // истина — игнорировать регистр строки при поиске

	Шаблон = Организация.Префикс + "00-" + "\d+\d+\d+\d+\d+\d"; 
	RegExp.Pattern = Шаблон;    // шаблон (регулярное выражение)
	Matches = RegExp.Execute(НазначениеТекст);
	
	МассивНомера = Новый Массив;
	Для каждого StrMatches Из Matches Цикл		
		МассивНомера.Добавить(StrMatches.Value);				
	КонецЦикла;
	
	// если нашли несколько номеров, то разносить надо вручную
	Если МассивНомера.Количество() > 1 Тогда
		Возврат Счет;	
	КонецЕсли;	
	
	Для каждого НомерСчета Из МассивНомера Цикл
		Счет = Документы.СчетНаОплатуКлиенту.НайтиПоНомеру(НомерСчета, ТекущаяДата());
		Если Счет.Организация <> Организация ИЛИ Счет.Договор <> Договор Тогда
			Счет = Неопределено;
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат Счет;	 
	        
КонецФункции


Функция ЭтоЦифра(Символ, Исключения)
	
	Если Символ = "0" ИЛИ Символ = "1" ИЛИ Символ = "2" ИЛИ Символ = "3" ИЛИ Символ = "4" ИЛИ Символ = "5" ИЛИ
		 Символ = "6" ИЛИ Символ = "7" ИЛИ Символ = "8" ИЛИ Символ = "9" ИЛИ Исключения.Найти(ВРЕГ(Символ)) <> Неопределено Тогда
		 Возврат Истина;
	Иначе
		 Возврат Ложь;
	КонецЕсли;
	
КонецФункции	

Функция ПолучитьРеквизитыКУДИРПоступленияДС(ДокументСсылка)
	
	РеквизитыДокумента = Новый Структура("ХозяйственнаяОперация,КУДиРвОсобомПорядке", Неопределено, Ложь);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ПоступлениеБезналичныхДенежныхСредств.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Логс_КУДиРвОсобомПорядке, ЛОЖЬ) КАК КУДиРвОсобомПорядке
	|ИЗ
	|	Документ.ПоступлениеБезналичныхДенежныхСредств КАК ПоступлениеБезналичныхДенежныхСредств
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеБезналичныхДенежныхСредств.РасшифровкаПлатежа
	|							КАК ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ПО ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов.Договор = ДоговорыКонтрагентов.Ссылка
	|		ПО ПоступлениеБезналичныхДенежныхСредств.Ссылка = ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка
	|			И (ПоступлениеБезналичныхДенежныхСредствРасшифровкаПлатежа.НомерСтроки = 1)
	|ГДЕ
	|	ПоступлениеБезналичныхДенежныхСредств.Ссылка = &ДокументСсылка");
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, Выборка);
	КонецЕсли; 
	
	Возврат РеквизитыДокумента;
	
КонецФункции 

Функция ПолучитьРеквизитыКУДИРСписанияДС(ДокументСсылка)
	
	РеквизитыДокумента = Новый Структура("ХозяйственнаяОперация,КУДиРвОсобомПорядке", Неопределено, Ложь);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СписаниеБезналичныхДенежныхСредств.ХозяйственнаяОперация КАК ХозяйственнаяОперация,
	|	ЕСТЬNULL(ДоговорыКонтрагентов.Логс_КУДиРвОсобомПорядке, ЛОЖЬ) КАК КУДиРвОсобомПорядке
	|ИЗ
	|	Документ.СписаниеБезналичныхДенежныхСредств КАК СписаниеБезналичныхДенежныхСредств
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.СписаниеБезналичныхДенежныхСредств.РасшифровкаПлатежа
	|							КАК СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|			ПО СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.ОбъектРасчетов.Договор = ДоговорыКонтрагентов.Ссылка
	|		ПО СписаниеБезналичныхДенежныхСредств.Ссылка = СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.Ссылка
	|			И (СписаниеБезналичныхДенежныхСредствРасшифровкаПлатежа.НомерСтроки = 1)
	|ГДЕ
	|	СписаниеБезналичныхДенежныхСредств.Ссылка = &ДокументСсылка");
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(РеквизитыДокумента, Выборка);
	КонецЕсли; 
	
	Возврат РеквизитыДокумента;
	
КонецФункции 


Процедура РасходыПриУСНОбработатьКУДИРвОсобомПорядке(НаборЗаписей) Экспорт
	
	Регистратор = НаборЗаписей.Отбор.Регистратор.Значение;
	ТипРегистратора = ТипЗнч(Регистратор);
	
	Если КУДИРвОсобомПорядке(Регистратор) Тогда
		
		НаборЗаписей.Очистить();
		
	ИначеЕсли ТипРегистратора = Тип("ДокументСсылка.РегламентнаяОперация") Тогда
		
		ЗаписиДляУдаления = Новый Массив;
		
		Для каждого Запись Из НаборЗаписей Цикл
			
			Если ЗначениеЗаполнено(Запись.ДокументВозникновенияРасходов)
					И КУДИРвОсобомПорядке(Запись.ДокументВозникновенияРасходов)
			Тогда
				ЗаписиДляУдаления.Добавить(Запись);
			КонецЕсли;
			
		КонецЦикла;
		
		Для каждого Запись Из ЗаписиДляУдаления Цикл
			НаборЗаписей.Удалить(Запись);
		КонецЦикла;
		
	КонецЕсли; 
	
КонецПроцедуры 
#КонецОбласти  
