#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания; 

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДатаФормирования = КонецМесяца(ТекущаяДатаСеанса());
	КонецПериода = ДатаФормирования;
	НачалоПериода = НачалоМесяца(КонецПериода);
	ПоказатьОтчетПоЗавершении = Истина;
	СоздаватьПоступления = Истина;
	СоздаватьРеализации = Истина;
	СоздаватьОтчетыКомитента = Истина;
	СоздаватьАктыВыполненныхРабот = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания = ЗначениеЗаполнено(ИдентификаторЗадания);
	Если ПодключитьОбработчикОжидания Тогда
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаОжидание;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		ОтменитьВыполнениеЗадания();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборПартнерЗначениеПриИзменении(Элемент)
	
	ОтборПартнерИспользование = ЗначениеЗаполнено(ОтборПартнерЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьРеализацииПриИзменении(Элемент)
	Если СоздаватьРеализации Тогда
		СоздаватьПоступления = Истина;
	Иначе
		СоздаватьОтчетыКомитента = Ложь;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьОтчетыКомитентаПриИзменении(Элемент)
	Если СоздаватьОтчетыКомитента Тогда
		СоздаватьПоступления = Истина;
		СоздаватьРеализации = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СоздаватьПоступленияПриИзменении(Элемент)
	Если НЕ СоздаватьПоступления Тогда
		СоздаватьРеализации = Ложь;
		СоздаватьОтчетыКомитента = Ложь;
	КонецЕсли;

КонецПроцедуры 

&НаКлиенте
Процедура СоздаватьПоступленияСКСПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры


#КонецОбласти 

#Область ОбработчикиКомандыФормы

&НаКлиенте
Процедура ВыбратьПериод(Команда)

	ДиалогПериода = Новый ДиалогРедактированияСтандартногоПериода;
	ДиалогПериода.Период = Новый СтандартныйПериод(НачалоПериода, КонецПериода);
	
	Оповещение = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ДиалогПериода.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(ВыбранныйПериод, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйПериод <> Неопределено Тогда
		НачалоПериода = ВыбранныйПериод.ДатаНачала;
		КонецПериода = ВыбранныйПериод.ДатаОкончания;
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	ОчиститьСообщения();
	
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
	
	РезультатВыполнения = СоздатьДокументыНаСервере();
	
	Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаОжидание;
		
	ИначеЕсли РезультатВыполнения.Свойство("ОтказПроверкиЗаполнения") Тогда
		
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаПараметры;
		
	Иначе
		
		ОбработатьВыполнениеЗадания();
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтменитьВыполнениеЗадания()
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 

			ОбработатьВыполнениеЗадания();
		
		Иначе
			
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
				
		КонецЕсли;
			
	Исключение
			
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаПараметры;
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьПараметрыОбработки()
	
	СрокиВыставленияАктов = Новый Массив;
	Если СрокВыставленияАктовДваРазаВМесяц Тогда
		СрокиВыставленияАктов.Добавить(Перечисления.Логс_СрокиВыставленияАктовВыполненныхРабот.ДваРазаВМесяц);
	КонецЕсли; 
	Если СрокВыставленияАктовОдинРазВМесяц Тогда
		СрокиВыставленияАктов.Добавить(Перечисления.Логс_СрокиВыставленияАктовВыполненныхРабот.ОдинРазВМесяц);
	КонецЕсли; 
	
	ПараметрыОбработки = Новый Структура;
	ПараметрыОбработки.Вставить("Команда", "СоздатьДокументыПоДвижениюДенежныхСредств");
	ПараметрыОбработки.Вставить("ДатаФормирования", ДатаФормирования);
	ПараметрыОбработки.Вставить("НачалоПериода", НачалоПериода);
	ПараметрыОбработки.Вставить("КонецПериода", КонецПериода);
	ПараметрыОбработки.Вставить("СрокиВыставленияАктовВыполненныхРабот", СрокиВыставленияАктов);
	ПараметрыОбработки.Вставить("ТолькоСоздаватьНовые", НеПерезаписыватьДокументы);
	ПараметрыОбработки.Вставить("ПоказатьОтчетПоЗавершении", ПоказатьОтчетПоЗавершении);
	
	Создавать = Новый Структура;
	Создавать.Вставить("СоздаватьПоступления", СоздаватьПоступления);
	Создавать.Вставить("СоздаватьРеализации", СоздаватьРеализации);
	Создавать.Вставить("СоздаватьОтчетыКомитента", СоздаватьОтчетыКомитента);
	Создавать.Вставить("СоздаватьАктыВыполненныхРабот", СоздаватьАктыВыполненныхРабот);
	//++ Ким Виктор 22.01.2025
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15412
	//Перенесен код на форму сводов маршрутов 
	//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-15606 
	Создавать.Вставить("СоздаватьПоступленияСКСТМС", Ложь);
	//-- Ким Виктор 22.01.2025
	ПараметрыОбработки.Вставить("Создавать", Создавать);	
	
	Если ОтборПартнерИспользование Тогда
		ПараметрыОбработки.Вставить("Партнер", ОтборПартнерЗначение);
	КонецЕсли; 
	
	Если ОтборОрганизацияИспользование Тогда
		ПараметрыОбработки.Вставить("Организация", ОтборОрганизацияЗначение);
	Иначе
		ПараметрыОбработки.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	КонецЕсли; 
	
	Возврат ПараметрыОбработки;
	
КонецФункции 

&НаСервере
Функция СоздатьДокументыНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Новый Структура("ЗаданиеВыполнено, ОтказПроверкиЗаполнения", Истина, Истина);
	КонецЕсли; 
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
	ИдентификаторЗадания = Неопределено;
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаПараметры;
	
	ПараметрыЗагрузки = ПодготовитьПараметрыОбработки();
	
	РезультатВыполнения = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"Обработки.Логс_УУСозданиеРеглДокументов.СоздатьРеглДокументы",
		ПараметрыЗагрузки,
		"УУ Создание регламентированных документов от " + ТекущаяДатаСеанса());
		
	АдресХранилища       = РезультатВыполнения.АдресХранилища;
	ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыполнениеЗадания()
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаПараметры;
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЗакрытьФорму", РезультатВыполнения.Успешно);
	Если РезультатВыполнения.Свойство("ТабличныйДокумент") Тогда
		ДополнительныеПараметры.Вставить("ТабличныйДокумент", РезультатВыполнения.ТабличныйДокумент);
	КонецЕсли; 
	
	ТекстСообщения = ?(РезультатВыполнения.Успешно,
		НСтр("ru='Создание документов выполнено.'"),
		НСтр("ru='Во время создания документов приозошли ошибки.
			|Подробности см. в журнале регистрации'"));
	Оповещение = Новый ОписаниеОповещения("ОбработатьВыполнениеЗаданияЗавершение",
					ЭтотОбъект, ДополнительныеПараметры);
	ПоказатьПредупреждение(Оповещение, ТекстСообщения);
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьВыполнениеЗаданияЗавершение(ДополнительныеПараметры) Экспорт
	
	Если ПоказатьОтчетПоЗавершении Тогда
		
		ПараметрыФормы = Новый Структура("ТабличныйДокумент", ДополнительныеПараметры.ТабличныйДокумент);
		ОткрытьФорму("Обработка.Логс_УУСозданиеРеглДокументов.Форма.ОтчетОРезультатахВыполнения", ПараметрыФормы,, Новый УникальныйИдентификатор);
		
	КонецЕсли; 
	
	Если ДополнительныеПараметры.ЗакрытьФорму Тогда
		Закрыть();
	КонецЕсли; 
	
КонецПроцедуры 


#КонецОбласти 