#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЗаявкиНаРасходованиеДенежныхСредств(Команда)
	
	ОткрытьФормуОбработки("СозданиеЗаявокНаРасходованиеДС");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьРасходныеКассовыеОрдера(Команда)
	
	ОткрытьФорму("Обработка.Логс_СозданиеРасходныхКассовыхОрдеров.Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьСчетаНаОплату(Команда)
	
	ОткрытьФормуОбработки("СозданиеСчетовНаОплату");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыПоПоступлениюДенежныхСредств(Команда)
	
	ОткрытьФормуОбработки("СозданиеДокументовПоПоступлениюДенежныхСредств");
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьДокументыПоДвижениюДенежныхСредств(Команда)
	
	ОткрытьФормуОбработки("СозданиеДокументовПоДвижениюДенежныхСредств");
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОткрытьФормуОбработки(ИмяФормы)
	
	ОткрытьФорму("Обработка.Логс_УУСозданиеРеглДокументов.Форма." + ИмяФормы);
	
КонецПроцедуры 

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗагрузкаРазрешена() Тогда
		Элементы.ГруппаИнформация.Видимость = Ложь;
		Элементы.ГруппаКоманды.Доступность = Истина;
	Иначе
		Элементы.ГруппаИнформация.Видимость = Истина;
		Элементы.нпИнформация.Заголовок = "Для создания регламентированных документов необходимо заново зайти в систему.";
		Элементы.ГруппаКоманды.Доступность = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ЗагрузкаРазрешена()
	Можно = Истина;
	//Если КонфигурацияБазыДанныхИзмененаДинамически() Тогда
	//	Можно = Ложь;
	//КонецЕсли;
	
	Возврат Можно;
КонецФункции

#КонецОбласти 