#Область ОписаниеПеременных

&НаКлиенте
Перем ПараметрыОбработчикаОжидания; 

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Период = ТекущаяДатаСеанса();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания = ЗначениеЗаполнено(ИдентификаторЗадания);
	Если ПодключитьОбработчикОжидания Тогда
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаОжидание;
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Не ЗавершениеРаботы Тогда
		ОтменитьВыполнениеЗадания();
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборПартнерЗначениеПриИзменении(Элемент)
	
	ОтборПартнерИспользование = ЗначениеЗаполнено(ОтборПартнерЗначение);
	
КонецПроцедуры

#КонецОбласти 

#Область ОбработчикиКомандыФормы

&НаКлиенте
Процедура СоздатьДокументы(Команда)
	
	ОчиститьСообщения();
	
	ОтключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания");
	
	РезультатВыполнения = СоздатьДокументыНаСервере();
	
	Если Не РезультатВыполнения.ЗаданиеВыполнено Тогда
		
		ДлительныеОперацииКлиент.ИнициализироватьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
		ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаОжидание;
		
	ИначеЕсли РезультатВыполнения.Свойство("ОтказПроверкиЗаполнения") Тогда
		
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаПараметры;
		
	Иначе
		
		ОбработатьВыполнениеЗадания();
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОтменитьВыполнениеЗадания()
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
КонецПроцедуры 

&НаСервереБезКонтекста
Функция ЗаданиеВыполнено(ИдентификаторЗадания)
	
	Возврат ДлительныеОперации.ЗаданиеВыполнено(ИдентификаторЗадания);
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		
		Если ЗаданиеВыполнено(ИдентификаторЗадания) Тогда 

			ОбработатьВыполнениеЗадания();
		
		Иначе
			
			ДлительныеОперацииКлиент.ОбновитьПараметрыОбработчикаОжидания(ПараметрыОбработчикаОжидания);
			ПодключитьОбработчикОжидания(
				"Подключаемый_ПроверитьВыполнениеЗадания", 
				ПараметрыОбработчикаОжидания.ТекущийИнтервал, 
				Истина);
				
		КонецЕсли;
			
	Исключение
			
		Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаПараметры;
		ВызватьИсключение;
		
	КонецПопытки;
	
КонецПроцедуры

&НаСервере
Функция ПодготовитьПараметрыОбработки()
	
	СрокиПеречисленияНП = Новый Массив;
	Если СрокПеречисленияЕжедневно Тогда
		СрокиПеречисленияНП.Добавить(Перечисления.Логс_СрокиПеречисленияНП.Ежедневно);
	КонецЕсли; 
	Если СрокПеречисленияПлатежныйДень Тогда
		СрокиПеречисленияНП.Добавить(Перечисления.Логс_СрокиПеречисленияНП.ПлатежныйДень);
	КонецЕсли; 
	Если СрокПеречисленияЕженедельно Тогда
		СрокиПеречисленияНП.Добавить(Перечисления.Логс_СрокиПеречисленияНП.Еженедельно);
	КонецЕсли;
	Если НеПозднее10КалДней Тогда
		СрокиПеречисленияНП.Добавить(Перечисления.Логс_СрокиПеречисленияНП.НеПозднее10КалДней);
	КонецЕсли; 
	Если СрокПеречисленияЕжедневно3 Тогда
		СрокиПеречисленияНП.Добавить(Перечисления.Логс_СрокиПеречисленияНП.Ежедневно3);
	КонецЕсли; 
	Если СрокПеречисленияЕжедневно5 Тогда
		СрокиПеречисленияНП.Добавить(Перечисления.Логс_СрокиПеречисленияНП.Ежедневно5);
	КонецЕсли; 
	Если СрокПеречисленияЕженедельно3 Тогда
		СрокиПеречисленияНП.Добавить(Перечисления.Логс_СрокиПеречисленияНП.Еженедельно3);
	КонецЕсли;	
	Если СрокПеречисленияПлатежныйДеньСрПт Тогда
		СрокиПеречисленияНП.Добавить(Перечисления.Логс_СрокиПеречисленияНП.ПлатежныйДеньСрПт);
	КонецЕсли;    		
	Если СрокПеречисленияНеделяПлюсШестьДней Тогда
		СрокиПеречисленияНП.Добавить(Перечисления.Логс_СрокиПеречисленияНП.НеделяПлюсШестьДней);
	КонецЕсли;    		
	
	ПараметрыОбработки = Новый Структура;
	//ПараметрыОбработки.Вставить("Команда", "СоздатьЗаявкиНаРасходованиеДенежныхСредств");
	ПараметрыОбработки.Вставить("Команда", "СоздатьЗаявкиНаРасходованиеДенежныхСредств20");
	ПараметрыОбработки.Вставить("Период", Период);
	ПараметрыОбработки.Вставить("СрокиПеречисленияНП", СрокиПеречисленияНП);
	ПараметрыОбработки.Вставить("ТолькоСоздаватьНовые", НеПерезаписыватьДокументы);
	
	Если ОтборПартнерИспользование Тогда
		ПараметрыОбработки.Вставить("Партнер", ОтборПартнерЗначение);
	КонецЕсли; 
	
	Возврат ПараметрыОбработки;
	
КонецФункции 

&НаСервере
Функция СоздатьДокументыНаСервере()
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Новый Структура("ЗаданиеВыполнено, ОтказПроверкиЗаполнения", Истина, Истина);
	КонецЕсли; 
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
	ИдентификаторЗадания = Неопределено;
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаПараметры;
	
	ПараметрыЗагрузки = ПодготовитьПараметрыОбработки();
	
	РезультатВыполнения = ДлительныеОперации.ЗапуститьВыполнениеВФоне(
		УникальныйИдентификатор,
		"Обработки.Логс_УУСозданиеРеглДокументов.СоздатьРеглДокументы",
		ПараметрыЗагрузки,
		"УУ Создание регламентированных документов от " + ТекущаяДатаСеанса());
		
	АдресХранилища       = РезультатВыполнения.АдресХранилища;
	ИдентификаторЗадания = РезультатВыполнения.ИдентификаторЗадания;
	
	Возврат РезультатВыполнения;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьВыполнениеЗадания()
	
	Элементы.СтраницыФормы.ТекущаяСтраница = Элементы.ГруппаПараметры;
	
	РезультатВыполнения = ПолучитьИзВременногоХранилища(АдресХранилища);
	
	Если РезультатВыполнения.Успешно Тогда
		
		ТекстСообщения = НСтр("ru='Создание документов выполнено.'");
	
		ПараметрыВопроса = СтандартныеПодсистемыКлиент.ПараметрыВопросаПользователю();
		ПараметрыВопроса.ПредлагатьБольшеНеЗадаватьЭтотВопрос = Ложь;
		ПараметрыВопроса.Картинка = БиблиотекаКартинок.Информация32;
		
		Оповещение = Новый ОписаниеОповещения("ОбработатьВыполнениеЗаданияЗавершение", ЭтотОбъект);
		СтандартныеПодсистемыКлиент.ПоказатьВопросПользователю(Оповещение,
			ТекстСообщения, РежимДиалогаВопрос.ОК, ПараметрыВопроса);
		
	Иначе
		
		ТекстСообщения = НСтр("ru='Во время выполнения операции произошли ошибки.'");
		
		Если Не РезультатВыполнения.Свойство("СписокОшибок") Тогда
			ТекстСообщения = ТекстСообщения + Символы.ПС +
				НСтр("ru='Подробности см. в Журнале регистрации.'");
		Иначе
			Для каждого ОписаниеОшибки Из РезультатВыполнения.СписокОшибок Цикл
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
					ОписаниеОшибки.ТекстОшибки, ОписаниеОшибки.КлючДанных);
			КонецЦикла;
		КонецЕсли; 
		
		ПоказатьПредупреждение(, ТекстСообщения);
		
	КонецЕсли; 
	
КонецПроцедуры 

&НаКлиенте
Процедура ОбработатьВыполнениеЗаданияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Закрыть();
	
КонецПроцедуры 

&НаКлиенте
Процедура ВыбратьВсеСроки(Команда)
	СрокПеречисленияЕжедневно = Истина;
	СрокПеречисленияЕжедневно3 = Истина;
	СрокПеречисленияЕжедневно5 = Истина;
	СрокПеречисленияЕженедельно = Истина;
	СрокПеречисленияЕженедельно3 = Истина;
	СрокПеречисленияНеделяПлюсШестьДней = Истина;
	СрокПеречисленияПлатежныйДень = Истина;
	СрокПеречисленияПлатежныйДеньСрПт = Истина;
	НеПозднее10КалДней = Истина;
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсеСроки(Команда)
	СрокПеречисленияЕжедневно = Ложь;
	СрокПеречисленияЕжедневно3 = Ложь;
	СрокПеречисленияЕжедневно5 = Ложь;
	СрокПеречисленияЕженедельно = Ложь;
	СрокПеречисленияЕженедельно3 = Ложь;
	СрокПеречисленияНеделяПлюсШестьДней = Ложь;
	СрокПеречисленияПлатежныйДень = Ложь;
	СрокПеречисленияПлатежныйДеньСрПт = Ложь;
	НеПозднее10КалДней = Ложь;
КонецПроцедуры

#КонецОбласти 
