#Область ПредопределенныеДанные

//Тест новое

Функция ОрганизацияЛогсис() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.Логс_УправленческаяОрганизация.Получить();
	УстановитьПривилегированныйРежим(Ложь);
КонецФункции 

Функция УслугаДоставка() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.Логс_НоменклатураАгентскоеВознаграждение.Получить();
	
КонецФункции 

Функция СкладТоваровАгентов() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.Логс_СкладТовараАгентов.Получить();
	
КонецФункции 

Функция ТоварАгента() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	Возврат Константы.Логс_НоменклатураТоварАгентов.Получить();
	
КонецФункции 

Функция СвойствоОрганизацияФормироватьПКОПоНаложеннымПлатежам() Экспорт
	
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
		"Имя", "Организация_ФормироватьПКОПоНаложеннымПлатежам");
	
КонецФункции 

Функция СвойствоОбменСPimPay() Экспорт
	
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
		"Имя", "PimPayExchangeEnable");
	
КонецФункции 

#Область ОбменСCRM

Функция СвойствоИдентификаторКурьераCRM() Экспорт
	
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
		"Имя", "CRMExchangeСourierId");
	
КонецФункции 

Функция СвойствоИдентификаторОрганизацииCRM() Экспорт
	
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
		"Имя", "CRMExchangeCompanyId");
	
КонецФункции 

Функция СвойствоСотрудникОбменСCRM() Экспорт
	
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
		"Имя", "CRMExchangeCourierEnabled");
	
КонецФункции    

Функция СвойствоСотрудникиТипКурьера() Экспорт
	
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
		"Имя", "CRMExchangeCourierType");
	
КонецФункции 

Функция СвойствоСтавкаНДСОрганизацииCRM() Экспорт
	
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
		"Имя", "ОрганизацияСтавкаНДСCRM");
	
КонецФункции 

Функция ПолучитьХабПоИД(ИДХаба) Экспорт
	тИД = ?(ТипЗнч(ИДХаба) = Тип("Строка"), ИДХаба, Строка(ИДХаба));
	Хаб = Справочники.Логс_Хабы.НайтиПоРеквизиту("ИД", тИД);
	Если Не ЗначениеЗаполнено(Хаб) Тогда
		Хаб = Справочники.Логс_Хабы.Москва;
	КонецЕсли;
		
	Возврат Хаб;
КонецФункции

//++ Ким Виктор 03.06.2024
//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-13505
//Получить тип доставки
Функция ПолучитьТипДоставкиПоИД(ИДТипДоставки) Экспорт
	тИД = ?(ТипЗнч(ИДТипДоставки) = Тип("Строка"), ИДТипДоставки, Строка(ИДТипДоставки));
	ТипДоставки = Справочники.Логс_ТипыДоставок.НайтиПоРеквизиту("ИД", тИД);
	//Нужно ли значение по умолчанию?
	Возврат ТипДоставки;
КонецФункции
//-- Ким Виктор 03.06.2024

Функция КодРегионаПринадлежитХабам(КодРегиона) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КодыРегиона.КодРегиона КАК КодРегиона
	               |ИЗ
	               |	Справочник.Логс_Хабы.КодыРегиона КАК КодыРегиона
	               |ГДЕ
	               |	КодыРегиона.КодРегиона = &КодРегиона";
	Запрос.УстановитьПараметр("КодРегиона", КодРегиона);
	
	Результат = Запрос.Выполнить();
	Возврат НЕ Результат.Пустой();	
КонецФункции

Функция ПолучитьОсновнуюКассуХаба(Хаб, Организация) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Кассы.Касса КАК Касса
	               |ИЗ
	               |	Справочник.Логс_Хабы.Кассы КАК Кассы
	               |ГДЕ
	               |	Кассы.Ссылка = &Хаб
	               |	И Кассы.Касса.Владелец = &Организация";
	Запрос.УстановитьПараметр("Хаб", Хаб);
	Запрос.УстановитьПараметр("Организация", Организация);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Касса;
	Иначе
		Возврат Справочники.Кассы.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция ПолучитьХабСотрудника(Сотрудник) Экспорт
	Если ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Сотрудники") Тогда
		Подразделение = Сотрудник.Подразделение;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ДанныеДляПодбораСотрудников.Подразделение КАК Подразделение,
		               |	МАКСИМУМ(Логс_ХабыПодразделения.Ссылка) КАК Хаб,
		               |	ДанныеДляПодбораСотрудников.Сотрудник КАК Сотрудник
		               |ИЗ
		               |	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудников
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Логс_Хабы.Подразделения КАК Логс_ХабыПодразделения
		               |		ПО ДанныеДляПодбораСотрудников.Подразделение = Логс_ХабыПодразделения.Подразделение
		               |ГДЕ
		               |	ДанныеДляПодбораСотрудников.Сотрудник = &Сотрудник
		               |	И ДанныеДляПодбораСотрудников.Начало <= &ТекущаяДата
		               |	И ДанныеДляПодбораСотрудников.Окончание >= &ТекущаяДата
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДанныеДляПодбораСотрудников.Сотрудник,
		               |	ДанныеДляПодбораСотрудников.Подразделение
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Подразделение УБЫВ";
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	Ссылка КАК Хаб
		//               |ИЗ
		//               |	Справочник.Логс_Хабы.Подразделения КАК Подразделения
		//               |ГДЕ
		//               |	Подразделения.Подразделение = &Подразделение";
		//Запрос.УстановитьПараметр("Подразделение", Подразделение);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Хаб;
		Иначе
		    Возврат Справочники.Логс_Хабы.Москва;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Сотрудник) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Возврат ?(ЗначениеЗаполнено(Сотрудник.Логс_ХабКурьера), Сотрудник.Логс_ХабКурьера, Справочники.Логс_Хабы.Москва);
	ИначеЕсли ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Контрагенты") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДоговорыКонтрагентов.Логс_ХабКурьера КАК Хаб
		               |ИЗ
		               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		               |ГДЕ
		               |	ДоговорыКонтрагентов.Контрагент = &Контрагент
		               |	И ДоговорыКонтрагентов.ДатаНачалаДействия < &ТекущаяДата
		               |	И ДоговорыКонтрагентов.ДатаОкончанияДействия > &ТекущаяДата
		               |	И ДоговорыКонтрагентов.Логс_ОбменСCRM
		               |	И ДоговорыКонтрагентов.Логс_ВидКлиентаCRM = Значение(Перечисление.Логс_ВидыКлиентовCRM.СамозанятыйКурьер)
		               |	И ДоговорыКонтрагентов.Статус = Значение(Перечисление.СтатусыДоговоровКонтрагентов.Действует)";
		Запрос.УстановитьПараметр("Контрагент", Сотрудник);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Хаб;
		Иначе
		    Возврат Справочники.Логс_Хабы.Москва;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Партнеры") Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ДоговорыКонтрагентов.Логс_ХабКурьера КАК Хаб
		               |ИЗ
		               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		               |ГДЕ
		               |	ДоговорыКонтрагентов.Партнер = &Партнер
		               |	И ДоговорыКонтрагентов.ДатаНачалаДействия < &ТекущаяДата
		               |	И ДоговорыКонтрагентов.ДатаОкончанияДействия > &ТекущаяДата
		               |	И ДоговорыКонтрагентов.Логс_ОбменСCRM
		               |	И ДоговорыКонтрагентов.Логс_ВидКлиентаCRM = Значение(Перечисление.Логс_ВидыКлиентовCRM.СамозанятыйКурьер)
		               |	И ДоговорыКонтрагентов.Статус = Значение(Перечисление.СтатусыДоговоровКонтрагентов.Действует)";
		Запрос.УстановитьПараметр("Партнер", Сотрудник);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Хаб;
		Иначе
		    Возврат Справочники.Логс_Хабы.Москва;
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
#КонецОбласти 


#Область ОбменСTMS_АВИТО
//++ Ким Виктор 12.07.2024
//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-13870

Функция СвойствоИдентификаторКурьераTMS() Экспорт
	
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
		"Имя", "TMSExchangeСourierId");
	   	
КонецФункции 

Функция СвойствоСотрудникОбменСTMS() Экспорт
	
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
		"Имя", "TMSExchangeCourierEnabled");
	
КонецФункции


//Организации везде одинаковые
//Функция СвойствоИдентификаторОрганизацииCRM() Экспорт
//	
//	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту(
//		"Имя", "CRMExchangeCompanyId");
//	
//КонецФункции 

Функция ПолучитьХабСотрудникаTMS(Сотрудник) Экспорт
	Если ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Сотрудники") Тогда
		Подразделение = Сотрудник.Подразделение;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
		               |	ДанныеДляПодбораСотрудников.Подразделение КАК Подразделение,
		               |	МАКСИМУМ(Логс_Хабы_ТМСПодразделения.Ссылка) КАК Хаб,
		               |	ДанныеДляПодбораСотрудников.Сотрудник КАК Сотрудник
		               |ИЗ
		               |	РегистрСведений.ДанныеДляПодбораСотрудников КАК ДанныеДляПодбораСотрудников
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Логс_Хабы_ТМС.Подразделения КАК Логс_Хабы_ТМСПодразделения
		               |		ПО ДанныеДляПодбораСотрудников.Подразделение = Логс_Хабы_ТМСПодразделения.Подразделение
		               |ГДЕ
		               |	ДанныеДляПодбораСотрудников.Сотрудник = &Сотрудник
		               |	И ДанныеДляПодбораСотрудников.Начало <= &ТекущаяДата
		               |	И ДанныеДляПодбораСотрудников.Окончание >= &ТекущаяДата
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ДанныеДляПодбораСотрудников.Сотрудник,
		               |	ДанныеДляПодбораСотрудников.Подразделение
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	Подразделение УБЫВ";
		Запрос.УстановитьПараметр("Сотрудник", Сотрудник);
		Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
		
		//Запрос.Текст = "ВЫБРАТЬ
		//               |	Ссылка КАК Хаб
		//               |ИЗ
		//               |	Справочник.Логс_Хабы.Подразделения КАК Подразделения
		//               |ГДЕ
		//               |	Подразделения.Подразделение = &Подразделение";
		//Запрос.УстановитьПараметр("Подразделение", Подразделение);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Хаб;
		Иначе
		    Возврат Справочники.Логс_Хабы_ТМС.Москва;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Сотрудник) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		Возврат ?(ЗначениеЗаполнено(Сотрудник.Логс_ХабКурьера), Сотрудник.Логс_ХабКурьера, Справочники.Логс_Хабы_ТМС.Москва);
	//ИначеЕсли ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Контрагенты") Тогда
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	ДоговорыКонтрагентов.Логс_ХабКурьера КАК Хаб
	//	               |ИЗ
	//	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	//	               |ГДЕ
	//	               |	ДоговорыКонтрагентов.Контрагент = &Контрагент
	//	               |	И ДоговорыКонтрагентов.ДатаНачалаДействия < &ТекущаяДата
	//	               |	И ДоговорыКонтрагентов.ДатаОкончанияДействия > &ТекущаяДата
	//	               |	И ДоговорыКонтрагентов.Логс_ОбменСCRM
	//	               |	И ДоговорыКонтрагентов.Логс_ВидКлиентаCRM = Значение(Перечисление.Логс_ВидыКлиентовCRM.СамозанятыйКурьер)
	//	               |	И ДоговорыКонтрагентов.Статус = Значение(Перечисление.СтатусыДоговоровКонтрагентов.Действует)";
	//	Запрос.УстановитьПараметр("Контрагент", Сотрудник);
	//	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		Возврат Выборка.Хаб;
	//	Иначе
	//	    Возврат Справочники.Логс_Хабы_ТМС.Москва;
	//	КонецЕсли;
	//ИначеЕсли ТипЗнч(Сотрудник) = Тип("СправочникСсылка.Партнеры") Тогда
	//	Запрос.Текст = "ВЫБРАТЬ
	//	               |	ДоговорыКонтрагентов.Логс_ХабКурьера КАК Хаб
	//	               |ИЗ
	//	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	//	               |ГДЕ
	//	               |	ДоговорыКонтрагентов.Партнер = &Партнер
	//	               |	И ДоговорыКонтрагентов.ДатаНачалаДействия < &ТекущаяДата
	//	               |	И ДоговорыКонтрагентов.ДатаОкончанияДействия > &ТекущаяДата
	//	               |	И ДоговорыКонтрагентов.Логс_ОбменСCRM
	//	               |	И ДоговорыКонтрагентов.Логс_ВидКлиентаCRM = Значение(Перечисление.Логс_ВидыКлиентовCRM.СамозанятыйКурьер)
	//	               |	И ДоговорыКонтрагентов.Статус = Значение(Перечисление.СтатусыДоговоровКонтрагентов.Действует)";
	//	Запрос.УстановитьПараметр("Партнер", Сотрудник);
	//	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());
	//	Выборка = Запрос.Выполнить().Выбрать();
	//	Если Выборка.Следующий() Тогда
	//		Возврат Выборка.Хаб;
	//	Иначе
	//	    Возврат Справочники.Логс_Хабы_ТМС.Москва;
	//	КонецЕсли;
	КонецЕсли;
	
КонецФункции
//-- Ким Виктор 12.07.2024

//++ Ким Виктор 14.05.2025
//https://jira-sd.logsis.ru/projects/TSLOG/queues/custom/18/TSLOG-16211
Функция СвойствоИдентификаторКурьераTMS_LOG() Экспорт
	
	Возврат ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоРеквизиту("Имя", "TMS_LOG");

КонецФункции 
//-- Ким Виктор 14.05.2025


#КонецОбласти    




#Область Зарплата

Функция НачислениеШтрафУУ() Экспорт
	
	Возврат ПланыВидовРасчета.Начисления.НайтиПоНаименованию(
		"Штраф УУ", Истина);
	
КонецФункции 

Функция НачислениеСдельныйНаряд() Экспорт
	
	Возврат ПланыВидовРасчета.Начисления.НайтиПоНаименованию(
		"Сдельная оплата УУ", Истина);
	
КонецФункции 

Функция ВидДокументаСдельныеРаботы() Экспорт
	
	Возврат Справочники.ВидыДокументовВводДанныхДляРасчетаЗарплаты.НайтиПоНаименованию(
		"Сдельные работы", Истина);
	
КонецФункции 

#КонецОбласти 

#КонецОбласти 

#Область Прочее

Функция ДатаАлгоритмаВзаиморазчетовСАгентами20() Экспорт
	
	Возврат '20190826';
	
КонецФункции 

Функция ФормаОплатыУслугАгенту(Договор, РегиональнаяЗаявка, Дата) Экспорт
	Возврат Логс_ДоговорыАгентов.ФормаОплатыУслугАгенту(Договор, РегиональнаяЗаявка, Дата);
КонецФункции

Функция ПолучитьСтавкуНДС(СтавкаНДС) Экспорт
		//Возврат УчетНДСУПКлиентСервер.ПолучитьСтавкуНДС(СтавкаНДС)
	Если СтавкаНДС = Перечисления.СтавкиНДС.НДС20 Тогда
		Возврат 20;
	//++ Ким Виктор 22.12.2025
	//Новая ставка НДС 22
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС22 Тогда 
		Возврат 22;
	//-- Ким Виктор 22.12.2025
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.БезНДС Тогда
		Возврат 0; 
	ИначеЕсли СтавкаНДС = Перечисления.СтавкиНДС.НДС5 Тогда
		Возврат 5;
	ИначеЕсли ТипЗнч(СтавкаНДС) = Тип("СправочникСсылка.СтавкиНДС") Тогда
		Возврат УчетНДСУПВызовСервера.ЗначениеСтавкиНДС(СтавкаНДС);
	КонецЕсли;


КонецФункции
#КонецОбласти 

#Область РаботаСДатами

Функция ДобавитьРабочиеДни(ПроизводственныйКалендарь, Дата, КоличествоРабочихДней) Экспорт
	КДень = Дата; //текущий календарный день
	КРД = 0; //количество рабочих дней
	ТРД = Дата;  //текущий рабочий день
	Пока КРД<КоличествоРабочихДней Цикл
		// добавляем 10 календарных дней к дате
		НачальныеДаты = Новый Массив;
		Для сч = 1 по 10 Цикл
			КДень = КонецДня(КДень) + 1;
			НачальныеДаты.Добавить(КДень);
		КонецЦикла;	
		// определяем рабочие дни
		РабочиеДни = КалендарныеГрафики.ДатыБлижайшихРабочихДней(ПроизводственныйКалендарь, НачальныеДаты, Истина, Ложь, Истина);
		Для Каждого КД из НачальныеДаты Цикл
			Если РабочиеДни[КД]>ТРД Тогда
				ТРД = РабочиеДни[КД];
				КРД = КРД+1;
			КонецЕсли;
			Если КРД = КоличествоРабочихДней Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	Возврат ТРД;
КонецФункции

Функция РассчитатьДатуФормированияСвода(Договор, РегиональнаяЗаявка, Дата, Статус, ОплачиваемаяЗаявка) Экспорт
	
	ДатаФормированияСвода = Неопределено;
	
	Если ЗначениеЗаполнено(Договор) Тогда
		ДанныеДоговора = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Договор,
			"Логс_ВключатьВозвратыВПоследнийСводМесяца," +
			"Логс_ВключатьОтменыВПоследнийСводМесяца," +
			"Логс_ПериодФормированияСводовАгента,Логс_СрокВыставленияСчетаЗаУслугиАгента," +
			"Логс_ПериодФормированияСводовАгентаРег,Логс_СрокВыставленияСчетаЗаУслугиАгентаРег");
		
		Если ДанныеДоговора.Логс_ВключатьВозвратыВПоследнийСводМесяца И
			(Статус = "Полн. отказ" или (Статус="Отмена" и ОплачиваемаяЗаявка)) Тогда
			Возврат КонецМесяца(Дата);
		КонецЕсли;
		Если ДанныеДоговора.Логс_ВключатьОтменыВПоследнийСводМесяца И
			(Статус="Отмена") Тогда
			Возврат КонецМесяца(Дата);
		КонецЕсли;
		
		ПериодФормированияСводов = Логс_ДоговорыАгентов.ПериодФормированияСводов(ДанныеДоговора, РегиональнаяЗаявка);
		СрокВыставленияСчетаЗаУслугиАгента = Логс_ДоговорыАгентов.СрокВыставленияСчетаЗаУслугиАгента(ДанныеДоговора, РегиональнаяЗаявка);
		                                                               
		ДатаОкончанияПериода =
			?(СрокВыставленияСчетаЗаУслугиАгента = Перечисления.Логс_СрокиВыставленияСчетаЗаУслугиАгента.Число_15_30
					И День(Дата) <= 15,
				КонецДня(Дата(Год(Дата), Месяц(Дата), 15)),
				КонецМесяца(Дата));
		
		Если ПериодФормированияСводов = Перечисления.Логс_ПериодыФормированияСводовАгентов.ДваРазаВНеделю Тогда
			ДниНедели = Новый Массив;
			ДниНедели.Добавить(3); // Среда
			ДниНедели.Добавить(7); // Воскресенье
			ДатаКонецНедели = Логс_ДополнительныеПроцедурыИФункции.ПолучитьБлижайшийДеньНедели(Дата, ДниНедели);
			ДатаФормированияСвода = Мин(ДатаКонецНедели, ДатаОкончанияПериода);
		ИначеЕсли ПериодФормированияСводов = Перечисления.Логс_ПериодыФормированияСводовАгентов.Еженедельно Тогда
			ДниНедели = Новый Массив;
			ДниНедели.Добавить(7); // Воскресенье
			ДатаКонецНедели = Логс_ДополнительныеПроцедурыИФункции.ПолучитьБлижайшийДеньНедели(Дата, ДниНедели);
			ДатаФормированияСвода = Мин(ДатаКонецНедели, ДатаОкончанияПериода);
		ИначеЕсли ПериодФормированияСводов = Перечисления.Логс_ПериодыФормированияСводовАгентов.ДваРазаВМесяц Тогда
			ДатаФормированияСвода = ?(День(Дата) <= 15,
							Дата(Год(Дата), Месяц(Дата), 15),
							КонецМесяца(Дата));
		ИначеЕсли ПериодФормированияСводов = Перечисления.Логс_ПериодыФормированияСводовАгентов.Ежедневно Тогда
			ДатаФормированияСвода = Дата;
		ИначеЕсли ПериодФормированияСводов = Перечисления.Логс_ПериодыФормированияСводовАгентов.Ежемесячно Тогда
			ДатаФормированияСвода = КонецМесяца(Дата);
		ИначеЕсли ПериодФормированияСводов = перечисления.Логс_ПериодыФормированияСводовАгентов.Декадно Тогда
			Год =  Год(Дата);
			Месяц = Месяц(Дата);   			
			Если Дата <= КонецДня(Дата(Год, Месяц, 10)) Тогда
				ДатаФормированияСвода = Дата(Год, Месяц, 10);
			ИначеЕсли Дата <= КонецДня(Дата(Год, Месяц, 20)) Тогда
				ДатаФормированияСвода = Дата(Год, Месяц, 20);
			Иначе
				ДатаФормированияСвода = КонецМесяца(Дата);	
			КонецЕсли;
		ИначеЕсли ПериодФормированияСводов = Перечисления.Логс_ПериодыФормированияСводовАгентов.ПоПятницам Тогда
			ДниНедели = Новый Массив;
			ДниНедели.Добавить(7); // Воскресенье
			ДатаКонецНедели = Логс_ДополнительныеПроцедурыИФункции.ПолучитьБлижайшийДеньНедели(Дата, ДниНедели);
			//ДниНедели.Очистить();
			//ДниНедели.Добавить(5); //пятница (следующая)
			//ДатаФормированияСвода = Логс_ДополнительныеПроцедурыИФункции.ПолучитьБлижайшийДеньНедели(
			//		Мин(ДатаКонецНедели, КонецМесяца(Дата)), ДниНедели);  //минимум из воскресенья и конца месяца и ближайшая пятника к нему
			ДатаФормированияСвода = Мин(ДатаКонецНедели, КонецМесяца(Дата));  
		КонецЕсли; 
		
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(ДатаФормированияСвода) Тогда
		ДатаФормированияСвода = ТекущаяДатаСеанса();
	КонецЕсли; 
	
	Возврат ДатаФормированияСвода;
КонецФункции

Функция РассчитатьПериодУслугиДляСчета(РасчетнаяДата, СрокВыставления) Экспорт
	//Логс_СрокВыставленияСчетаЗаУслугиАгента
	СтруктураПериода = Новый Структура("НачалоПериода, ОкончаниеПериода", Дата(1,1,1), дата(31,1,1));
	
	Если СрокВыставления = Перечисления.Логс_СрокиВыставленияСчетаЗаУслугиАгента.Число30 Тогда
		СтруктураПериода.НачалоПериода = НачалоМесяца(РасчетнаяДата);
		СтруктураПериода.ОкончаниеПериода = КонецМесяца(РасчетнаяДата);
	ИначеЕсли СрокВыставления = Перечисления.Логс_СрокиВыставленияСчетаЗаУслугиАгента.Число_15_30 Тогда
		Если День(РасчетнаяДата)<16 Тогда
			СтруктураПериода.НачалоПериода = НачалоМесяца(РасчетнаяДата);
			СтруктураПериода.ОкончаниеПериода = КонецДня(Дата(Год(РасчетнаяДата), Месяц(РасчетнаяДата), 15));
		Иначе
			СтруктураПериода.НачалоПериода = Дата(Год(РасчетнаяДата), Месяц(РасчетнаяДата), 16);
			СтруктураПериода.ОкончаниеПериода = КонецМесяца(РасчетнаяДата);
		КонецЕсли;     
	ИначеЕсли СрокВыставления = Перечисления.Логс_СрокиВыставленияСчетаЗаУслугиАгента.Декадно Тогда  
		Если День(РасчетнаяДата)<11 Тогда
			СтруктураПериода.НачалоПериода = НачалоМесяца(РасчетнаяДата);
			СтруктураПериода.ОкончаниеПериода = КонецДня(Дата(Год(РасчетнаяДата), Месяц(РасчетнаяДата), 10));
		ИначеЕсли День(РасчетнаяДата)<21 Тогда
			СтруктураПериода.НачалоПериода = Дата(Год(РасчетнаяДата), Месяц(РасчетнаяДата), 11);
			СтруктураПериода.ОкончаниеПериода = КонецДня(Дата(Год(РасчетнаяДата), Месяц(РасчетнаяДата), 20));
		Иначе
			СтруктураПериода.НачалоПериода = Дата(Год(РасчетнаяДата), Месяц(РасчетнаяДата), 21);
			СтруктураПериода.ОкончаниеПериода = КонецМесяца(РасчетнаяДата);
		КонецЕсли;     
	ИначеЕсли СрокВыставления = Перечисления.Логс_СрокиВыставленияСчетаЗаУслугиАгента.РазаВМесяц4 Тогда  
		СтруктураПериода.НачалоПериода = НачалоНедели(РасчетнаяДата);
		СтруктураПериода.ОкончаниеПериода = КонецНедели(РасчетнаяДата);
	Иначе        
		//исключительная ситуация
		СтруктураПериода.НачалоПериода = НачалоДня(РасчетнаяДата);
		СтруктураПериода.ОкончаниеПериода = НачалоДня(РасчетнаяДата);
	КонецЕсли; 
	
	Возврат СтруктураПериода
КонецФункции
#КонецОбласти

#Область Константы_Кастомные
Функция ПолучитьЗначениеКонстантыЛогс(ИмяКонстанты) Экспорт
	Возврат РегистрыСведений.Логс_Константы.ПолучитьЗначениеКонстанты(ИмяКонстанты, Ложь);
КонецФункции
#КонецОбласти